ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Copyright (c) 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * THIS SOFTWARE IS PROVIDED BY FREESCALE "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT
 * SHALL FREESCALE BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT
 * OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING
 * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
 * OF SUCH DAMAGE.
 */
/*
 * WARNING! DO NOT EDIT THIS FILE DIRECTLY!
 *
 * This file was generated automatically and any changes may be lost.
 */
#ifndef __HW_USBHS_REGISTERS_H__
#define __HW_USBHS_REGISTERS_H__

#include "regs.h"

/*
 * MK70F12 USBHS
 *
 * USB HS/FS/LS OTG Controller
 *
 * Registers defined in this header file:
 * - HW_USBHS_ID - Identification Register
 * - HW_USBHS_HWGENERAL - General Hardware Parameters Register
 * - HW_USBHS_HWHOST - Host Hardware Parameters Register
 * - HW_USBHS_HWDEVICE - Device Hardware Parameters Register
 * - HW_USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register
 * - HW_USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register
 * - HW_USBHS_GPTIMER0LD - General Purpose Timer n Load Register
 * - HW_USBHS_GPTIMER0CTL - General Purpose Timer n Control Register
 * - HW_USBHS_GPTIMER1LD - General Purpose Timer n Load Register
 * - HW_USBHS_GPTIMER1CTL - General Purpose Timer n Control Register
 * - HW_USBHS_USB_SBUSCFG - System Bus Interface Configuration Register
 * - HW_USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register
 * - HW_USBHS_HCSPARAMS - Host Controller Structural Parameters Register
 * - HW_USBHS_HCCPARAMS - Host Controller Capability Parameters Register
 * - HW_USBHS_DCIVERSION - Device Controller Interface Version
 * - HW_USBHS_DCCPARAMS - Device Controller Capability Parameters
 * - HW_USBHS_USBCMD - USB Command Register
 * - HW_USBHS_USBSTS - USB Status Register
 * - HW_USBHS_USBINTR - USB Interrupt Enable Register
 * - HW_USBHS_FRINDEX - Frame Index Register
 * - HW_USBHS_DEVICEADDR - Device Address Register
 * - HW_USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register
 * - HW_USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register
 * - HW_USBHS_EPLISTADDR - Endpoint List Address Register
 * - HW_USBHS_TTCTRL - Host TT Asynchronous Buffer Control
 * - HW_USBHS_BURSTSIZE - Master Interface Data Burst Size Register
 * - HW_USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register
 * - HW_USBHS_ULPI_VIEWPORT - ULPI Register Access
 * - HW_USBHS_ENDPTNAK - Endpoint NAK Register
 * - HW_USBHS_ENDPTNAKEN - Endpoint NAK Enable Register
 * - HW_USBHS_CONFIGFLAG - Configure Flag Register
 * - HW_USBHS_PORTSC1 - Port Status and Control Registers
 * - HW_USBHS_OTGSC - On-the-Go Status and Control Register
 * - HW_USBHS_USBMODE - USB Mode Register
 * - HW_USBHS_EPSETUPSR - Endpoint Setup Status Register
 * - HW_USBHS_EPPRIME - Endpoint Initialization Register
 * - HW_USBHS_EPFLUSH - Endpoint Flush Register
 * - HW_USBHS_EPSR - Endpoint Status Register
 * - HW_USBHS_EPCOMPLETE - Endpoint Complete Register
 * - HW_USBHS_EPCR0 - Endpoint Control Register 0
 * - HW_USBHS_EPCRn - Endpoint Control Register n
 * - HW_USBHS_EPCRn - Endpoint Control Register n
 * - HW_USBHS_EPCRn - Endpoint Control Register n
 * - HW_USBHS_USBGENCTRL - USB General Control Register
 *
 * - hw_usbhs_t - Struct containing all module registers.
 */

//! @name Module base addresses
//@{
#ifndef REGS_USBHS_BASE
#define HW_USBHS_INSTANCE_COUNT (1U) //!< Number of instances of the USBHS module.
#define REGS_USBHS_BASE (0x40034000U) //!< Base address for USBHS.
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_ID - Identification Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_ID - Identification Register (RO)
 *
 * Reset value: 0xE461FA05U
 *
 * The ID register provides a simple way to determine if the module is provided
 * in the system. The ID register identifies the module and its revision.
 */
typedef union _hw_usbhs_id
{
    uint32_t U;
    struct _hw_usbhs_id_bitfields
    {
        uint32_t ID : 6;               //!< [5:0] Configuration number
        uint32_t RESERVED0 : 2;        //!< [7:6] Reserved
        uint32_t NID : 6;              //!< [13:8]
        uint32_t RESERVED1 : 2;        //!< [15:14] Reserved
        uint32_t TAG : 5;              //!< [20:16] Tag
        uint32_t REVISION : 4;         //!< [24:21] Revision
        uint32_t VERSION : 4;          //!< [28:25] Version
        uint32_t VERSIONID : 3;        //!< [31:29] Version ID
    } B;
} hw_usbhs_id_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_ID register
 */
//@{
#define HW_USBHS_ID_ADDR         (REGS_USBHS_BASE + 0x0U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_ID              (*(__I hw_usbhs_id_t *) HW_USBHS_ID_ADDR)
#define HW_USBHS_ID_RD()         (HW_USBHS_ID.U)
#endif
//@}

/*
 * Constants & macros for individual USBHS_ID bitfields
 */

/*!
 * @name Register USBHS_ID, field ID[5:0] (RO)
 *
 * This number is set to 0x05.
 */
//@{
#define BP_USBHS_ID_ID       (0U)          //!< Bit position for USBHS_ID_ID.
#define BM_USBHS_ID_ID       (0x0000003FU) //!< Bit mask for USBHS_ID_ID.
#define BS_USBHS_ID_ID       (6U)          //!< Bit field size in bits for USBHS_ID_ID.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ID_ID field.
#define BR_USBHS_ID_ID       (HW_USBHS_ID.B.ID)
#endif
//@}

/*!
 * @name Register USBHS_ID, field NID[13:8] (RO)
 *
 * Ones complement version of ID.
 */
//@{
#define BP_USBHS_ID_NID      (8U)          //!< Bit position for USBHS_ID_NID.
#define BM_USBHS_ID_NID      (0x00003F00U) //!< Bit mask for USBHS_ID_NID.
#define BS_USBHS_ID_NID      (6U)          //!< Bit field size in bits for USBHS_ID_NID.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ID_NID field.
#define BR_USBHS_ID_NID      (HW_USBHS_ID.B.NID)
#endif
//@}

/*!
 * @name Register USBHS_ID, field TAG[20:16] (RO)
 *
 * Tag of the module.
 */
//@{
#define BP_USBHS_ID_TAG      (16U)         //!< Bit position for USBHS_ID_TAG.
#define BM_USBHS_ID_TAG      (0x001F0000U) //!< Bit mask for USBHS_ID_TAG.
#define BS_USBHS_ID_TAG      (5U)          //!< Bit field size in bits for USBHS_ID_TAG.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ID_TAG field.
#define BR_USBHS_ID_TAG      (HW_USBHS_ID.B.TAG)
#endif
//@}

/*!
 * @name Register USBHS_ID, field REVISION[24:21] (RO)
 *
 * Revision number of the module.
 */
//@{
#define BP_USBHS_ID_REVISION (21U)         //!< Bit position for USBHS_ID_REVISION.
#define BM_USBHS_ID_REVISION (0x01E00000U) //!< Bit mask for USBHS_ID_REVISION.
#define BS_USBHS_ID_REVISION (4U)          //!< Bit field size in bits for USBHS_ID_REVISION.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ID_REVISION field.
#define BR_USBHS_ID_REVISION (HW_USBHS_ID.B.REVISION)
#endif
//@}

/*!
 * @name Register USBHS_ID, field VERSION[28:25] (RO)
 *
 * Version of the module.
 */
//@{
#define BP_USBHS_ID_VERSION  (25U)         //!< Bit position for USBHS_ID_VERSION.
#define BM_USBHS_ID_VERSION  (0x1E000000U) //!< Bit mask for USBHS_ID_VERSION.
#define BS_USBHS_ID_VERSION  (4U)          //!< Bit field size in bits for USBHS_ID_VERSION.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ID_VERSION field.
#define BR_USBHS_ID_VERSION  (HW_USBHS_ID.B.VERSION)
#endif
//@}

/*!
 * @name Register USBHS_ID, field VERSIONID[31:29] (RO)
 *
 * Internal version counter.
 */
//@{
#define BP_USBHS_ID_VERSIONID (29U)        //!< Bit position for USBHS_ID_VERSIONID.
#define BM_USBHS_ID_VERSIONID (0xE0000000U) //!< Bit mask for USBHS_ID_VERSIONID.
#define BS_USBHS_ID_VERSIONID (3U)         //!< Bit field size in bits for USBHS_ID_VERSIONID.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ID_VERSIONID field.
#define BR_USBHS_ID_VERSIONID (HW_USBHS_ID.B.VERSIONID)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HWGENERAL - General Hardware Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HWGENERAL - General Hardware Parameters Register (RO)
 *
 * Reset value: 0x00000085U
 *
 * The HWGENERAL register contains parameters defining the particular
 * implementation of the module.
 */
typedef union _hw_usbhs_hwgeneral
{
    uint32_t U;
    struct _hw_usbhs_hwgeneral_bitfields
    {
        uint32_t RESERVED0 : 6;        //!< [5:0] Reserved
        uint32_t PHYM : 3;             //!< [8:6] PHY Mode
        uint32_t SM : 2;               //!< [10:9] Serial mode
        uint32_t RESERVED1 : 21;       //!< [31:11] Reserved
    } B;
} hw_usbhs_hwgeneral_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HWGENERAL register
 */
//@{
#define HW_USBHS_HWGENERAL_ADDR  (REGS_USBHS_BASE + 0x4U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HWGENERAL       (*(__I hw_usbhs_hwgeneral_t *) HW_USBHS_HWGENERAL_ADDR)
#define HW_USBHS_HWGENERAL_RD()  (HW_USBHS_HWGENERAL.U)
#endif
//@}

