ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_HWGENERAL bitfields
 */

/*!
 * @name Register USBHS_HWGENERAL, field PHYM[8:6] (RO)
 *
 * Indicates USB transceiver interface used. Always reads 010. 010 ULPI only
 */
//@{
#define BP_USBHS_HWGENERAL_PHYM (6U)       //!< Bit position for USBHS_HWGENERAL_PHYM.
#define BM_USBHS_HWGENERAL_PHYM (0x000001C0U) //!< Bit mask for USBHS_HWGENERAL_PHYM.
#define BS_USBHS_HWGENERAL_PHYM (3U)       //!< Bit field size in bits for USBHS_HWGENERAL_PHYM.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWGENERAL_PHYM field.
#define BR_USBHS_HWGENERAL_PHYM (HW_USBHS_HWGENERAL.B.PHYM)
#endif
//@}

/*!
 * @name Register USBHS_HWGENERAL, field SM[10:9] (RO)
 *
 * Indicates presence of serial interface. Always 00. 00 Serial engine not
 * present
 */
//@{
#define BP_USBHS_HWGENERAL_SM (9U)         //!< Bit position for USBHS_HWGENERAL_SM.
#define BM_USBHS_HWGENERAL_SM (0x00000600U) //!< Bit mask for USBHS_HWGENERAL_SM.
#define BS_USBHS_HWGENERAL_SM (2U)         //!< Bit field size in bits for USBHS_HWGENERAL_SM.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWGENERAL_SM field.
#define BR_USBHS_HWGENERAL_SM (HW_USBHS_HWGENERAL.B.SM)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HWHOST - Host Hardware Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HWHOST - Host Hardware Parameters Register (RO)
 *
 * Reset value: 0x10020001U
 *
 * The HWHOST register provides host hardware parameters for this implementation
 * of the module.
 */
typedef union _hw_usbhs_hwhost
{
    uint32_t U;
    struct _hw_usbhs_hwhost_bitfields
    {
        uint32_t HC : 1;               //!< [0] Host Capable
        uint32_t NPORT : 3;            //!< [3:1] Number of Ports
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t TTASY : 8;            //!< [23:16] Transaction translator contexts.
        uint32_t TTPER : 8;            //!< [31:24] Transaction translator periodic
                                       //! contexts.
    } B;
} hw_usbhs_hwhost_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HWHOST register
 */
//@{
#define HW_USBHS_HWHOST_ADDR     (REGS_USBHS_BASE + 0x8U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HWHOST          (*(__I hw_usbhs_hwhost_t *) HW_USBHS_HWHOST_ADDR)
#define HW_USBHS_HWHOST_RD()     (HW_USBHS_HWHOST.U)
#endif
//@}

/*
 * Constants & macros for individual USBHS_HWHOST bitfields
 */

/*!
 * @name Register USBHS_HWHOST, field HC[0] (RO)
 *
 * Always reads as 0b1, indicating the module is host capable.
 */
//@{
#define BP_USBHS_HWHOST_HC   (0U)          //!< Bit position for USBHS_HWHOST_HC.
#define BM_USBHS_HWHOST_HC   (0x00000001U) //!< Bit mask for USBHS_HWHOST_HC.
#define BS_USBHS_HWHOST_HC   (1U)          //!< Bit field size in bits for USBHS_HWHOST_HC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWHOST_HC field.
#define BR_USBHS_HWHOST_HC   (BITBAND_ACCESS32(HW_USBHS_HWHOST_ADDR, BP_USBHS_HWHOST_HC))
#endif
//@}

/*!
 * @name Register USBHS_HWHOST, field NPORT[3:1] (RO)
 *
 * Always 0, indicating the number of ports available (NPORT + 1) for this host
 * implementation.
 */
//@{
#define BP_USBHS_HWHOST_NPORT (1U)         //!< Bit position for USBHS_HWHOST_NPORT.
#define BM_USBHS_HWHOST_NPORT (0x0000000EU) //!< Bit mask for USBHS_HWHOST_NPORT.
#define BS_USBHS_HWHOST_NPORT (3U)         //!< Bit field size in bits for USBHS_HWHOST_NPORT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWHOST_NPORT field.
#define BR_USBHS_HWHOST_NPORT (HW_USBHS_HWHOST.B.NPORT)
#endif
//@}

/*!
 * @name Register USBHS_HWHOST, field TTASY[23:16] (RO)
 *
 * The number of transaction translator contexts. Always reads as 0x02.
 */
//@{
#define BP_USBHS_HWHOST_TTASY (16U)        //!< Bit position for USBHS_HWHOST_TTASY.
#define BM_USBHS_HWHOST_TTASY (0x00FF0000U) //!< Bit mask for USBHS_HWHOST_TTASY.
#define BS_USBHS_HWHOST_TTASY (8U)         //!< Bit field size in bits for USBHS_HWHOST_TTASY.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWHOST_TTASY field.
#define BR_USBHS_HWHOST_TTASY (HW_USBHS_HWHOST.B.TTASY)
#endif
//@}

/*!
 * @name Register USBHS_HWHOST, field TTPER[31:24] (RO)
 *
 * The number of supported transaction translator periodic contexts. Always
 * reads as 0x10 (16 contexts supported).
 */
//@{
#define BP_USBHS_HWHOST_TTPER (24U)        //!< Bit position for USBHS_HWHOST_TTPER.
#define BM_USBHS_HWHOST_TTPER (0xFF000000U) //!< Bit mask for USBHS_HWHOST_TTPER.
#define BS_USBHS_HWHOST_TTPER (8U)         //!< Bit field size in bits for USBHS_HWHOST_TTPER.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWHOST_TTPER field.
#define BR_USBHS_HWHOST_TTPER (HW_USBHS_HWHOST.B.TTPER)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HWDEVICE - Device Hardware Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HWDEVICE - Device Hardware Parameters Register (RO)
 *
 * Reset value: 0x00000009U
 *
 * Provides device hardware parameters for this implementation of the USBHS
 * module.
 */
typedef union _hw_usbhs_hwdevice
{
    uint32_t U;
    struct _hw_usbhs_hwdevice_bitfields
    {
        uint32_t DC : 1;               //!< [0] Device Capable
        uint32_t DEVEP : 5;            //!< [5:1] Device endpoints.
        uint32_t RESERVED0 : 26;       //!< [31:6] Reserved
    } B;
} hw_usbhs_hwdevice_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HWDEVICE register
 */
//@{
#define HW_USBHS_HWDEVICE_ADDR   (REGS_USBHS_BASE + 0xCU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HWDEVICE        (*(__I hw_usbhs_hwdevice_t *) HW_USBHS_HWDEVICE_ADDR)
#define HW_USBHS_HWDEVICE_RD()   (HW_USBHS_HWDEVICE.U)
#endif
//@}

