ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_HWDEVICE bitfields
 */

/*!
 * @name Register USBHS_HWDEVICE, field DC[0] (RO)
 *
 * Always reads as 0b1, indicating the USBHS module is device capable.
 */
//@{
#define BP_USBHS_HWDEVICE_DC (0U)          //!< Bit position for USBHS_HWDEVICE_DC.
#define BM_USBHS_HWDEVICE_DC (0x00000001U) //!< Bit mask for USBHS_HWDEVICE_DC.
#define BS_USBHS_HWDEVICE_DC (1U)          //!< Bit field size in bits for USBHS_HWDEVICE_DC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWDEVICE_DC field.
#define BR_USBHS_HWDEVICE_DC (BITBAND_ACCESS32(HW_USBHS_HWDEVICE_ADDR, BP_USBHS_HWDEVICE_DC))
#endif
//@}

/*!
 * @name Register USBHS_HWDEVICE, field DEVEP[5:1] (RO)
 *
 * The number of supported endpoints. Always reads as 0b00100.
 */
//@{
#define BP_USBHS_HWDEVICE_DEVEP (1U)       //!< Bit position for USBHS_HWDEVICE_DEVEP.
#define BM_USBHS_HWDEVICE_DEVEP (0x0000003EU) //!< Bit mask for USBHS_HWDEVICE_DEVEP.
#define BS_USBHS_HWDEVICE_DEVEP (5U)       //!< Bit field size in bits for USBHS_HWDEVICE_DEVEP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWDEVICE_DEVEP field.
#define BR_USBHS_HWDEVICE_DEVEP (HW_USBHS_HWDEVICE.B.DEVEP)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HWTXBUF - Transmit Buffer Hardware Parameters Register (RO)
 *
 * Reset value: 0x80070908U
 *
 * The HWTXBUF register provides the transmit buffer parameters for this
 * implementation of the module.
 */
typedef union _hw_usbhs_hwtxbuf
{
    uint32_t U;
    struct _hw_usbhs_hwtxbuf_bitfields
    {
        uint32_t TXBURST : 8;          //!< [7:0] Transmit Burst.
        uint32_t TXADD : 8;            //!< [15:8] Transmit Address.
        uint32_t TXCHANADD : 8;        //!< [23:16] Transmit Channel Address
        uint32_t RESERVED0 : 7;        //!< [30:24] Reserved
        uint32_t TXLC : 1;             //!< [31] Transmit local Context Registers
    } B;
} hw_usbhs_hwtxbuf_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HWTXBUF register
 */
//@{
#define HW_USBHS_HWTXBUF_ADDR    (REGS_USBHS_BASE + 0x10U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HWTXBUF         (*(__I hw_usbhs_hwtxbuf_t *) HW_USBHS_HWTXBUF_ADDR)
#define HW_USBHS_HWTXBUF_RD()    (HW_USBHS_HWTXBUF.U)
#endif
//@}

/*
 * Constants & macros for individual USBHS_HWTXBUF bitfields
 */

/*!
 * @name Register USBHS_HWTXBUF, field TXBURST[7:0] (RO)
 *
 * Indicates the number of data beats in a burst for transmit DMA data
 * transfers. Always 0x8.
 */
//@{
#define BP_USBHS_HWTXBUF_TXBURST (0U)      //!< Bit position for USBHS_HWTXBUF_TXBURST.
#define BM_USBHS_HWTXBUF_TXBURST (0x000000FFU) //!< Bit mask for USBHS_HWTXBUF_TXBURST.
#define BS_USBHS_HWTXBUF_TXBURST (8U)      //!< Bit field size in bits for USBHS_HWTXBUF_TXBURST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWTXBUF_TXBURST field.
#define BR_USBHS_HWTXBUF_TXBURST (HW_USBHS_HWTXBUF.B.TXBURST)
#endif
//@}

/*!
 * @name Register USBHS_HWTXBUF, field TXADD[15:8] (RO)
 *
 * The number of address bits for the entire TX buffer. Always 0x9.
 */
//@{
#define BP_USBHS_HWTXBUF_TXADD (8U)        //!< Bit position for USBHS_HWTXBUF_TXADD.
#define BM_USBHS_HWTXBUF_TXADD (0x0000FF00U) //!< Bit mask for USBHS_HWTXBUF_TXADD.
#define BS_USBHS_HWTXBUF_TXADD (8U)        //!< Bit field size in bits for USBHS_HWTXBUF_TXADD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWTXBUF_TXADD field.
#define BR_USBHS_HWTXBUF_TXADD (HW_USBHS_HWTXBUF.B.TXADD)
#endif
//@}

/*!
 * @name Register USBHS_HWTXBUF, field TXCHANADD[23:16] (RO)
 *
 * The number of address bits required to address one channel's worth of TX
 * data. Always 0x7.
 */
//@{
#define BP_USBHS_HWTXBUF_TXCHANADD (16U)   //!< Bit position for USBHS_HWTXBUF_TXCHANADD.
#define BM_USBHS_HWTXBUF_TXCHANADD (0x00FF0000U) //!< Bit mask for USBHS_HWTXBUF_TXCHANADD.
#define BS_USBHS_HWTXBUF_TXCHANADD (8U)    //!< Bit field size in bits for USBHS_HWTXBUF_TXCHANADD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWTXBUF_TXCHANADD field.
#define BR_USBHS_HWTXBUF_TXCHANADD (HW_USBHS_HWTXBUF.B.TXCHANADD)
#endif
//@}

/*!
 * @name Register USBHS_HWTXBUF, field TXLC[31] (RO)
 *
 * Indicates how the device transmit context registers implement. Always set.
 *
 * Values:
 * - 0 - Store device transmit contexts in the TX FIFO
 * - 1 - Store device transmit contexts in a register file
 */
//@{
#define BP_USBHS_HWTXBUF_TXLC (31U)        //!< Bit position for USBHS_HWTXBUF_TXLC.
#define BM_USBHS_HWTXBUF_TXLC (0x80000000U) //!< Bit mask for USBHS_HWTXBUF_TXLC.
#define BS_USBHS_HWTXBUF_TXLC (1U)         //!< Bit field size in bits for USBHS_HWTXBUF_TXLC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWTXBUF_TXLC field.
#define BR_USBHS_HWTXBUF_TXLC (BITBAND_ACCESS32(HW_USBHS_HWTXBUF_ADDR, BP_USBHS_HWTXBUF_TXLC))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HWRXBUF - Receive Buffer Hardware Parameters Register (RO)
 *
 * Reset value: 0x00000808U
 *
 * The HWRXBUF register provide the receive buffer parameters for this
 * implementation of the module.
 */
typedef union _hw_usbhs_hwrxbuf
{
    uint32_t U;
    struct _hw_usbhs_hwrxbuf_bitfields
    {
        uint32_t RXBURST : 8;          //!< [7:0] Receive Burst.
        uint32_t RXADD : 8;            //!< [15:8] Receive Address.
        uint32_t RESERVED0 : 16;       //!< [31:16] Reserved
    } B;
} hw_usbhs_hwrxbuf_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HWRXBUF register
 */
//@{
#define HW_USBHS_HWRXBUF_ADDR    (REGS_USBHS_BASE + 0x14U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HWRXBUF         (*(__I hw_usbhs_hwrxbuf_t *) HW_USBHS_HWRXBUF_ADDR)
#define HW_USBHS_HWRXBUF_RD()    (HW_USBHS_HWRXBUF.U)
#endif
//@}

