ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_HWRXBUF bitfields
 */

/*!
 * @name Register USBHS_HWRXBUF, field RXBURST[7:0] (RO)
 *
 * Indicates the number of data beats in a burst for receive DMA data transfers.
 * Always reads as 0x08.
 */
//@{
#define BP_USBHS_HWRXBUF_RXBURST (0U)      //!< Bit position for USBHS_HWRXBUF_RXBURST.
#define BM_USBHS_HWRXBUF_RXBURST (0x000000FFU) //!< Bit mask for USBHS_HWRXBUF_RXBURST.
#define BS_USBHS_HWRXBUF_RXBURST (8U)      //!< Bit field size in bits for USBHS_HWRXBUF_RXBURST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWRXBUF_RXBURST field.
#define BR_USBHS_HWRXBUF_RXBURST (HW_USBHS_HWRXBUF.B.RXBURST)
#endif
//@}

/*!
 * @name Register USBHS_HWRXBUF, field RXADD[15:8] (RO)
 *
 * The number of address bits for the entire RX buffer. Always reads as 0x08.
 */
//@{
#define BP_USBHS_HWRXBUF_RXADD (8U)        //!< Bit position for USBHS_HWRXBUF_RXADD.
#define BM_USBHS_HWRXBUF_RXADD (0x0000FF00U) //!< Bit mask for USBHS_HWRXBUF_RXADD.
#define BS_USBHS_HWRXBUF_RXADD (8U)        //!< Bit field size in bits for USBHS_HWRXBUF_RXADD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HWRXBUF_RXADD field.
#define BR_USBHS_HWRXBUF_RXADD (HW_USBHS_HWRXBUF.B.RXADD)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_GPTIMER0LD - General Purpose Timer n Load Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_GPTIMER0LD - General Purpose Timer n Load Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnLD register contains the timer duration or load value.
 */
typedef union _hw_usbhs_gptimer0ld
{
    uint32_t U;
    struct _hw_usbhs_gptimer0ld_bitfields
    {
        uint32_t GPTLD : 24;           //!< [23:0]
        uint32_t RESERVED0 : 8;        //!< [31:24] Reserved
    } B;
} hw_usbhs_gptimer0ld_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_GPTIMER0LD register
 */
//@{
#define HW_USBHS_GPTIMER0LD_ADDR (REGS_USBHS_BASE + 0x80U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_GPTIMER0LD      (*(__IO hw_usbhs_gptimer0ld_t *) HW_USBHS_GPTIMER0LD_ADDR)
#define HW_USBHS_GPTIMER0LD_RD() (HW_USBHS_GPTIMER0LD.U)
#define HW_USBHS_GPTIMER0LD_WR(v) (HW_USBHS_GPTIMER0LD.U = (v))
#define HW_USBHS_GPTIMER0LD_SET(v) (HW_USBHS_GPTIMER0LD_WR(HW_USBHS_GPTIMER0LD_RD() |  (v)))
#define HW_USBHS_GPTIMER0LD_CLR(v) (HW_USBHS_GPTIMER0LD_WR(HW_USBHS_GPTIMER0LD_RD() & ~(v)))
#define HW_USBHS_GPTIMER0LD_TOG(v) (HW_USBHS_GPTIMER0LD_WR(HW_USBHS_GPTIMER0LD_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_GPTIMER0LD bitfields
 */

/*!
 * @name Register USBHS_GPTIMER0LD, field GPTLD[23:0] (RW)
 */
//@{
#define BP_USBHS_GPTIMER0LD_GPTLD (0U)     //!< Bit position for USBHS_GPTIMER0LD_GPTLD.
#define BM_USBHS_GPTIMER0LD_GPTLD (0x00FFFFFFU) //!< Bit mask for USBHS_GPTIMER0LD_GPTLD.
#define BS_USBHS_GPTIMER0LD_GPTLD (24U)    //!< Bit field size in bits for USBHS_GPTIMER0LD_GPTLD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_GPTIMER0LD_GPTLD field.
#define BR_USBHS_GPTIMER0LD_GPTLD (HW_USBHS_GPTIMER0LD.B.GPTLD)
#endif

//! @brief Format value for bitfield USBHS_GPTIMER0LD_GPTLD.
#define BF_USBHS_GPTIMER0LD_GPTLD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_GPTIMER0LD_GPTLD), uint32_t) & BM_USBHS_GPTIMER0LD_GPTLD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the GPTLD field to a new value.
#define BW_USBHS_GPTIMER0LD_GPTLD(v) (HW_USBHS_GPTIMER0LD_WR((HW_USBHS_GPTIMER0LD_RD() & ~BM_USBHS_GPTIMER0LD_GPTLD) | BF_USBHS_GPTIMER0LD_GPTLD(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_GPTIMER0CTL - General Purpose Timer n Control Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_GPTIMER0CTL - General Purpose Timer n Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnCTL register controls the various functions of the general
 * purpose timers.
 */
typedef union _hw_usbhs_gptimer0ctl
{
    uint32_t U;
    struct _hw_usbhs_gptimer0ctl_bitfields
    {
        uint32_t GPTCNT : 24;          //!< [23:0] Timer Count
        uint32_t MODE : 1;             //!< [24] Timer Mode
        uint32_t RESERVED0 : 5;        //!< [29:25] Reserved
        uint32_t RST : 1;              //!< [30] Timer Reset
        uint32_t RUN : 1;              //!< [31] Timer Run
    } B;
} hw_usbhs_gptimer0ctl_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_GPTIMER0CTL register
 */
//@{
#define HW_USBHS_GPTIMER0CTL_ADDR (REGS_USBHS_BASE + 0x84U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_GPTIMER0CTL     (*(__IO hw_usbhs_gptimer0ctl_t *) HW_USBHS_GPTIMER0CTL_ADDR)
#define HW_USBHS_GPTIMER0CTL_RD() (HW_USBHS_GPTIMER0CTL.U)
#define HW_USBHS_GPTIMER0CTL_WR(v) (HW_USBHS_GPTIMER0CTL.U = (v))
#define HW_USBHS_GPTIMER0CTL_SET(v) (HW_USBHS_GPTIMER0CTL_WR(HW_USBHS_GPTIMER0CTL_RD() |  (v)))
#define HW_USBHS_GPTIMER0CTL_CLR(v) (HW_USBHS_GPTIMER0CTL_WR(HW_USBHS_GPTIMER0CTL_RD() & ~(v)))
#define HW_USBHS_GPTIMER0CTL_TOG(v) (HW_USBHS_GPTIMER0CTL_WR(HW_USBHS_GPTIMER0CTL_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_GPTIMER0CTL bitfields
 */

/*!
 * @name Register USBHS_GPTIMER0CTL, field GPTCNT[23:0] (RO)
 */
//@{
#define BP_USBHS_GPTIMER0CTL_GPTCNT (0U)   //!< Bit position for USBHS_GPTIMER0CTL_GPTCNT.
#define BM_USBHS_GPTIMER0CTL_GPTCNT (0x00FFFFFFU) //!< Bit mask for USBHS_GPTIMER0CTL_GPTCNT.
#define BS_USBHS_GPTIMER0CTL_GPTCNT (24U)  //!< Bit field size in bits for USBHS_GPTIMER0CTL_GPTCNT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_GPTIMER0CTL_GPTCNT field.
#define BR_USBHS_GPTIMER0CTL_GPTCNT (HW_USBHS_GPTIMER0CTL.B.GPTCNT)
#endif
//@}

/*!
 * @name Register USBHS_GPTIMER0CTL, field MODE[24] (RW)
 *
 * Values:
 * - 0 - One shot
 * - 1 - Repeat
 */
//@{
#define BP_USBHS_GPTIMER0CTL_MODE (24U)    //!< Bit position for USBHS_GPTIMER0CTL_MODE.
#define BM_USBHS_GPTIMER0CTL_MODE (0x01000000U) //!< Bit mask for USBHS_GPTIMER0CTL_MODE.
#define BS_USBHS_GPTIMER0CTL_MODE (1U)     //!< Bit field size in bits for USBHS_GPTIMER0CTL_MODE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_GPTIMER0CTL_MODE field.
#define BR_USBHS_GPTIMER0CTL_MODE (BITBAND_ACCESS32(HW_USBHS_GPTIMER0CTL_ADDR, BP_USBHS_GPTIMER0CTL_MODE))
#endif

//! @brief Format value for bitfield USBHS_GPTIMER0CTL_MODE.
#define BF_USBHS_GPTIMER0CTL_MODE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_GPTIMER0CTL_MODE), uint32_t) & BM_USBHS_GPTIMER0CTL_MODE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the MODE field to a new value.
#define BW_USBHS_GPTIMER0CTL_MODE(v) (BITBAND_ACCESS32(HW_USBHS_GPTIMER0CTL_ADDR, BP_USBHS_GPTIMER0CTL_MODE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_GPTIMER0CTL, field RST[30] (WO)
 *
 * Values:
 * - 0 - No action
 * - 1 - Load counter value
 */
//@{
#define BP_USBHS_GPTIMER0CTL_RST (30U)     //!< Bit position for USBHS_GPTIMER0CTL_RST.
#define BM_USBHS_GPTIMER0CTL_RST (0x40000000U) //!< Bit mask for USBHS_GPTIMER0CTL_RST.
#define BS_USBHS_GPTIMER0CTL_RST (1U)      //!< Bit field size in bits for USBHS_GPTIMER0CTL_RST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_GPTIMER0CTL_RST field.
#define BR_USBHS_GPTIMER0CTL_RST (BITBAND_ACCESS32(HW_USBHS_GPTIMER0CTL_ADDR, BP_USBHS_GPTIMER0CTL_RST))
#endif

//! @brief Format value for bitfield USBHS_GPTIMER0CTL_RST.
#define BF_USBHS_GPTIMER0CTL_RST(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_GPTIMER0CTL_RST), uint32_t) & BM_USBHS_GPTIMER0CTL_RST)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RST field to a new value.
#define BW_USBHS_GPTIMER0CTL_RST(v) (BITBAND_ACCESS32(HW_USBHS_GPTIMER0CTL_ADDR, BP_USBHS_GPTIMER0CTL_RST) = (v))
#endif
//@}

/*!
 * @name Register USBHS_GPTIMER0CTL, field RUN[31] (RW)
 *
 * Values:
 * - 0 - Timer stop
 * - 1 - Timer run
 */
//@{
#define BP_USBHS_GPTIMER0CTL_RUN (31U)     //!< Bit position for USBHS_GPTIMER0CTL_RUN.
#define BM_USBHS_GPTIMER0CTL_RUN (0x80000000U) //!< Bit mask for USBHS_GPTIMER0CTL_RUN.
#define BS_USBHS_GPTIMER0CTL_RUN (1U)      //!< Bit field size in bits for USBHS_GPTIMER0CTL_RUN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_GPTIMER0CTL_RUN field.
#define BR_USBHS_GPTIMER0CTL_RUN (BITBAND_ACCESS32(HW_USBHS_GPTIMER0CTL_ADDR, BP_USBHS_GPTIMER0CTL_RUN))
#endif

//! @brief Format value for bitfield USBHS_GPTIMER0CTL_RUN.
#define BF_USBHS_GPTIMER0CTL_RUN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_GPTIMER0CTL_RUN), uint32_t) & BM_USBHS_GPTIMER0CTL_RUN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RUN field to a new value.
#define BW_USBHS_GPTIMER0CTL_RUN(v) (BITBAND_ACCESS32(HW_USBHS_GPTIMER0CTL_ADDR, BP_USBHS_GPTIMER0CTL_RUN) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_GPTIMER1LD - General Purpose Timer n Load Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_GPTIMER1LD - General Purpose Timer n Load Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The GPTIMERnLD register contains the timer duration or load value.
 */
typedef union _hw_usbhs_gptimer1ld
{
    uint32_t U;
    struct _hw_usbhs_gptimer1ld_bitfields
    {
        uint32_t GPTLD : 24;           //!< [23:0]
        uint32_t RESERVED0 : 8;        //!< [31:24] Reserved
    } B;
} hw_usbhs_gptimer1ld_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_GPTIMER1LD register
 */
//@{
#define HW_USBHS_GPTIMER1LD_ADDR (REGS_USBHS_BASE + 0x88U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_GPTIMER1LD      (*(__IO hw_usbhs_gptimer1ld_t *) HW_USBHS_GPTIMER1LD_ADDR)
#define HW_USBHS_GPTIMER1LD_RD() (HW_USBHS_GPTIMER1LD.U)
#define HW_USBHS_GPTIMER1LD_WR(v) (HW_USBHS_GPTIMER1LD.U = (v))
#define HW_USBHS_GPTIMER1LD_SET(v) (HW_USBHS_GPTIMER1LD_WR(HW_USBHS_GPTIMER1LD_RD() |  (v)))
#define HW_USBHS_GPTIMER1LD_CLR(v) (HW_USBHS_GPTIMER1LD_WR(HW_USBHS_GPTIMER1LD_RD() & ~(v)))
#define HW_USBHS_GPTIMER1LD_TOG(v) (HW_USBHS_GPTIMER1LD_WR(HW_USBHS_GPTIMER1LD_RD() ^  (v)))
#endif
//@}

