ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_GPTIMER1CTL_RUN.
#define BF_USBHS_GPTIMER1CTL_RUN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_GPTIMER1CTL_RUN), uint32_t) & BM_USBHS_GPTIMER1CTL_RUN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RUN field to a new value.
#define BW_USBHS_GPTIMER1CTL_RUN(v) (BITBAND_ACCESS32(HW_USBHS_GPTIMER1CTL_ADDR, BP_USBHS_GPTIMER1CTL_RUN) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_USB_SBUSCFG - System Bus Interface Configuration Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_USB_SBUSCFG - System Bus Interface Configuration Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The System Bus Interface Configuration (USB_SBUSCFG) register contains the
 * control for the system bus interface.
 */
typedef union _hw_usbhs_usb_sbuscfg
{
    uint32_t U;
    struct _hw_usbhs_usb_sbuscfg_bitfields
    {
        uint32_t BURSTMODE : 3;        //!< [2:0] Burst mode
        uint32_t RESERVED0 : 29;       //!< [31:3] Reserved
    } B;
} hw_usbhs_usb_sbuscfg_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_USB_SBUSCFG register
 */
//@{
#define HW_USBHS_USB_SBUSCFG_ADDR (REGS_USBHS_BASE + 0x90U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_USB_SBUSCFG     (*(__IO hw_usbhs_usb_sbuscfg_t *) HW_USBHS_USB_SBUSCFG_ADDR)
#define HW_USBHS_USB_SBUSCFG_RD() (HW_USBHS_USB_SBUSCFG.U)
#define HW_USBHS_USB_SBUSCFG_WR(v) (HW_USBHS_USB_SBUSCFG.U = (v))
#define HW_USBHS_USB_SBUSCFG_SET(v) (HW_USBHS_USB_SBUSCFG_WR(HW_USBHS_USB_SBUSCFG_RD() |  (v)))
#define HW_USBHS_USB_SBUSCFG_CLR(v) (HW_USBHS_USB_SBUSCFG_WR(HW_USBHS_USB_SBUSCFG_RD() & ~(v)))
#define HW_USBHS_USB_SBUSCFG_TOG(v) (HW_USBHS_USB_SBUSCFG_WR(HW_USBHS_USB_SBUSCFG_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_USB_SBUSCFG bitfields
 */

/*!
 * @name Register USBHS_USB_SBUSCFG, field BURSTMODE[2:0] (RW)
 *
 * Selects the options for the burst signal of the Master Interface. In all
 * cases where the unspecified length burst is allowed, single accesses may also
 * occur; this is mostly true when the transaction is not 32-bit aligned. Two
 * consecutive single accesses should not happen. When an INCRx burst size is selected
 * and the transfer is not multiple of the INCRx burst, the burst is decomposed in
 * the different ways. With BURSTMODE[2] = 1, the smaller bursts is unspecified
 * length. with BURSTMODE[2] = 0, the smaller bursts are smaller INCRx or
 * singles. For example, if it were required at a given time to transfer 22 words of
 * information, for the following values of BURSTMODE the master sequences are: 101
 * INCR4 + INCR4 + INCR4 + INCR4 + INCR4 + INCR unspec. length. 110 INCR8 + INCR8
 * + INCR4 + INCR unspec. length. 111 INCR16 + INCR4 + INCR unspec. length. 001
 * INCR4 + INCR4 + INCR4 + INCR4 + INCR4 + SINGLE + SINGLE. 010 INCR8 + INCR8 +
 * INCR4 + SINGLE + SINGLE. 011 INCR16 + INCR4 + SINGLE + SINGLE. When this field
 * is different from zero, the values in the TXBURST/RXBURST bitfields in the
 * USB_BURSTSIZE register are ignored by the controller. Internally the BURSTMODE is
 * set to the value of the INCRx burst. Since this has a direct relation with
 * the burst sizes you must be careful with AHB burst selected. Although the
 * TXBURST/RXBURST are bypassed, this register can be written/read with no effect while
 * the BURSTMODE field is non-zero. Setting the BURSTMODE value to 000 might
 * cause bus allocation during BULK or ISO transfers. Changing this BURSTMODE field
 * while a transaction is in progress yields undefined results. One possible way
 * to prevent undefined results is to clear the Run/Stop (RS) bit in the
 * USB_USBCMD register, after the HCHALTED is detected in USB_USBSTS.
 *
 * Values:
 * - 000 - INCR burst of unspecified length
 * - 001 - INCR4, non-multiple transfers of INCR4 is decomposed into singles.
 * - 010 - INCR8, non-multiple transfers of INCR8, is decomposed into INCR4 or
 *     singles.
 * - 011 - INCR16, non-multiple transfers of INCR16, is decomposed into INCR8,
 *     INCR4 or singles.
 * - 100 - Reserved, do not use.
 * - 101 - INCR4, non-multiple transfers of INCR4 is decomposed into smaller
 *     unspecified length bursts.
 * - 110 - INCR8, non-multiple transfers of INCR8 is decomposed into smaller
 *     unspecified length bursts.
 * - 111 - INCR16, non-multiple transfers of INCR16 is decomposed into smaller
 *     unspecified length bursts.
 */
//@{
#define BP_USBHS_USB_SBUSCFG_BURSTMODE (0U) //!< Bit position for USBHS_USB_SBUSCFG_BURSTMODE.
#define BM_USBHS_USB_SBUSCFG_BURSTMODE (0x00000007U) //!< Bit mask for USBHS_USB_SBUSCFG_BURSTMODE.
#define BS_USBHS_USB_SBUSCFG_BURSTMODE (3U) //!< Bit field size in bits for USBHS_USB_SBUSCFG_BURSTMODE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USB_SBUSCFG_BURSTMODE field.
#define BR_USBHS_USB_SBUSCFG_BURSTMODE (HW_USBHS_USB_SBUSCFG.B.BURSTMODE)
#endif

//! @brief Format value for bitfield USBHS_USB_SBUSCFG_BURSTMODE.
#define BF_USBHS_USB_SBUSCFG_BURSTMODE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USB_SBUSCFG_BURSTMODE), uint32_t) & BM_USBHS_USB_SBUSCFG_BURSTMODE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the BURSTMODE field to a new value.
#define BW_USBHS_USB_SBUSCFG_BURSTMODE(v) (HW_USBHS_USB_SBUSCFG_WR((HW_USBHS_USB_SBUSCFG_RD() & ~BM_USBHS_USB_SBUSCFG_BURSTMODE) | BF_USBHS_USB_SBUSCFG_BURSTMODE(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HCIVERSION - Host Controller Interface Version and Capability Registers Length Register (RO)
 *
 * Reset value: 0x01000040U
 *
 * Contains the CAPLENGTH field used as an offset to add to the register base
 * address to find the beginning of the operational register space, the location of
 * the USBCMD register. Also contains a BCD encoding of the EHCI revision number
 * supported by this OTG controller. The most-significant byte of the HCIVERSION
 * field represents a major revision; the least-significant byte is the minor
 * revision.
 */
typedef union _hw_usbhs_hciversion
{
    uint32_t U;
    struct _hw_usbhs_hciversion_bitfields
    {
        uint32_t CAPLENGTH : 8;        //!< [7:0] Capability registers length
        uint32_t RESERVED0 : 8;        //!< [15:8] Reserved
        uint32_t HCIVERSION : 16;      //!< [31:16] EHCI revision number
    } B;
} hw_usbhs_hciversion_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HCIVERSION register
 */
//@{
#define HW_USBHS_HCIVERSION_ADDR (REGS_USBHS_BASE + 0x100U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HCIVERSION      (*(__I hw_usbhs_hciversion_t *) HW_USBHS_HCIVERSION_ADDR)
#define HW_USBHS_HCIVERSION_RD() (HW_USBHS_HCIVERSION.U)
#endif
//@}

