ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_HCIVERSION bitfields
 */

/*!
 * @name Register USBHS_HCIVERSION, field CAPLENGTH[7:0] (RO)
 *
 * Always reads as 0x40.
 */
//@{
#define BP_USBHS_HCIVERSION_CAPLENGTH (0U) //!< Bit position for USBHS_HCIVERSION_CAPLENGTH.
#define BM_USBHS_HCIVERSION_CAPLENGTH (0x000000FFU) //!< Bit mask for USBHS_HCIVERSION_CAPLENGTH.
#define BS_USBHS_HCIVERSION_CAPLENGTH (8U) //!< Bit field size in bits for USBHS_HCIVERSION_CAPLENGTH.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCIVERSION_CAPLENGTH field.
#define BR_USBHS_HCIVERSION_CAPLENGTH (HW_USBHS_HCIVERSION.B.CAPLENGTH)
#endif
//@}

/*!
 * @name Register USBHS_HCIVERSION, field HCIVERSION[31:16] (RO)
 *
 * Value is reads as 0x0100, indicating version 1.0.
 */
//@{
#define BP_USBHS_HCIVERSION_HCIVERSION (16U) //!< Bit position for USBHS_HCIVERSION_HCIVERSION.
#define BM_USBHS_HCIVERSION_HCIVERSION (0xFFFF0000U) //!< Bit mask for USBHS_HCIVERSION_HCIVERSION.
#define BS_USBHS_HCIVERSION_HCIVERSION (16U) //!< Bit field size in bits for USBHS_HCIVERSION_HCIVERSION.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCIVERSION_HCIVERSION field.
#define BR_USBHS_HCIVERSION_HCIVERSION (HW_USBHS_HCIVERSION.B.HCIVERSION)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HCSPARAMS - Host Controller Structural Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HCSPARAMS - Host Controller Structural Parameters Register (RO)
 *
 * Reset value: 0x00010011U
 *
 * This register contains structural parameters such as the number of downstream
 * ports.
 */
typedef union _hw_usbhs_hcsparams
{
    uint32_t U;
    struct _hw_usbhs_hcsparams_bitfields
    {
        uint32_t N_PORTS : 4;          //!< [3:0] Number of Ports
        uint32_t PPC : 1;              //!< [4] Power Port Control
        uint32_t RESERVED0 : 3;        //!< [7:5] Reserved
        uint32_t N_PCC : 4;            //!< [11:8] Number Ports per CC
        uint32_t N_CC : 4;             //!< [15:12] Number of Companion Controllers
        uint32_t PI : 1;               //!< [16] Port Indicators
        uint32_t RESERVED1 : 3;        //!< [19:17] Reserved
        uint32_t N_PTT : 4;            //!< [23:20] Ports per Transaction Translator
        uint32_t N_TT : 4;             //!< [27:24] Number of Transaction Translators.
        uint32_t RESERVED2 : 4;        //!< [31:28] Reserved
    } B;
} hw_usbhs_hcsparams_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HCSPARAMS register
 */
//@{
#define HW_USBHS_HCSPARAMS_ADDR  (REGS_USBHS_BASE + 0x104U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HCSPARAMS       (*(__I hw_usbhs_hcsparams_t *) HW_USBHS_HCSPARAMS_ADDR)
#define HW_USBHS_HCSPARAMS_RD()  (HW_USBHS_HCSPARAMS.U)
#endif
//@}

/*
 * Constants & macros for individual USBHS_HCSPARAMS bitfields
 */

/*!
 * @name Register USBHS_HCSPARAMS, field N_PORTS[3:0] (RO)
 *
 * Indicates number of physical downstream ports implemented for host
 * applications. Field value determines how many addressable port registers in the
 * operational register. Always reads as 0x1.
 */
//@{
#define BP_USBHS_HCSPARAMS_N_PORTS (0U)    //!< Bit position for USBHS_HCSPARAMS_N_PORTS.
#define BM_USBHS_HCSPARAMS_N_PORTS (0x0000000FU) //!< Bit mask for USBHS_HCSPARAMS_N_PORTS.
#define BS_USBHS_HCSPARAMS_N_PORTS (4U)    //!< Bit field size in bits for USBHS_HCSPARAMS_N_PORTS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_N_PORTS field.
#define BR_USBHS_HCSPARAMS_N_PORTS (HW_USBHS_HCSPARAMS.B.N_PORTS)
#endif
//@}

/*!
 * @name Register USBHS_HCSPARAMS, field PPC[4] (RO)
 *
 * Indicates whether host controller supports port power control. Always reads
 * as 0b1.
 *
 * Values:
 * - 1 - Ports have power port switches
 */
//@{
#define BP_USBHS_HCSPARAMS_PPC (4U)        //!< Bit position for USBHS_HCSPARAMS_PPC.
#define BM_USBHS_HCSPARAMS_PPC (0x00000010U) //!< Bit mask for USBHS_HCSPARAMS_PPC.
#define BS_USBHS_HCSPARAMS_PPC (1U)        //!< Bit field size in bits for USBHS_HCSPARAMS_PPC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_PPC field.
#define BR_USBHS_HCSPARAMS_PPC (BITBAND_ACCESS32(HW_USBHS_HCSPARAMS_ADDR, BP_USBHS_HCSPARAMS_PPC))
#endif
//@}

/*!
 * @name Register USBHS_HCSPARAMS, field N_PCC[11:8] (RO)
 *
 * Indicates number of ports supported per internal companion controller. This
 * field reads as 0x0 because no companion controllers are present.
 */
//@{
#define BP_USBHS_HCSPARAMS_N_PCC (8U)      //!< Bit position for USBHS_HCSPARAMS_N_PCC.
#define BM_USBHS_HCSPARAMS_N_PCC (0x00000F00U) //!< Bit mask for USBHS_HCSPARAMS_N_PCC.
#define BS_USBHS_HCSPARAMS_N_PCC (4U)      //!< Bit field size in bits for USBHS_HCSPARAMS_N_PCC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_N_PCC field.
#define BR_USBHS_HCSPARAMS_N_PCC (HW_USBHS_HCSPARAMS.B.N_PCC)
#endif
//@}

/*!
 * @name Register USBHS_HCSPARAMS, field N_CC[15:12] (RO)
 *
 * Indicates number of companion controllers associated with USBHS controller.
 * Always cleared.
 */
//@{
#define BP_USBHS_HCSPARAMS_N_CC (12U)      //!< Bit position for USBHS_HCSPARAMS_N_CC.
#define BM_USBHS_HCSPARAMS_N_CC (0x0000F000U) //!< Bit mask for USBHS_HCSPARAMS_N_CC.
#define BS_USBHS_HCSPARAMS_N_CC (4U)       //!< Bit field size in bits for USBHS_HCSPARAMS_N_CC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_N_CC field.
#define BR_USBHS_HCSPARAMS_N_CC (HW_USBHS_HCSPARAMS.B.N_CC)
#endif
//@}

/*!
 * @name Register USBHS_HCSPARAMS, field PI[16] (RO)
 *
 * Indicates whether the ports support port indicator control. Always set.
 *
 * Values:
 * - 0 - No port indicator fields
 * - 1 - The port status and control registers include a R/W field for
 *     controlling the state of the port indicator
 */
//@{
#define BP_USBHS_HCSPARAMS_PI (16U)        //!< Bit position for USBHS_HCSPARAMS_PI.
#define BM_USBHS_HCSPARAMS_PI (0x00010000U) //!< Bit mask for USBHS_HCSPARAMS_PI.
#define BS_USBHS_HCSPARAMS_PI (1U)         //!< Bit field size in bits for USBHS_HCSPARAMS_PI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_PI field.
#define BR_USBHS_HCSPARAMS_PI (BITBAND_ACCESS32(HW_USBHS_HCSPARAMS_ADDR, BP_USBHS_HCSPARAMS_PI))
#endif
//@}

/*!
 * @name Register USBHS_HCSPARAMS, field N_PTT[23:20] (RO)
 *
 * Non-EHCI field. Indicates number of ports assigned to each transaction
 * translator within host controller.
 */
//@{
#define BP_USBHS_HCSPARAMS_N_PTT (20U)     //!< Bit position for USBHS_HCSPARAMS_N_PTT.
#define BM_USBHS_HCSPARAMS_N_PTT (0x00F00000U) //!< Bit mask for USBHS_HCSPARAMS_N_PTT.
#define BS_USBHS_HCSPARAMS_N_PTT (4U)      //!< Bit field size in bits for USBHS_HCSPARAMS_N_PTT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_N_PTT field.
#define BR_USBHS_HCSPARAMS_N_PTT (HW_USBHS_HCSPARAMS.B.N_PTT)
#endif
//@}

/*!
 * @name Register USBHS_HCSPARAMS, field N_TT[27:24] (RO)
 *
 * Non-EHCI field. Indicates number of embedded transaction translators
 * associated with host controller. This field always reads as 0x0. See section "Embedded
 * Transaction Translator Function," for more information on embedded
 * transaction translators.
 */
//@{
#define BP_USBHS_HCSPARAMS_N_TT (24U)      //!< Bit position for USBHS_HCSPARAMS_N_TT.
#define BM_USBHS_HCSPARAMS_N_TT (0x0F000000U) //!< Bit mask for USBHS_HCSPARAMS_N_TT.
#define BS_USBHS_HCSPARAMS_N_TT (4U)       //!< Bit field size in bits for USBHS_HCSPARAMS_N_TT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCSPARAMS_N_TT field.
#define BR_USBHS_HCSPARAMS_N_TT (HW_USBHS_HCSPARAMS.B.N_TT)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_HCCPARAMS - Host Controller Capability Parameters Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_HCCPARAMS - Host Controller Capability Parameters Register (RO)
 *
 * Reset value: 0x00000006U
 *
 * Identifies multiple mode control (time-base bit functionality) addressing
 * capability.
 */
typedef union _hw_usbhs_hccparams
{
    uint32_t U;
    struct _hw_usbhs_hccparams_bitfields
    {
        uint32_t ADC : 1;              //!< [0] 64-bit addressing capability.
        uint32_t PFL : 1;              //!< [1] Programmable Frame List flag
        uint32_t ASP : 1;              //!< [2] Asynchronous Schedule Park capability
        uint32_t RESERVED0 : 1;        //!< [3] Reserved
        uint32_t IST : 4;              //!< [7:4] Isochronous Scheduling Threshold
        uint32_t EECP : 8;             //!< [15:8] EHCI Extended Capabilities Pointer
        uint32_t RESERVED1 : 16;       //!< [31:16] Reserved
    } B;
} hw_usbhs_hccparams_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_HCCPARAMS register
 */
//@{
#define HW_USBHS_HCCPARAMS_ADDR  (REGS_USBHS_BASE + 0x108U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_HCCPARAMS       (*(__I hw_usbhs_hccparams_t *) HW_USBHS_HCCPARAMS_ADDR)
#define HW_USBHS_HCCPARAMS_RD()  (HW_USBHS_HCCPARAMS.U)
#endif
//@}

