ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_HCCPARAMS bitfields
 */

/*!
 * @name Register USBHS_HCCPARAMS, field ADC[0] (RO)
 *
 * This bit always reads as 0b0, indicating 64-bit addressing is not supported.
 * 0 Data structures use 32-bit address memory pointers
 */
//@{
#define BP_USBHS_HCCPARAMS_ADC (0U)        //!< Bit position for USBHS_HCCPARAMS_ADC.
#define BM_USBHS_HCCPARAMS_ADC (0x00000001U) //!< Bit mask for USBHS_HCCPARAMS_ADC.
#define BS_USBHS_HCCPARAMS_ADC (1U)        //!< Bit field size in bits for USBHS_HCCPARAMS_ADC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCCPARAMS_ADC field.
#define BR_USBHS_HCCPARAMS_ADC (BITBAND_ACCESS32(HW_USBHS_HCCPARAMS_ADDR, BP_USBHS_HCCPARAMS_ADC))
#endif
//@}

/*!
 * @name Register USBHS_HCCPARAMS, field PFL[1] (RO)
 *
 * Indicates that system software can specify and use a frame list length less
 * that 1024 elements. This bit always reads as 0b1. 1 Frame list size is
 * configured via the USBCMD register frame list size field. The frame list must always
 * be aligned on a 4K-page boundary. This requirement ensures that the frame list
 * is always physically contiguous.
 */
//@{
#define BP_USBHS_HCCPARAMS_PFL (1U)        //!< Bit position for USBHS_HCCPARAMS_PFL.
#define BM_USBHS_HCCPARAMS_PFL (0x00000002U) //!< Bit mask for USBHS_HCCPARAMS_PFL.
#define BS_USBHS_HCCPARAMS_PFL (1U)        //!< Bit field size in bits for USBHS_HCCPARAMS_PFL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCCPARAMS_PFL field.
#define BR_USBHS_HCCPARAMS_PFL (BITBAND_ACCESS32(HW_USBHS_HCCPARAMS_ADDR, BP_USBHS_HCCPARAMS_PFL))
#endif
//@}

/*!
 * @name Register USBHS_HCCPARAMS, field ASP[2] (RO)
 *
 * Indicates if the host controller supports the park feature for high-speed
 * queue heads in the asynchronous schedule. The feature can be disabled or enabled
 * and set to a specific level by using the asynchronous schedule park mode
 * enable and asynchronous schedule park mode count fields in the USBCMD register.
 * This bit always reads as 0b1.
 *
 * Values:
 * - 0 - Park not supported.
 * - 1 - Park supported.
 */
//@{
#define BP_USBHS_HCCPARAMS_ASP (2U)        //!< Bit position for USBHS_HCCPARAMS_ASP.
#define BM_USBHS_HCCPARAMS_ASP (0x00000004U) //!< Bit mask for USBHS_HCCPARAMS_ASP.
#define BS_USBHS_HCCPARAMS_ASP (1U)        //!< Bit field size in bits for USBHS_HCCPARAMS_ASP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCCPARAMS_ASP field.
#define BR_USBHS_HCCPARAMS_ASP (BITBAND_ACCESS32(HW_USBHS_HCCPARAMS_ADDR, BP_USBHS_HCCPARAMS_ASP))
#endif
//@}

/*!
 * @name Register USBHS_HCCPARAMS, field IST[7:4] (RO)
 *
 * Indicates where software can reliably update the isochronous schedule,
 * relative to the current position of the executing host controller. This field always
 * reads as 0x0.
 *
 * Values:
 * - 0 - The value of the least significant 3 bits indicates the number of
 *     microframes a host controller can hold a set of isochronous data structures
 *     (one or more) before flushing the state
 */
//@{
#define BP_USBHS_HCCPARAMS_IST (4U)        //!< Bit position for USBHS_HCCPARAMS_IST.
#define BM_USBHS_HCCPARAMS_IST (0x000000F0U) //!< Bit mask for USBHS_HCCPARAMS_IST.
#define BS_USBHS_HCCPARAMS_IST (4U)        //!< Bit field size in bits for USBHS_HCCPARAMS_IST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCCPARAMS_IST field.
#define BR_USBHS_HCCPARAMS_IST (HW_USBHS_HCCPARAMS.B.IST)
#endif
//@}

/*!
 * @name Register USBHS_HCCPARAMS, field EECP[15:8] (RO)
 *
 * This optional field indicates the existence of a capabilities list. This
 * field always reads as 0x000.
 *
 * Values:
 * - 0 - No extended capabilities are implemented
 */
//@{
#define BP_USBHS_HCCPARAMS_EECP (8U)       //!< Bit position for USBHS_HCCPARAMS_EECP.
#define BM_USBHS_HCCPARAMS_EECP (0x0000FF00U) //!< Bit mask for USBHS_HCCPARAMS_EECP.
#define BS_USBHS_HCCPARAMS_EECP (8U)       //!< Bit field size in bits for USBHS_HCCPARAMS_EECP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_HCCPARAMS_EECP field.
#define BR_USBHS_HCCPARAMS_EECP (HW_USBHS_HCCPARAMS.B.EECP)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_DCIVERSION - Device Controller Interface Version
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_DCIVERSION - Device Controller Interface Version (RO)
 *
 * Reset value: 0x0001U
 *
 * Not defined in the EHCI specification. DCIVERSION is a two-byte register
 * containing a BCD encoding of the device controller interface. The most-significant
 * byte of the register represents a major revision and the least-significant
 * byte is the minor revision.
 */
typedef union _hw_usbhs_dciversion
{
    uint16_t U;
    struct _hw_usbhs_dciversion_bitfields
    {
        uint16_t DCIVERSION : 16;      //!< [15:0]
    } B;
} hw_usbhs_dciversion_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_DCIVERSION register
 */
//@{
#define HW_USBHS_DCIVERSION_ADDR (REGS_USBHS_BASE + 0x122U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_DCIVERSION      (*(__I hw_usbhs_dciversion_t *) HW_USBHS_DCIVERSION_ADDR)
#define HW_USBHS_DCIVERSION_RD() (HW_USBHS_DCIVERSION.U)
#endif
//@}

/*
 * Constants & macros for individual USBHS_DCIVERSION bitfields
 */

/*!
 * @name Register USBHS_DCIVERSION, field DCIVERSION[15:0] (RO)
 *
 * Device interface revision number.
 */
//@{
#define BP_USBHS_DCIVERSION_DCIVERSION (0U) //!< Bit position for USBHS_DCIVERSION_DCIVERSION.
#define BM_USBHS_DCIVERSION_DCIVERSION (0xFFFFU) //!< Bit mask for USBHS_DCIVERSION_DCIVERSION.
#define BS_USBHS_DCIVERSION_DCIVERSION (16U) //!< Bit field size in bits for USBHS_DCIVERSION_DCIVERSION.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_DCIVERSION_DCIVERSION field.
#define BR_USBHS_DCIVERSION_DCIVERSION (HW_USBHS_DCIVERSION.B.DCIVERSION)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_DCCPARAMS - Device Controller Capability Parameters
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_DCCPARAMS - Device Controller Capability Parameters (RO)
 *
 * Reset value: 0x00000184U
 *
 * Not defined in the EHCI specification. Register describes the overall
 * host/device capability of the USBHS module.
 */
typedef union _hw_usbhs_dccparams
{
    uint32_t U;
    struct _hw_usbhs_dccparams_bitfields
    {
        uint32_t DEN : 5;              //!< [4:0] Device Endpoint Number
        uint32_t RESERVED0 : 2;        //!< [6:5] Reserved
        uint32_t DC : 1;               //!< [7] Device Capable
        uint32_t HC : 1;               //!< [8] Host Capable
        uint32_t RESERVED1 : 23;       //!< [31:9] Reserved
    } B;
} hw_usbhs_dccparams_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_DCCPARAMS register
 */
//@{
#define HW_USBHS_DCCPARAMS_ADDR  (REGS_USBHS_BASE + 0x124U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_DCCPARAMS       (*(__I hw_usbhs_dccparams_t *) HW_USBHS_DCCPARAMS_ADDR)
#define HW_USBHS_DCCPARAMS_RD()  (HW_USBHS_DCCPARAMS.U)
#endif
//@}

