ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_DCCPARAMS bitfields
 */

/*!
 * @name Register USBHS_DCCPARAMS, field DEN[4:0] (RO)
 *
 * This field indicates the number of endpoints built into the device
 * controller. Always reads as 0b0100.
 */
//@{
#define BP_USBHS_DCCPARAMS_DEN (0U)        //!< Bit position for USBHS_DCCPARAMS_DEN.
#define BM_USBHS_DCCPARAMS_DEN (0x0000001FU) //!< Bit mask for USBHS_DCCPARAMS_DEN.
#define BS_USBHS_DCCPARAMS_DEN (5U)        //!< Bit field size in bits for USBHS_DCCPARAMS_DEN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_DCCPARAMS_DEN field.
#define BR_USBHS_DCCPARAMS_DEN (HW_USBHS_DCCPARAMS.B.DEN)
#endif
//@}

/*!
 * @name Register USBHS_DCCPARAMS, field DC[7] (RO)
 *
 * Indicates the USBHS controller can operate as an USB 2.0 device. Always set.
 */
//@{
#define BP_USBHS_DCCPARAMS_DC (7U)         //!< Bit position for USBHS_DCCPARAMS_DC.
#define BM_USBHS_DCCPARAMS_DC (0x00000080U) //!< Bit mask for USBHS_DCCPARAMS_DC.
#define BS_USBHS_DCCPARAMS_DC (1U)         //!< Bit field size in bits for USBHS_DCCPARAMS_DC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_DCCPARAMS_DC field.
#define BR_USBHS_DCCPARAMS_DC (BITBAND_ACCESS32(HW_USBHS_DCCPARAMS_ADDR, BP_USBHS_DCCPARAMS_DC))
#endif
//@}

/*!
 * @name Register USBHS_DCCPARAMS, field HC[8] (RO)
 *
 * Indicates the USBHS controller can operate as an EHCI compatible USB 2.0
 * host. Always reads as 0b1.
 */
//@{
#define BP_USBHS_DCCPARAMS_HC (8U)         //!< Bit position for USBHS_DCCPARAMS_HC.
#define BM_USBHS_DCCPARAMS_HC (0x00000100U) //!< Bit mask for USBHS_DCCPARAMS_HC.
#define BS_USBHS_DCCPARAMS_HC (1U)         //!< Bit field size in bits for USBHS_DCCPARAMS_HC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_DCCPARAMS_HC field.
#define BR_USBHS_DCCPARAMS_HC (BITBAND_ACCESS32(HW_USBHS_DCCPARAMS_ADDR, BP_USBHS_DCCPARAMS_HC))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_USBCMD - USB Command Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_USBCMD - USB Command Register (RW)
 *
 * Reset value: 0x00080000U
 *
 * The module executes the command indicated in this register.
 */
typedef union _hw_usbhs_usbcmd
{
    uint32_t U;
    struct _hw_usbhs_usbcmd_bitfields
    {
        uint32_t RS : 1;               //!< [0] Run/Stop
        uint32_t RST : 1;              //!< [1] Controller Reset
        uint32_t FS : 2;               //!< [3:2] Frame list Size
        uint32_t PSE : 1;              //!< [4] Periodic Schedule Enable
        uint32_t ASE : 1;              //!< [5] Asynchronous Schedule Enable
        uint32_t IAA : 1;              //!< [6] Interrupt on Async Advance doorbell
        uint32_t RESERVED0 : 1;        //!< [7] Reserved
        uint32_t ASP : 2;              //!< [9:8] Asynchronous Schedule Park mode count
        uint32_t RESERVED1 : 1;        //!< [10] Reserved
        uint32_t ASPE : 1;             //!< [11] Asynchronous Schedule Park mode Enable
        uint32_t RESERVED2 : 1;        //!< [12] Reserved
        uint32_t SUTW : 1;             //!< [13] Setup TripWire
        uint32_t ATDTW : 1;            //!< [14] Add dTD TripWire
        uint32_t FS2 : 1;              //!< [15] Frame list Size 2
        uint32_t ITC : 8;              //!< [23:16] Interrupt Threshold Control
        uint32_t RESERVED3 : 8;        //!< [31:24] Reserved
    } B;
} hw_usbhs_usbcmd_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_USBCMD register
 */
//@{
#define HW_USBHS_USBCMD_ADDR     (REGS_USBHS_BASE + 0x140U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_USBCMD          (*(__IO hw_usbhs_usbcmd_t *) HW_USBHS_USBCMD_ADDR)
#define HW_USBHS_USBCMD_RD()     (HW_USBHS_USBCMD.U)
#define HW_USBHS_USBCMD_WR(v)    (HW_USBHS_USBCMD.U = (v))
#define HW_USBHS_USBCMD_SET(v)   (HW_USBHS_USBCMD_WR(HW_USBHS_USBCMD_RD() |  (v)))
#define HW_USBHS_USBCMD_CLR(v)   (HW_USBHS_USBCMD_WR(HW_USBHS_USBCMD_RD() & ~(v)))
#define HW_USBHS_USBCMD_TOG(v)   (HW_USBHS_USBCMD_WR(HW_USBHS_USBCMD_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_USBCMD bitfields
 */

/*!
 * @name Register USBHS_USBCMD, field RS[0] (RW)
 *
 * Host mode: When set, the controller proceeds with the execution of the
 * schedule. The controller continues execution as long as this bit is set. When this
 * bit is cleared, the controller completes the current transaction on the USB and
 * then halts. The USBSTS[HCH] bit indicates when the host controller finishes
 * the transaction and enters the stopped state. Software must not set this bit
 * unless controller is in halted state (USBSTS[HCH] = 1). Device mode: Setting
 * this bit causes the controller to enable a pull-up on DP and initiate an attach
 * event. This control bit is not directly connected to the pull-up enable, as the
 * pull-up becomes disabled upon transitioning into high-speed mode. Software
 * must use this bit to prevent an attach event before the USBHS controller has
 * properly initialized. Clearing this bit causes a detach event.
 */
//@{
#define BP_USBHS_USBCMD_RS   (0U)          //!< Bit position for USBHS_USBCMD_RS.
#define BM_USBHS_USBCMD_RS   (0x00000001U) //!< Bit mask for USBHS_USBCMD_RS.
#define BS_USBHS_USBCMD_RS   (1U)          //!< Bit field size in bits for USBHS_USBCMD_RS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_RS field.
#define BR_USBHS_USBCMD_RS   (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_RS))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_RS.
#define BF_USBHS_USBCMD_RS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_RS), uint32_t) & BM_USBHS_USBCMD_RS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RS field to a new value.
#define BW_USBHS_USBCMD_RS(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_RS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field RST[1] (RW)
 *
 * Software uses this bit to reset controller. Controller clears this bit when
 * reset process completes. Clearing this register does not allow software to
 * terminate the reset process early. Host mode: When software sets this bit, the
 * controller resets its internal pipelines, timers, counters, state machines etc.
 * to their initial value. Any transaction in progress on the USB immediately
 * terminates. A USB reset is not driven on downstream ports. Software must not set
 * this bit when the USBSTS[HCH] bit is cleared. Attempting to reset an actively
 * running host controller results in undefined behavior. Device mode: When
 * software sets this bit, the controller resets its internal pipelines, timers,
 * counters, state machines, etc. to their initial value. Setting this bit with the
 * device in the attached state is not recommended because it has an undefined
 * effect on an attached host. To ensure the device is not in an attached state before
 * initiating a device controller reset, all primed endpoints must be flushed
 * and the USBCMD[RS] bit must be cleared.
 */
//@{
#define BP_USBHS_USBCMD_RST  (1U)          //!< Bit position for USBHS_USBCMD_RST.
#define BM_USBHS_USBCMD_RST  (0x00000002U) //!< Bit mask for USBHS_USBCMD_RST.
#define BS_USBHS_USBCMD_RST  (1U)          //!< Bit field size in bits for USBHS_USBCMD_RST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_RST field.
#define BR_USBHS_USBCMD_RST  (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_RST))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_RST.
#define BF_USBHS_USBCMD_RST(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_RST), uint32_t) & BM_USBHS_USBCMD_RST)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RST field to a new value.
#define BW_USBHS_USBCMD_RST(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_RST) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field FS[3:2] (RW)
 *
 * With bit 15, these bits make the FS[2:0] field, which specifies the frame
 * list size controlling which bits in the frame index register must be used for the
 * frame list current index. Used only in host mode. Values below 256 elements
 * are not defined in the EHCI specification.
 *
 * Values:
 * - 00 - When FS2 = 0, the size is 1024 elements (4096 bytes). When FS2 = 1,
 *     the size is 64 elements (256 bytes).
 * - 01 - When FS2 = 0, the size is 512 elements (2048 bytes). When FS2 = 1, the
 *     size is 32 elements (128 bytes).
 * - 10 - When FS2 = 0, the size is 256 elements (1024 bytes). When FS2 = 1, the
 *     size is 16 elements (64 bytes).
 * - 11 - When FS2 = 0, the size is 128 elements (512 bytes). When FS2 = 1, the
 *     size is 8 elements (32 bytes).
 */
//@{
#define BP_USBHS_USBCMD_FS   (2U)          //!< Bit position for USBHS_USBCMD_FS.
#define BM_USBHS_USBCMD_FS   (0x0000000CU) //!< Bit mask for USBHS_USBCMD_FS.
#define BS_USBHS_USBCMD_FS   (2U)          //!< Bit field size in bits for USBHS_USBCMD_FS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_FS field.
#define BR_USBHS_USBCMD_FS   (HW_USBHS_USBCMD.B.FS)
#endif

