ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_USBCMD_FS.
#define BF_USBHS_USBCMD_FS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_FS), uint32_t) & BM_USBHS_USBCMD_FS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FS field to a new value.
#define BW_USBHS_USBCMD_FS(v) (HW_USBHS_USBCMD_WR((HW_USBHS_USBCMD_RD() & ~BM_USBHS_USBCMD_FS) | BF_USBHS_USBCMD_FS(v)))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field PSE[4] (RW)
 *
 * Controls whether the controller skips processing periodic schedule. Used only
 * in host mode.
 *
 * Values:
 * - 0 - Do not process periodic schedule.
 * - 1 - Use the PERIODICLISTBASE register to access the periodic schedule.
 */
//@{
#define BP_USBHS_USBCMD_PSE  (4U)          //!< Bit position for USBHS_USBCMD_PSE.
#define BM_USBHS_USBCMD_PSE  (0x00000010U) //!< Bit mask for USBHS_USBCMD_PSE.
#define BS_USBHS_USBCMD_PSE  (1U)          //!< Bit field size in bits for USBHS_USBCMD_PSE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_PSE field.
#define BR_USBHS_USBCMD_PSE  (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_PSE))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_PSE.
#define BF_USBHS_USBCMD_PSE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_PSE), uint32_t) & BM_USBHS_USBCMD_PSE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PSE field to a new value.
#define BW_USBHS_USBCMD_PSE(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_PSE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field ASE[5] (RW)
 *
 * Controls whether the controller skips processing the asynchronous schedule.
 * Only used in host mode.
 *
 * Values:
 * - 0 - Do not process asynchronous schedule.
 * - 1 - Use the ASYNCLISTADDR register to access asynchronous schedule.
 */
//@{
#define BP_USBHS_USBCMD_ASE  (5U)          //!< Bit position for USBHS_USBCMD_ASE.
#define BM_USBHS_USBCMD_ASE  (0x00000020U) //!< Bit mask for USBHS_USBCMD_ASE.
#define BS_USBHS_USBCMD_ASE  (1U)          //!< Bit field size in bits for USBHS_USBCMD_ASE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_ASE field.
#define BR_USBHS_USBCMD_ASE  (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_ASE))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_ASE.
#define BF_USBHS_USBCMD_ASE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_ASE), uint32_t) & BM_USBHS_USBCMD_ASE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ASE field to a new value.
#define BW_USBHS_USBCMD_ASE(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_ASE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field IAA[6] (RW)
 *
 * Used as a doorbell by software to tell controller to issue an interrupt the
 * next time it advances the asynchronous schedule. Software must write a 1 to
 * this bit to ring the doorbell. When controller has evicted all appropriate cached
 * schedule states, it sets USBSTS[AAI] register. If the USBINTR[AAE] bit is
 * set, the host controller asserts an interrupt at the next interrupt threshold.
 * The controller clears this bit after it has set the USBSTS[AAI] bit. Software
 * must not write a 1 to this bit when the asynchronous schedule is inactive. Doing
 * so yields undefined results. This bit used only in host mode. Writing a 1 to
 * this bit when the USBHS module is in device mode has undefined results.
 */
//@{
#define BP_USBHS_USBCMD_IAA  (6U)          //!< Bit position for USBHS_USBCMD_IAA.
#define BM_USBHS_USBCMD_IAA  (0x00000040U) //!< Bit mask for USBHS_USBCMD_IAA.
#define BS_USBHS_USBCMD_IAA  (1U)          //!< Bit field size in bits for USBHS_USBCMD_IAA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_IAA field.
#define BR_USBHS_USBCMD_IAA  (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_IAA))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_IAA.
#define BF_USBHS_USBCMD_IAA(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_IAA), uint32_t) & BM_USBHS_USBCMD_IAA)

#ifndef __LANGUAGE_ASM__
//! @brief Set the IAA field to a new value.
#define BW_USBHS_USBCMD_IAA(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_IAA) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field ASP[9:8] (RW)
 *
 * Contains a count of the successive transactions the host controller can
 * execute from a high-speed queue head on the asynchronous schedule before continuing
 * traversal of the asynchronous schedule. Valid values are 0b1 to 0b11.
 * Software must not write a zero to this field when ASPE is set as this results in
 * undefined behavior.
 */
//@{
#define BP_USBHS_USBCMD_ASP  (8U)          //!< Bit position for USBHS_USBCMD_ASP.
#define BM_USBHS_USBCMD_ASP  (0x00000300U) //!< Bit mask for USBHS_USBCMD_ASP.
#define BS_USBHS_USBCMD_ASP  (2U)          //!< Bit field size in bits for USBHS_USBCMD_ASP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_ASP field.
#define BR_USBHS_USBCMD_ASP  (HW_USBHS_USBCMD.B.ASP)
#endif

//! @brief Format value for bitfield USBHS_USBCMD_ASP.
#define BF_USBHS_USBCMD_ASP(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_ASP), uint32_t) & BM_USBHS_USBCMD_ASP)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ASP field to a new value.
#define BW_USBHS_USBCMD_ASP(v) (HW_USBHS_USBCMD_WR((HW_USBHS_USBCMD_RD() & ~BM_USBHS_USBCMD_ASP) | BF_USBHS_USBCMD_ASP(v)))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field ASPE[11] (RW)
 *
 * Software uses this bit to enable or disable park mode.
 *
 * Values:
 * - 0 - Park mode disabled
 * - 1 - Park mode enabled
 */
//@{
#define BP_USBHS_USBCMD_ASPE (11U)         //!< Bit position for USBHS_USBCMD_ASPE.
#define BM_USBHS_USBCMD_ASPE (0x00000800U) //!< Bit mask for USBHS_USBCMD_ASPE.
#define BS_USBHS_USBCMD_ASPE (1U)          //!< Bit field size in bits for USBHS_USBCMD_ASPE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_ASPE field.
#define BR_USBHS_USBCMD_ASPE (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_ASPE))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_ASPE.
#define BF_USBHS_USBCMD_ASPE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_ASPE), uint32_t) & BM_USBHS_USBCMD_ASPE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ASPE field to a new value.
#define BW_USBHS_USBCMD_ASPE(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_ASPE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field SUTW[13] (RW)
 *
 * This is a non-EHCI bit. Used as a semaphore to ensure that the setup data
 * payload of 8 bytes is extracted from a QH by driver software without being
 * corrupted. If the setup lockout mode is off (USBMODE[SLOM] = 1) then a hazard exists
 * when new setup data arrives, and the software copies setup from the QH for a
 * previous setup packet. This bit is set and cleared by software and is cleared
 * by hardware when a hazard exists. More information appears in section "Control
 * Endpoint Operation."
 */
//@{
#define BP_USBHS_USBCMD_SUTW (13U)         //!< Bit position for USBHS_USBCMD_SUTW.
#define BM_USBHS_USBCMD_SUTW (0x00002000U) //!< Bit mask for USBHS_USBCMD_SUTW.
#define BS_USBHS_USBCMD_SUTW (1U)          //!< Bit field size in bits for USBHS_USBCMD_SUTW.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_SUTW field.
#define BR_USBHS_USBCMD_SUTW (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_SUTW))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_SUTW.
#define BF_USBHS_USBCMD_SUTW(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_SUTW), uint32_t) & BM_USBHS_USBCMD_SUTW)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SUTW field to a new value.
#define BW_USBHS_USBCMD_SUTW(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_SUTW) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field ATDTW[14] (RW)
 *
 * This is a non-EHCI bit. This bit is used as a semaphore when a dTD is added
 * to an active (primed) endpoint. This bit is set and cleared by software. This
 * bit is also cleared by hardware when the state machine is in a hazard region
 * where adding a dTD to a primed endpoint may go unrecognized. More information
 * appears in section "Executing a Transfer Descriptor."
 */
//@{
#define BP_USBHS_USBCMD_ATDTW (14U)        //!< Bit position for USBHS_USBCMD_ATDTW.
#define BM_USBHS_USBCMD_ATDTW (0x00004000U) //!< Bit mask for USBHS_USBCMD_ATDTW.
#define BS_USBHS_USBCMD_ATDTW (1U)         //!< Bit field size in bits for USBHS_USBCMD_ATDTW.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_ATDTW field.
#define BR_USBHS_USBCMD_ATDTW (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_ATDTW))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_ATDTW.
#define BF_USBHS_USBCMD_ATDTW(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_ATDTW), uint32_t) & BM_USBHS_USBCMD_ATDTW)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ATDTW field to a new value.
#define BW_USBHS_USBCMD_ATDTW(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_ATDTW) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field FS2[15] (RW)
 *
 * See the FS bit description below. This is a non-EHCI bit.
 */
//@{
#define BP_USBHS_USBCMD_FS2  (15U)         //!< Bit position for USBHS_USBCMD_FS2.
#define BM_USBHS_USBCMD_FS2  (0x00008000U) //!< Bit mask for USBHS_USBCMD_FS2.
#define BS_USBHS_USBCMD_FS2  (1U)          //!< Bit field size in bits for USBHS_USBCMD_FS2.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_FS2 field.
#define BR_USBHS_USBCMD_FS2  (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_FS2))
#endif

//! @brief Format value for bitfield USBHS_USBCMD_FS2.
#define BF_USBHS_USBCMD_FS2(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_FS2), uint32_t) & BM_USBHS_USBCMD_FS2)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FS2 field to a new value.
#define BW_USBHS_USBCMD_FS2(v) (BITBAND_ACCESS32(HW_USBHS_USBCMD_ADDR, BP_USBHS_USBCMD_FS2) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBCMD, field ITC[23:16] (RW)
 *
 * System software uses this field to set the maximum rate at which the module
 * issues interrupts. ITC contains maximum interrupt interval measured in
 * microframes.
 *
 * Values:
 * - 0 - Immediate (no threshold)
 * - 1 - 1 microframe
 * - 10 - 2 microframes
 * - 100 - 4 microframes
 * - 1000 - 8 microframes
 * - 10000 - 16 microframes
 * - 100000 - 32 microframes
 * - 1000000 - 64 microframes
 */
//@{
#define BP_USBHS_USBCMD_ITC  (16U)         //!< Bit position for USBHS_USBCMD_ITC.
#define BM_USBHS_USBCMD_ITC  (0x00FF0000U) //!< Bit mask for USBHS_USBCMD_ITC.
#define BS_USBHS_USBCMD_ITC  (8U)          //!< Bit field size in bits for USBHS_USBCMD_ITC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBCMD_ITC field.
#define BR_USBHS_USBCMD_ITC  (HW_USBHS_USBCMD.B.ITC)
#endif

//! @brief Format value for bitfield USBHS_USBCMD_ITC.
#define BF_USBHS_USBCMD_ITC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBCMD_ITC), uint32_t) & BM_USBHS_USBCMD_ITC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ITC field to a new value.
#define BW_USBHS_USBCMD_ITC(v) (HW_USBHS_USBCMD_WR((HW_USBHS_USBCMD_RD() & ~BM_USBHS_USBCMD_ITC) | BF_USBHS_USBCMD_ITC(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_USBSTS - USB Status Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_USBSTS - USB Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register indicates various states of each module and any pending
 * interrupts. This register does not indicate status resulting from a transaction on
 * the serial bus. Software clears certain bits in this register by writing a 1 to
 * them.
 */
typedef union _hw_usbhs_usbsts
{
    uint32_t U;
    struct _hw_usbhs_usbsts_bitfields
    {
        uint32_t UI : 1;               //!< [0] USB Interrupt (USBINT)
        uint32_t UEI : 1;              //!< [1] USB Error Interrupt
        uint32_t PCI : 1;              //!< [2] Port Change detect
        uint32_t FRI : 1;              //!< [3] Frame-list Rollover
        uint32_t SEI : 1;              //!< [4] System Error
        uint32_t AAI : 1;              //!< [5] Interrupt on Async Advance
        uint32_t URI : 1;              //!< [6] USB Reset received
        uint32_t SRI : 1;              //!< [7] SOF Received
        uint32_t SLI : 1;              //!< [8] Device-controller suspend
        uint32_t RESERVED0 : 1;        //!< [9] Reserved
        uint32_t ULPII : 1;            //!< [10] ULPI Interrupt
        uint32_t RESERVED1 : 1;        //!< [11] Reserved
        uint32_t HCH : 1;              //!< [12] Host Controller Halted
        uint32_t RCL : 1;              //!< [13] Reclamation
        uint32_t PS : 1;               //!< [14] Periodic schedule Status
        uint32_t AS : 1;               //!< [15] Asynchronous schedule Status
        uint32_t NAKI : 1;             //!< [16] NAK Interrupt
        uint32_t RESERVED2 : 1;        //!< [17] Reserved
        uint32_t UAI : 1;              //!< [18] USB host Asynchronous Interrupt
        uint32_t UPI : 1;              //!< [19] USB host Periodic Interrupt
        uint32_t RESERVED3 : 4;        //!< [23:20] Reserved
        uint32_t TI0 : 1;              //!< [24] General purpose Timer 0 Interrupt
        uint32_t TI1 : 1;              //!< [25] General purpose Timer 1 Interrupt
        uint32_t RESERVED4 : 6;        //!< [31:26] Reserved
    } B;
} hw_usbhs_usbsts_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_USBSTS register
 */
//@{
#define HW_USBHS_USBSTS_ADDR     (REGS_USBHS_BASE + 0x144U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_USBSTS          (*(__IO hw_usbhs_usbsts_t *) HW_USBHS_USBSTS_ADDR)
#define HW_USBHS_USBSTS_RD()     (HW_USBHS_USBSTS.U)
#define HW_USBHS_USBSTS_WR(v)    (HW_USBHS_USBSTS.U = (v))
#define HW_USBHS_USBSTS_SET(v)   (HW_USBHS_USBSTS_WR(HW_USBHS_USBSTS_RD() |  (v)))
#define HW_USBHS_USBSTS_CLR(v)   (HW_USBHS_USBSTS_WR(HW_USBHS_USBSTS_RD() & ~(v)))
#define HW_USBHS_USBSTS_TOG(v)   (HW_USBHS_USBSTS_WR(HW_USBHS_USBSTS_RD() ^  (v)))
#endif
//@}

