ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_USBSTS bitfields
 */

/*!
 * @name Register USBHS_USBSTS, field UI[0] (W1C)
 *
 * This bit is set by the controller when the cause of an interrupt is a
 * completion of a USB transaction where the TD has an interrupt on complete (IOC) bit
 * set. This bit is also set by the controller when a short packet is detected. A
 * short packet is when the actual number of bytes received was less than the
 * expected number of bytes.
 */
//@{
#define BP_USBHS_USBSTS_UI   (0U)          //!< Bit position for USBHS_USBSTS_UI.
#define BM_USBHS_USBSTS_UI   (0x00000001U) //!< Bit mask for USBHS_USBSTS_UI.
#define BS_USBHS_USBSTS_UI   (1U)          //!< Bit field size in bits for USBHS_USBSTS_UI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_UI field.
#define BR_USBHS_USBSTS_UI   (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_UI.
#define BF_USBHS_USBSTS_UI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_UI), uint32_t) & BM_USBHS_USBSTS_UI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UI field to a new value.
#define BW_USBHS_USBSTS_UI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field UEI[1] (W1C)
 *
 * When completion of USB transaction results in error condition, the controller
 * sets this bit. If the TD on which the error interrupt occurred also had its
 * interrupt on complete (IOC) bit set, this bit is set along with the USBINT bit.
 * See Section 4.15.1 in the EHCI specification for a complete list of host
 * error interrupt conditions. See Table 24-62 for more information on device error
 * matrix.
 *
 * Values:
 * - 0 - No error
 * - 1 - Error detected
 */
//@{
#define BP_USBHS_USBSTS_UEI  (1U)          //!< Bit position for USBHS_USBSTS_UEI.
#define BM_USBHS_USBSTS_UEI  (0x00000002U) //!< Bit mask for USBHS_USBSTS_UEI.
#define BS_USBHS_USBSTS_UEI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_UEI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_UEI field.
#define BR_USBHS_USBSTS_UEI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UEI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_UEI.
#define BF_USBHS_USBSTS_UEI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_UEI), uint32_t) & BM_USBHS_USBSTS_UEI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UEI field to a new value.
#define BW_USBHS_USBSTS_UEI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UEI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field PCI[2] (W1C)
 *
 * This bit is not EHCI compatible. Host mode: Controller sets this bit when a
 * connect status occurs on any port, a port enable/disable change occurs, an
 * over-current change occurs, or the force port resume (PORTSCn[FPR]) bit is set as
 * the result of a J-K transition on the suspended port. Device mode: The
 * controller sets this bit when it enters the full- or high-speed operational state.
 * When it exits the full- or high-speed operation states due to reset or suspend
 * events, the notification mechanisms are URI and SLI bits respectively. The
 * device controller detects resume signaling only.
 */
//@{
#define BP_USBHS_USBSTS_PCI  (2U)          //!< Bit position for USBHS_USBSTS_PCI.
#define BM_USBHS_USBSTS_PCI  (0x00000004U) //!< Bit mask for USBHS_USBSTS_PCI.
#define BS_USBHS_USBSTS_PCI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_PCI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_PCI field.
#define BR_USBHS_USBSTS_PCI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_PCI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_PCI.
#define BF_USBHS_USBSTS_PCI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_PCI), uint32_t) & BM_USBHS_USBSTS_PCI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PCI field to a new value.
#define BW_USBHS_USBSTS_PCI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_PCI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field FRI[3] (W1C)
 *
 * Controller sets this bit when the frame list index (FRINDEX) rolls over from
 * its maximum value to 0. The exact value the rollover occurs depends on the
 * frame list size. For example, if the frame list size (as programmed in the
 * USBCMD[FS] field) is 1024, the frame index register rolls over every time
 * FRINDEX[13] toggles. Similarly, if the size is 512, the controller sets this bit each
 * time FRINDEX[12] toggles. Used only in the host mode.
 */
//@{
#define BP_USBHS_USBSTS_FRI  (3U)          //!< Bit position for USBHS_USBSTS_FRI.
#define BM_USBHS_USBSTS_FRI  (0x00000008U) //!< Bit mask for USBHS_USBSTS_FRI.
#define BS_USBHS_USBSTS_FRI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_FRI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_FRI field.
#define BR_USBHS_USBSTS_FRI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_FRI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_FRI.
#define BF_USBHS_USBSTS_FRI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_FRI), uint32_t) & BM_USBHS_USBSTS_FRI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FRI field to a new value.
#define BW_USBHS_USBSTS_FRI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_FRI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field SEI[4] (W1C)
 *
 * Set when an error is detected on the system bus. If the system error enable
 * bit (USBINTR[SEE]) is set, interrupt generates. The interrupt and status bits
 * remain set until cleared by writing a 1 to this bit. Additionally, when in host
 * mode, the USBCMD[RS] bit is cleared, effectively disabling controller. An
 * interrupt generates for the USBHS controller in device mode, but no other action
 * is taken.
 *
 * Values:
 * - 0 - Normal operation
 * - 1 - Error
 */
//@{
#define BP_USBHS_USBSTS_SEI  (4U)          //!< Bit position for USBHS_USBSTS_SEI.
#define BM_USBHS_USBSTS_SEI  (0x00000010U) //!< Bit mask for USBHS_USBSTS_SEI.
#define BS_USBHS_USBSTS_SEI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_SEI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_SEI field.
#define BR_USBHS_USBSTS_SEI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_SEI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_SEI.
#define BF_USBHS_USBSTS_SEI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_SEI), uint32_t) & BM_USBHS_USBSTS_SEI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SEI field to a new value.
#define BW_USBHS_USBSTS_SEI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_SEI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field AAI[5] (W1C)
 *
 * By setting the USBCMD[IAA] bit, system software can force the controller to
 * issue an interrupt the next time the controller advances the asynchronous
 * schedule. This status bit indicates the assertion of that interrupt source. Used
 * only by the host mode.
 *
 * Values:
 * - 0 - No async advance interrupt
 * - 1 - Async advance interrupt
 */
//@{
#define BP_USBHS_USBSTS_AAI  (5U)          //!< Bit position for USBHS_USBSTS_AAI.
#define BM_USBHS_USBSTS_AAI  (0x00000020U) //!< Bit mask for USBHS_USBSTS_AAI.
#define BS_USBHS_USBSTS_AAI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_AAI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_AAI field.
#define BR_USBHS_USBSTS_AAI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_AAI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_AAI.
#define BF_USBHS_USBSTS_AAI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_AAI), uint32_t) & BM_USBHS_USBSTS_AAI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the AAI field to a new value.
#define BW_USBHS_USBSTS_AAI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_AAI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field URI[6] (W1C)
 *
 * A non-EHCI bit. When the controller detects a USB reset and enters the
 * default state, this bit is set. Software can write a 1 to this bit to clear it. Used
 * only by in device mode.
 *
 * Values:
 * - 0 - No reset received
 * - 1 - Reset received
 */
//@{
#define BP_USBHS_USBSTS_URI  (6U)          //!< Bit position for USBHS_USBSTS_URI.
#define BM_USBHS_USBSTS_URI  (0x00000040U) //!< Bit mask for USBHS_USBSTS_URI.
#define BS_USBHS_USBSTS_URI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_URI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_URI field.
#define BR_USBHS_USBSTS_URI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_URI))
#endif

