ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_USBSTS_URI.
#define BF_USBHS_USBSTS_URI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_URI), uint32_t) & BM_USBHS_USBSTS_URI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the URI field to a new value.
#define BW_USBHS_USBSTS_URI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_URI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field SRI[7] (W1C)
 *
 * This is a non-EHCI status bit. Software writes a 1 to this bit to clear it.
 * Host mode: In host mode, this bit is set every 125 ms, provided PHY clock is
 * present and running (for example, the port is NOT suspended) and can be used by
 * the host-controller driver as a time base. Device mode: When controller
 * detects a start of (micro) frame, bit is set. When a SOF is extremely late,
 * controller automatically sets this bit to indicate an SOF was expected. Therefore,
 * this bit is set roughly every 1 ms in device FS mode and every 125 us in HS mode,
 * and it is synchronized to the actual SOF received. Because the controller is
 * initialized to FS before connect, this bit is set at an interval of 1 ms
 * during the prelude to the connect and chirp.
 */
//@{
#define BP_USBHS_USBSTS_SRI  (7U)          //!< Bit position for USBHS_USBSTS_SRI.
#define BM_USBHS_USBSTS_SRI  (0x00000080U) //!< Bit mask for USBHS_USBSTS_SRI.
#define BS_USBHS_USBSTS_SRI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_SRI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_SRI field.
#define BR_USBHS_USBSTS_SRI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_SRI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_SRI.
#define BF_USBHS_USBSTS_SRI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_SRI), uint32_t) & BM_USBHS_USBSTS_SRI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SRI field to a new value.
#define BW_USBHS_USBSTS_SRI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_SRI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field SLI[8] (W1C)
 *
 * Non-EHCI bit. When a device controller enters a suspend state from an active
 * state, this bit is set. The device controller clears the bit upon exiting from
 * a suspend state. Used only by the device controller.
 *
 * Values:
 * - 0 - Active
 * - 1 - Suspended
 */
//@{
#define BP_USBHS_USBSTS_SLI  (8U)          //!< Bit position for USBHS_USBSTS_SLI.
#define BM_USBHS_USBSTS_SLI  (0x00000100U) //!< Bit mask for USBHS_USBSTS_SLI.
#define BS_USBHS_USBSTS_SLI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_SLI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_SLI field.
#define BR_USBHS_USBSTS_SLI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_SLI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_SLI.
#define BF_USBHS_USBSTS_SLI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_SLI), uint32_t) & BM_USBHS_USBSTS_SLI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SLI field to a new value.
#define BW_USBHS_USBSTS_SLI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_SLI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field ULPII[10] (RO)
 *
 * Set by event completion.
 */
//@{
#define BP_USBHS_USBSTS_ULPII (10U)        //!< Bit position for USBHS_USBSTS_ULPII.
#define BM_USBHS_USBSTS_ULPII (0x00000400U) //!< Bit mask for USBHS_USBSTS_ULPII.
#define BS_USBHS_USBSTS_ULPII (1U)         //!< Bit field size in bits for USBHS_USBSTS_ULPII.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_ULPII field.
#define BR_USBHS_USBSTS_ULPII (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_ULPII))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field HCH[12] (RO)
 *
 * This bit is cleared when the USBCMD[RS] bit is set. The controller sets this
 * bit after it stops executing because of the USBCMD[RS] bit being cleared, by
 * software or the host controller hardware (for example, internal error). Used
 * only in host mode.
 *
 * Values:
 * - 0 - Running
 * - 1 - Halted
 */
//@{
#define BP_USBHS_USBSTS_HCH  (12U)         //!< Bit position for USBHS_USBSTS_HCH.
#define BM_USBHS_USBSTS_HCH  (0x00001000U) //!< Bit mask for USBHS_USBSTS_HCH.
#define BS_USBHS_USBSTS_HCH  (1U)          //!< Bit field size in bits for USBHS_USBSTS_HCH.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_HCH field.
#define BR_USBHS_USBSTS_HCH  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_HCH))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field RCL[13] (RO)
 *
 * Detects an empty asynchronous schedule. Used only by the host mode.
 *
 * Values:
 * - 0 - Non-empty asynchronous schedule
 * - 1 - Empty asynchronous schedule
 */
//@{
#define BP_USBHS_USBSTS_RCL  (13U)         //!< Bit position for USBHS_USBSTS_RCL.
#define BM_USBHS_USBSTS_RCL  (0x00002000U) //!< Bit mask for USBHS_USBSTS_RCL.
#define BS_USBHS_USBSTS_RCL  (1U)          //!< Bit field size in bits for USBHS_USBSTS_RCL.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_RCL field.
#define BR_USBHS_USBSTS_RCL  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_RCL))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field PS[14] (RO)
 *
 * Reports current real status of periodic schedule. Controller is not
 * immediately required to disable or enable the periodic schedule when software
 * transitions the USBCMD[PSE] bit. When this bit and the USBCMD[PSE] bit have the same
 * value, the periodic schedule is enabled or disabled. Used only in host mode.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBSTS_PS   (14U)         //!< Bit position for USBHS_USBSTS_PS.
#define BM_USBHS_USBSTS_PS   (0x00004000U) //!< Bit mask for USBHS_USBSTS_PS.
#define BS_USBHS_USBSTS_PS   (1U)          //!< Bit field size in bits for USBHS_USBSTS_PS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_PS field.
#define BR_USBHS_USBSTS_PS   (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_PS))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field AS[15] (RO)
 *
 * Reports the current real status of asynchronous schedule. Controller is not
 * immediately required to disable or enable the asynchronous schedule when
 * software transitions the USBCMD[ASE] bit. When this bit and the USBCMD[ASE] bit have
 * the same value, the asynchronous schedule is enabled (1) or disabled (0).
 * Used only in host mode.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBSTS_AS   (15U)         //!< Bit position for USBHS_USBSTS_AS.
#define BM_USBHS_USBSTS_AS   (0x00008000U) //!< Bit mask for USBHS_USBSTS_AS.
#define BS_USBHS_USBSTS_AS   (1U)          //!< Bit field size in bits for USBHS_USBSTS_AS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_AS field.
#define BR_USBHS_USBSTS_AS   (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_AS))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field NAKI[16] (RO)
 *
 * Set by hardware for a particular endpoint when the TX/RX endpoint's NAK bit
 * and the corresponding TX/RX endpoint's NAK enable bit are set. The hardware
 * automatically clears this bit when all the enabled TX/RX endpoint NAK bits are
 * cleared.
 */
//@{
#define BP_USBHS_USBSTS_NAKI (16U)         //!< Bit position for USBHS_USBSTS_NAKI.
#define BM_USBHS_USBSTS_NAKI (0x00010000U) //!< Bit mask for USBHS_USBSTS_NAKI.
#define BS_USBHS_USBSTS_NAKI (1U)          //!< Bit field size in bits for USBHS_USBSTS_NAKI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_NAKI field.
#define BR_USBHS_USBSTS_NAKI (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_NAKI))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field UAI[18] (RW)
 *
 * Set by the host controller when the cause of an interrupt is a completion of
 * a USB transaction where the transfer descriptor (TD) has an interrupt on
 * complete (IOC) bit set and the TD was from the asynchronous schedule. This bit is
 * also set by the host controller when a short packet is detected and the packet
 * is on the asynchronous schedule. A short packet is when the actual number of
 * bytes received was less than the expected number of bytes. This bit is not used
 * by the device controller and is always zero.
 */
//@{
#define BP_USBHS_USBSTS_UAI  (18U)         //!< Bit position for USBHS_USBSTS_UAI.
#define BM_USBHS_USBSTS_UAI  (0x00040000U) //!< Bit mask for USBHS_USBSTS_UAI.
#define BS_USBHS_USBSTS_UAI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_UAI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_UAI field.
#define BR_USBHS_USBSTS_UAI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UAI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_UAI.
#define BF_USBHS_USBSTS_UAI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_UAI), uint32_t) & BM_USBHS_USBSTS_UAI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UAI field to a new value.
#define BW_USBHS_USBSTS_UAI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UAI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field UPI[19] (RW)
 *
 * Set by the host controller when the cause of an interrupt is a completion of
 * a USB transaction where the transfer descriptor (TD) has an interrupt on
 * complete (IOC) bit set and the TD was from the periodic schedule. This bit is also
 * set by the host controller when a short packet is detected and the packet is
 * on the periodic schedule. A short packet is when the actual number of bytes
 * received was less than the expected number of bytes. This bit is not used by the
 * device controller and is always zero.
 */
//@{
#define BP_USBHS_USBSTS_UPI  (19U)         //!< Bit position for USBHS_USBSTS_UPI.
#define BM_USBHS_USBSTS_UPI  (0x00080000U) //!< Bit mask for USBHS_USBSTS_UPI.
#define BS_USBHS_USBSTS_UPI  (1U)          //!< Bit field size in bits for USBHS_USBSTS_UPI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_UPI field.
#define BR_USBHS_USBSTS_UPI  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UPI))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_UPI.
#define BF_USBHS_USBSTS_UPI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_UPI), uint32_t) & BM_USBHS_USBSTS_UPI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UPI field to a new value.
#define BW_USBHS_USBSTS_UPI(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_UPI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field TI0[24] (W1C)
 *
 * Set when the counter in the GPTIMER0CTRL register transitions to zero.
 * Writing a one to this bit clears it.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
//@{
#define BP_USBHS_USBSTS_TI0  (24U)         //!< Bit position for USBHS_USBSTS_TI0.
#define BM_USBHS_USBSTS_TI0  (0x01000000U) //!< Bit mask for USBHS_USBSTS_TI0.
#define BS_USBHS_USBSTS_TI0  (1U)          //!< Bit field size in bits for USBHS_USBSTS_TI0.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_TI0 field.
#define BR_USBHS_USBSTS_TI0  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_TI0))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_TI0.
#define BF_USBHS_USBSTS_TI0(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_TI0), uint32_t) & BM_USBHS_USBSTS_TI0)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TI0 field to a new value.
#define BW_USBHS_USBSTS_TI0(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_TI0) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBSTS, field TI1[25] (W1C)
 *
 * Set when the counter in the GPTIMER1CTRL register transitions to zero.
 * Writing a one to this bit clears it.
 *
 * Values:
 * - 0 - No interrupt
 * - 1 - Interrupt occurred
 */
//@{
#define BP_USBHS_USBSTS_TI1  (25U)         //!< Bit position for USBHS_USBSTS_TI1.
#define BM_USBHS_USBSTS_TI1  (0x02000000U) //!< Bit mask for USBHS_USBSTS_TI1.
#define BS_USBHS_USBSTS_TI1  (1U)          //!< Bit field size in bits for USBHS_USBSTS_TI1.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBSTS_TI1 field.
#define BR_USBHS_USBSTS_TI1  (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_TI1))
#endif

//! @brief Format value for bitfield USBHS_USBSTS_TI1.
#define BF_USBHS_USBSTS_TI1(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBSTS_TI1), uint32_t) & BM_USBHS_USBSTS_TI1)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TI1 field to a new value.
#define BW_USBHS_USBSTS_TI1(v) (BITBAND_ACCESS32(HW_USBHS_USBSTS_ADDR, BP_USBHS_USBSTS_TI1) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_USBINTR - USB Interrupt Enable Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_USBINTR - USB Interrupt Enable Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The interrupts to software are enabled with this register. An interrupt
 * generates when a bit is set and the corresponding interrupt is active. The USB
 * status register (USBSTS) continues to show interrupt sources (even if the USBINTR
 * register disables them), allowing polling of interrupt events by the software.
 */
typedef union _hw_usbhs_usbintr
{
    uint32_t U;
    struct _hw_usbhs_usbintr_bitfields
    {
        uint32_t UE : 1;               //!< [0] USB interrupt Enable
        uint32_t UEE : 1;              //!< [1] USB Error interrupt Enable
        uint32_t PCE : 1;              //!< [2] Port Change detect Enable
        uint32_t FRE : 1;              //!< [3] Frame list Rollover Enable
        uint32_t SEE : 1;              //!< [4] System Error Enable
        uint32_t AAE : 1;              //!< [5] Interrupt on Async advance Enable
        uint32_t URE : 1;              //!< [6] USB-Reset Enable
        uint32_t SRE : 1;              //!< [7] SOF-Received Enable
        uint32_t SLE : 1;              //!< [8] Sleep (DC suspend) Enable
        uint32_t RESERVED0 : 1;        //!< [9] Reserved
        uint32_t ULPIE : 1;            //!< [10] ULPI Enable
        uint32_t RESERVED1 : 5;        //!< [15:11] Reserved
        uint32_t NAKE : 1;             //!< [16] NAK Interrupt Enable
        uint32_t RESERVED2 : 1;        //!< [17] Reserved
        uint32_t UAIE : 1;             //!< [18] USB host Asynchronous Interrupt Enable
        uint32_t UPIE : 1;             //!< [19] USB host Periodic Interrupt Enable
        uint32_t RESERVED3 : 4;        //!< [23:20] Reserved
        uint32_t TIE0 : 1;             //!< [24] General purpose Timer 0 Interrupt Enable
        uint32_t TIE1 : 1;             //!< [25] General purpose Timer 1 Interrupt Enable
        uint32_t RESERVED4 : 6;        //!< [31:26] Reserved
    } B;
} hw_usbhs_usbintr_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_USBINTR register
 */
//@{
#define HW_USBHS_USBINTR_ADDR    (REGS_USBHS_BASE + 0x148U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_USBINTR         (*(__IO hw_usbhs_usbintr_t *) HW_USBHS_USBINTR_ADDR)
#define HW_USBHS_USBINTR_RD()    (HW_USBHS_USBINTR.U)
#define HW_USBHS_USBINTR_WR(v)   (HW_USBHS_USBINTR.U = (v))
#define HW_USBHS_USBINTR_SET(v)  (HW_USBHS_USBINTR_WR(HW_USBHS_USBINTR_RD() |  (v)))
#define HW_USBHS_USBINTR_CLR(v)  (HW_USBHS_USBINTR_WR(HW_USBHS_USBINTR_RD() & ~(v)))
#define HW_USBHS_USBINTR_TOG(v)  (HW_USBHS_USBINTR_WR(HW_USBHS_USBINTR_RD() ^  (v)))
#endif
//@}

