ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_USBINTR bitfields
 */

/*!
 * @name Register USBHS_USBINTR, field UE[0] (RW)
 *
 * When this bit is 1 and the USBSTS[UI] bit is set, the USBHS controller issues
 * an interrupt at the next interrupt threshold. Software clearing the
 * USBSTS[UI] bit acknowledges the interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_UE  (0U)          //!< Bit position for USBHS_USBINTR_UE.
#define BM_USBHS_USBINTR_UE  (0x00000001U) //!< Bit mask for USBHS_USBINTR_UE.
#define BS_USBHS_USBINTR_UE  (1U)          //!< Bit field size in bits for USBHS_USBINTR_UE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_UE field.
#define BR_USBHS_USBINTR_UE  (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_UE.
#define BF_USBHS_USBINTR_UE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_UE), uint32_t) & BM_USBHS_USBINTR_UE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UE field to a new value.
#define BW_USBHS_USBINTR_UE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field UEE[1] (RW)
 *
 * When this bit and the USBSTS[UEI ] bit are set, controller issues an
 * interrupt at the next interrupt threshold. Software clearing the USBSTS[UEI ] bit
 * acknowledges the interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_UEE (1U)          //!< Bit position for USBHS_USBINTR_UEE.
#define BM_USBHS_USBINTR_UEE (0x00000002U) //!< Bit mask for USBHS_USBINTR_UEE.
#define BS_USBHS_USBINTR_UEE (1U)          //!< Bit field size in bits for USBHS_USBINTR_UEE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_UEE field.
#define BR_USBHS_USBINTR_UEE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UEE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_UEE.
#define BF_USBHS_USBINTR_UEE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_UEE), uint32_t) & BM_USBHS_USBINTR_UEE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UEE field to a new value.
#define BW_USBHS_USBINTR_UEE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UEE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field PCE[2] (RW)
 *
 * When this bit and the USBSTS[PCI] bit are set, controller issues an
 * interrupt. Software clearing the USBSTS[PCI] bit acknowledges the interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_PCE (2U)          //!< Bit position for USBHS_USBINTR_PCE.
#define BM_USBHS_USBINTR_PCE (0x00000004U) //!< Bit mask for USBHS_USBINTR_PCE.
#define BS_USBHS_USBINTR_PCE (1U)          //!< Bit field size in bits for USBHS_USBINTR_PCE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_PCE field.
#define BR_USBHS_USBINTR_PCE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_PCE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_PCE.
#define BF_USBHS_USBINTR_PCE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_PCE), uint32_t) & BM_USBHS_USBINTR_PCE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PCE field to a new value.
#define BW_USBHS_USBINTR_PCE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_PCE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field FRE[3] (RW)
 *
 * When this bit and the USBSTS[FRI] bit are set, controller issues an
 * interrupt. Software clearing the USBSTS[FRI] bit acknowledges the interrupt. Used only
 * in host mode.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_FRE (3U)          //!< Bit position for USBHS_USBINTR_FRE.
#define BM_USBHS_USBINTR_FRE (0x00000008U) //!< Bit mask for USBHS_USBINTR_FRE.
#define BS_USBHS_USBINTR_FRE (1U)          //!< Bit field size in bits for USBHS_USBINTR_FRE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_FRE field.
#define BR_USBHS_USBINTR_FRE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_FRE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_FRE.
#define BF_USBHS_USBINTR_FRE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_FRE), uint32_t) & BM_USBHS_USBINTR_FRE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FRE field to a new value.
#define BW_USBHS_USBINTR_FRE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_FRE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field SEE[4] (RW)
 *
 * When this bit and the USBSTS[SEI] bit are set, controller issues an
 * interrupt. Software clearing the USBSTS[SEI] bit acknowledges the interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_SEE (4U)          //!< Bit position for USBHS_USBINTR_SEE.
#define BM_USBHS_USBINTR_SEE (0x00000010U) //!< Bit mask for USBHS_USBINTR_SEE.
#define BS_USBHS_USBINTR_SEE (1U)          //!< Bit field size in bits for USBHS_USBINTR_SEE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_SEE field.
#define BR_USBHS_USBINTR_SEE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_SEE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_SEE.
#define BF_USBHS_USBINTR_SEE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_SEE), uint32_t) & BM_USBHS_USBINTR_SEE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SEE field to a new value.
#define BW_USBHS_USBINTR_SEE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_SEE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field AAE[5] (RW)
 *
 * When this bit and the USBSTS[AAI] bit are set, controller issues an interrupt
 * at the next interrupt threshold. Software clearing the USBSTS[AAI] bit
 * acknowledges the interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_AAE (5U)          //!< Bit position for USBHS_USBINTR_AAE.
#define BM_USBHS_USBINTR_AAE (0x00000020U) //!< Bit mask for USBHS_USBINTR_AAE.
#define BS_USBHS_USBINTR_AAE (1U)          //!< Bit field size in bits for USBHS_USBINTR_AAE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_AAE field.
#define BR_USBHS_USBINTR_AAE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_AAE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_AAE.
#define BF_USBHS_USBINTR_AAE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_AAE), uint32_t) & BM_USBHS_USBINTR_AAE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the AAE field to a new value.
#define BW_USBHS_USBINTR_AAE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_AAE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field URE[6] (RW)
 *
 * A non-EHCI bit. When this bit and the USBSTS[URI] bit are set, device
 * controller issues an interrupt. Software clearing the USBSTS[URI] bit acknowledges
 * the interrupt. Used only in device mode.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_URE (6U)          //!< Bit position for USBHS_USBINTR_URE.
#define BM_USBHS_USBINTR_URE (0x00000040U) //!< Bit mask for USBHS_USBINTR_URE.
#define BS_USBHS_USBINTR_URE (1U)          //!< Bit field size in bits for USBHS_USBINTR_URE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_URE field.
#define BR_USBHS_USBINTR_URE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_URE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_URE.
#define BF_USBHS_USBINTR_URE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_URE), uint32_t) & BM_USBHS_USBINTR_URE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the URE field to a new value.
#define BW_USBHS_USBINTR_URE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_URE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field SRE[7] (RW)
 *
 * This is a non-EHCI bit. When this bit and the USBSTS[SRI] bit are set,
 * controller issues an interrupt. Software clearing the USBSTS[SRI] bit acknowledges
 * the interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_SRE (7U)          //!< Bit position for USBHS_USBINTR_SRE.
#define BM_USBHS_USBINTR_SRE (0x00000080U) //!< Bit mask for USBHS_USBINTR_SRE.
#define BS_USBHS_USBINTR_SRE (1U)          //!< Bit field size in bits for USBHS_USBINTR_SRE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_SRE field.
#define BR_USBHS_USBINTR_SRE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_SRE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_SRE.
#define BF_USBHS_USBINTR_SRE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_SRE), uint32_t) & BM_USBHS_USBINTR_SRE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SRE field to a new value.
#define BW_USBHS_USBINTR_SRE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_SRE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field SLE[8] (RW)
 *
 * A non-EHCI bit. When this bit is set and the USBSTS[SLI] bit transitions,
 * USBHS controller issues an interrupt. Software writing a 1 to the USBSTS[SLI] bit
 * acknowledges the interrupt. Used only in device mode.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_SLE (8U)          //!< Bit position for USBHS_USBINTR_SLE.
#define BM_USBHS_USBINTR_SLE (0x00000100U) //!< Bit mask for USBHS_USBINTR_SLE.
#define BS_USBHS_USBINTR_SLE (1U)          //!< Bit field size in bits for USBHS_USBINTR_SLE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_SLE field.
#define BR_USBHS_USBINTR_SLE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_SLE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_SLE.
#define BF_USBHS_USBINTR_SLE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_SLE), uint32_t) & BM_USBHS_USBINTR_SLE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SLE field to a new value.
#define BW_USBHS_USBINTR_SLE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_SLE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field ULPIE[10] (RW)
 *
 * When this bit and USBSTS[ULPII] are set, controller issues an interrupt. The
 * interrupt is acknowledged by writing a 1 to USBSTS[ULPII].
 */
//@{
#define BP_USBHS_USBINTR_ULPIE (10U)       //!< Bit position for USBHS_USBINTR_ULPIE.
#define BM_USBHS_USBINTR_ULPIE (0x00000400U) //!< Bit mask for USBHS_USBINTR_ULPIE.
#define BS_USBHS_USBINTR_ULPIE (1U)        //!< Bit field size in bits for USBHS_USBINTR_ULPIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_ULPIE field.
#define BR_USBHS_USBINTR_ULPIE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_ULPIE))
#endif

