ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_USBINTR_ULPIE.
#define BF_USBHS_USBINTR_ULPIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_ULPIE), uint32_t) & BM_USBHS_USBINTR_ULPIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPIE field to a new value.
#define BW_USBHS_USBINTR_ULPIE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_ULPIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field NAKE[16] (RW)
 *
 * When this bit and the USBSTS[NAKI] bit are set, an interrupt generates.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_NAKE (16U)        //!< Bit position for USBHS_USBINTR_NAKE.
#define BM_USBHS_USBINTR_NAKE (0x00010000U) //!< Bit mask for USBHS_USBINTR_NAKE.
#define BS_USBHS_USBINTR_NAKE (1U)         //!< Bit field size in bits for USBHS_USBINTR_NAKE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_NAKE field.
#define BR_USBHS_USBINTR_NAKE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_NAKE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_NAKE.
#define BF_USBHS_USBINTR_NAKE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_NAKE), uint32_t) & BM_USBHS_USBINTR_NAKE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the NAKE field to a new value.
#define BW_USBHS_USBINTR_NAKE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_NAKE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field UAIE[18] (RW)
 *
 * When this bit and USBSTS[USBHSTASYNCINT] are set, the host controller issues
 * an interrupt at the next interrupt threshold. The interrupt is acknowledged by
 * clearing USBHSTASYNCINT.
 */
//@{
#define BP_USBHS_USBINTR_UAIE (18U)        //!< Bit position for USBHS_USBINTR_UAIE.
#define BM_USBHS_USBINTR_UAIE (0x00040000U) //!< Bit mask for USBHS_USBINTR_UAIE.
#define BS_USBHS_USBINTR_UAIE (1U)         //!< Bit field size in bits for USBHS_USBINTR_UAIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_UAIE field.
#define BR_USBHS_USBINTR_UAIE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UAIE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_UAIE.
#define BF_USBHS_USBINTR_UAIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_UAIE), uint32_t) & BM_USBHS_USBINTR_UAIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UAIE field to a new value.
#define BW_USBHS_USBINTR_UAIE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UAIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field UPIE[19] (RW)
 *
 * When this bit and USBSTS[USBHSTPERINT] are set, the host controller issues an
 * interrupt at the next interrupt threshold. The interrupt is acknowledged by
 * clearing USBHSTPERINT.
 */
//@{
#define BP_USBHS_USBINTR_UPIE (19U)        //!< Bit position for USBHS_USBINTR_UPIE.
#define BM_USBHS_USBINTR_UPIE (0x00080000U) //!< Bit mask for USBHS_USBINTR_UPIE.
#define BS_USBHS_USBINTR_UPIE (1U)         //!< Bit field size in bits for USBHS_USBINTR_UPIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_UPIE field.
#define BR_USBHS_USBINTR_UPIE (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UPIE))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_UPIE.
#define BF_USBHS_USBINTR_UPIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_UPIE), uint32_t) & BM_USBHS_USBINTR_UPIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the UPIE field to a new value.
#define BW_USBHS_USBINTR_UPIE(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_UPIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field TIE0[24] (RW)
 *
 * When this bit and USBSTS[GPTINT0] are set, the USB controller issues an
 * interrupt to the processor. The interrupt is acknowledged by clearing GPTINT0.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_TIE0 (24U)        //!< Bit position for USBHS_USBINTR_TIE0.
#define BM_USBHS_USBINTR_TIE0 (0x01000000U) //!< Bit mask for USBHS_USBINTR_TIE0.
#define BS_USBHS_USBINTR_TIE0 (1U)         //!< Bit field size in bits for USBHS_USBINTR_TIE0.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_TIE0 field.
#define BR_USBHS_USBINTR_TIE0 (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_TIE0))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_TIE0.
#define BF_USBHS_USBINTR_TIE0(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_TIE0), uint32_t) & BM_USBHS_USBINTR_TIE0)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TIE0 field to a new value.
#define BW_USBHS_USBINTR_TIE0(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_TIE0) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBINTR, field TIE1[25] (RW)
 *
 * When this bit and USBSTS[GPTINT1] are set, the USB controller issues an
 * interrupt to the processor. The interrupt is acknowledged by clearing GPTINT1.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBINTR_TIE1 (25U)        //!< Bit position for USBHS_USBINTR_TIE1.
#define BM_USBHS_USBINTR_TIE1 (0x02000000U) //!< Bit mask for USBHS_USBINTR_TIE1.
#define BS_USBHS_USBINTR_TIE1 (1U)         //!< Bit field size in bits for USBHS_USBINTR_TIE1.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBINTR_TIE1 field.
#define BR_USBHS_USBINTR_TIE1 (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_TIE1))
#endif

//! @brief Format value for bitfield USBHS_USBINTR_TIE1.
#define BF_USBHS_USBINTR_TIE1(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBINTR_TIE1), uint32_t) & BM_USBHS_USBINTR_TIE1)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TIE1 field to a new value.
#define BW_USBHS_USBINTR_TIE1(v) (BITBAND_ACCESS32(HW_USBHS_USBINTR_ADDR, BP_USBHS_USBINTR_TIE1) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_FRINDEX - Frame Index Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_FRINDEX - Frame Index Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * In host mode, the controller uses this register to index the periodic frame
 * list. The register updates every 125 microseconds (once each microframe). Bits
 * [N-3] select a particular entry in the periodic frame list during periodic
 * schedule execution. The number of bits used for the index depends on the size of
 * the frame list as set by system software in the USBCMD[FS] field. Only perform
 * 32-bit accesses to this register. Byte writes produce undefined results. This
 * register cannot be written unless the USBHS controller is in halted state as
 * the USBSTS[HCH] bit indicates. A write to this register while the USBSTS[RS]
 * bit is set produces undefined results. Writes to this register also affect the
 * SOF value. In device mode, this register is read-only, and the USBHS
 * controller updates the FRINDEX[13-3] bits from the frame number the SOF marker
 * indicates. When the USB bus receives a SOF, FRINDEX[13-3] checks against the SOF
 * marker. If FRINDEX[13-3] is different from the SOF marker, FRINDEX[13-3] is set to
 * the SOF value and FRINDEX[2-0] is cleared (SOF for 1 ms frame). If
 * FRINDEX[13-3] equals the SOF value, FRINDEX[2-0] is incremented (SOF for 125 microsec
 * microframe.)
 */
typedef union _hw_usbhs_frindex
{
    uint32_t U;
    struct _hw_usbhs_frindex_bitfields
    {
        uint32_t FRINDEX : 14;         //!< [13:0] Frame Index
        uint32_t Reerved : 18;         //!< [31:14] Reserved
    } B;
} hw_usbhs_frindex_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_FRINDEX register
 */
//@{
#define HW_USBHS_FRINDEX_ADDR    (REGS_USBHS_BASE + 0x14CU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_FRINDEX         (*(__IO hw_usbhs_frindex_t *) HW_USBHS_FRINDEX_ADDR)
#define HW_USBHS_FRINDEX_RD()    (HW_USBHS_FRINDEX.U)
#define HW_USBHS_FRINDEX_WR(v)   (HW_USBHS_FRINDEX.U = (v))
#define HW_USBHS_FRINDEX_SET(v)  (HW_USBHS_FRINDEX_WR(HW_USBHS_FRINDEX_RD() |  (v)))
#define HW_USBHS_FRINDEX_CLR(v)  (HW_USBHS_FRINDEX_WR(HW_USBHS_FRINDEX_RD() & ~(v)))
#define HW_USBHS_FRINDEX_TOG(v)  (HW_USBHS_FRINDEX_WR(HW_USBHS_FRINDEX_RD() ^  (v)))
#endif
//@}

