ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_FRINDEX bitfields
 */

/*!
 * @name Register USBHS_FRINDEX, field FRINDEX[13:0] (RW)
 *
 * The value in this register increments at the end of each time frame
 * (microframe). Bits [N- 3] are for the frame list current index. This means each
 * location of the frame list is accessed 8 times per frame (once each microframe)
 * before moving to the next index. In device mode, the value is the current frame
 * number of the last frame transmitted and not used as an index. In either mode,
 * bits 2-0 indicate current microframe. The table illustrates values of N based on
 * the value of the USBCMD[FS] field when used in host mode. FRINDEX N Values
 * USBCMD[FS] Frame List Size FRINDEX N value 000 1024 elements (4096 bytes) 12 001
 * 512 elements (2048 bytes) 11 010 256 elements (1024 bytes) 10 011 128
 * elements (512 bytes) 9 100 64 elements (256 bytes) 8 101 32 elements (128 bytes) 7
 * 110 16 elements (64 bytes) 6 111 8 elements (32 bytes) 5
 */
//@{
#define BP_USBHS_FRINDEX_FRINDEX (0U)      //!< Bit position for USBHS_FRINDEX_FRINDEX.
#define BM_USBHS_FRINDEX_FRINDEX (0x00003FFFU) //!< Bit mask for USBHS_FRINDEX_FRINDEX.
#define BS_USBHS_FRINDEX_FRINDEX (14U)     //!< Bit field size in bits for USBHS_FRINDEX_FRINDEX.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_FRINDEX_FRINDEX field.
#define BR_USBHS_FRINDEX_FRINDEX (HW_USBHS_FRINDEX.B.FRINDEX)
#endif

//! @brief Format value for bitfield USBHS_FRINDEX_FRINDEX.
#define BF_USBHS_FRINDEX_FRINDEX(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_FRINDEX_FRINDEX), uint32_t) & BM_USBHS_FRINDEX_FRINDEX)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FRINDEX field to a new value.
#define BW_USBHS_FRINDEX_FRINDEX(v) (HW_USBHS_FRINDEX_WR((HW_USBHS_FRINDEX_RD() & ~BM_USBHS_FRINDEX_FRINDEX) | BF_USBHS_FRINDEX_FRINDEX(v)))
#endif
//@}

/*!
 * @name Register USBHS_FRINDEX, field Reerved[31:14] (ROZ)
 *
 * Must be cleared.
 */
//@{
#define BP_USBHS_FRINDEX_Reerved (14U)     //!< Bit position for USBHS_FRINDEX_Reerved.
#define BM_USBHS_FRINDEX_Reerved (0xFFFFC000U) //!< Bit mask for USBHS_FRINDEX_Reerved.
#define BS_USBHS_FRINDEX_Reerved (18U)     //!< Bit field size in bits for USBHS_FRINDEX_Reerved.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_FRINDEX_Reerved field.
#define BR_USBHS_FRINDEX_Reerved (HW_USBHS_FRINDEX.B.Reerved)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_DEVICEADDR - Device Address Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_DEVICEADDR - Device Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. For device mode, the
 * upper seven bits of this register represent the device address. After any
 * controller or USB reset, the device address is set to the default address (0). The
 * default address matches all incoming addresses. Software reprograms the
 * address after receiving a SET_ADDRESS descriptor. The host and device mode
 * functions share this register. In device mode, it is the DEVICEADDR register; in host
 * mode, it is the PERIODICLISTBASE register. See section "Periodic Frame List
 * Base Address Register (PERIODICLISTBASE)," for more information.
 */
typedef union _hw_usbhs_deviceaddr
{
    uint32_t U;
    struct _hw_usbhs_deviceaddr_bitfields
    {
        uint32_t RESERVED0 : 24;       //!< [23:0] Reserved
        uint32_t USBADRA : 1;          //!< [24] Device Address Advance
        uint32_t USBADR : 7;           //!< [31:25] Device Address
    } B;
} hw_usbhs_deviceaddr_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_DEVICEADDR register
 */
//@{
#define HW_USBHS_DEVICEADDR_ADDR (REGS_USBHS_BASE + 0x154U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_DEVICEADDR      (*(__IO hw_usbhs_deviceaddr_t *) HW_USBHS_DEVICEADDR_ADDR)
#define HW_USBHS_DEVICEADDR_RD() (HW_USBHS_DEVICEADDR.U)
#define HW_USBHS_DEVICEADDR_WR(v) (HW_USBHS_DEVICEADDR.U = (v))
#define HW_USBHS_DEVICEADDR_SET(v) (HW_USBHS_DEVICEADDR_WR(HW_USBHS_DEVICEADDR_RD() |  (v)))
#define HW_USBHS_DEVICEADDR_CLR(v) (HW_USBHS_DEVICEADDR_WR(HW_USBHS_DEVICEADDR_RD() & ~(v)))
#define HW_USBHS_DEVICEADDR_TOG(v) (HW_USBHS_DEVICEADDR_WR(HW_USBHS_DEVICEADDR_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_DEVICEADDR bitfields
 */

/*!
 * @name Register USBHS_DEVICEADDR, field USBADRA[24] (RW)
 *
 * This field provides a mechanism for staging the device address in advance.
 * After the status phase of the SET_ADDRESS descriptor, the DCD has 2 ms to
 * program the USBADR field. This mechanism ensures this specification is met when the
 * DCD cannot write to the device address within 2 ms from the SET_ADDRESS status
 * phase. If the DCD writes the USBADR with USBADRA equaling 1 after the
 * SET_ADDRESS data phase (before the prime of the status phase), the USBADR is
 * programmed instantly at the correct time and meets the 2 ms USB requirement. Hardware
 * automatically clears this bit on the following conditions: IN is ACKed to
 * endpoint 0. (USBADR is updated from staging register.) OUT/SETUP occur to endpoint
 * 0. (USBADR is not updated.) Device Reset occurs. (USBADR is reset to 0.)
 *
 * Values:
 * - 0 - Writes to USBADR are instantaneous.
 * - 1 - When this bit is written to a 1 at the same time or before USBADR is
 *     written, the write to the USBADR field is staged and held in a hidden
 *     register. After an IN occurs on endpoint 0 and is ACKed, USBADR is loaded from
 *     the holding register.
 */
//@{
#define BP_USBHS_DEVICEADDR_USBADRA (24U)  //!< Bit position for USBHS_DEVICEADDR_USBADRA.
#define BM_USBHS_DEVICEADDR_USBADRA (0x01000000U) //!< Bit mask for USBHS_DEVICEADDR_USBADRA.
#define BS_USBHS_DEVICEADDR_USBADRA (1U)   //!< Bit field size in bits for USBHS_DEVICEADDR_USBADRA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_DEVICEADDR_USBADRA field.
#define BR_USBHS_DEVICEADDR_USBADRA (BITBAND_ACCESS32(HW_USBHS_DEVICEADDR_ADDR, BP_USBHS_DEVICEADDR_USBADRA))
#endif

//! @brief Format value for bitfield USBHS_DEVICEADDR_USBADRA.
#define BF_USBHS_DEVICEADDR_USBADRA(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_DEVICEADDR_USBADRA), uint32_t) & BM_USBHS_DEVICEADDR_USBADRA)

#ifndef __LANGUAGE_ASM__
//! @brief Set the USBADRA field to a new value.
#define BW_USBHS_DEVICEADDR_USBADRA(v) (BITBAND_ACCESS32(HW_USBHS_DEVICEADDR_ADDR, BP_USBHS_DEVICEADDR_USBADRA) = (v))
#endif
//@}

/*!
 * @name Register USBHS_DEVICEADDR, field USBADR[31:25] (RW)
 *
 * This field corresponds to the USB device address.
 */
//@{
#define BP_USBHS_DEVICEADDR_USBADR (25U)   //!< Bit position for USBHS_DEVICEADDR_USBADR.
#define BM_USBHS_DEVICEADDR_USBADR (0xFE000000U) //!< Bit mask for USBHS_DEVICEADDR_USBADR.
#define BS_USBHS_DEVICEADDR_USBADR (7U)    //!< Bit field size in bits for USBHS_DEVICEADDR_USBADR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_DEVICEADDR_USBADR field.
#define BR_USBHS_DEVICEADDR_USBADR (HW_USBHS_DEVICEADDR.B.USBADR)
#endif

//! @brief Format value for bitfield USBHS_DEVICEADDR_USBADR.
#define BF_USBHS_DEVICEADDR_USBADR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_DEVICEADDR_USBADR), uint32_t) & BM_USBHS_DEVICEADDR_USBADR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the USBADR field to a new value.
#define BW_USBHS_DEVICEADDR_USBADR(v) (HW_USBHS_DEVICEADDR_WR((HW_USBHS_DEVICEADDR_RD() & ~BM_USBHS_DEVICEADDR_USBADR) | BF_USBHS_DEVICEADDR_USBADR(v)))
#endif
//@}
//-------------------------------------------------------------------------------------------
// HW_USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_PERIODICLISTBASE - Periodic Frame List Base Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register contains the beginning address of the periodic frame list in
 * the system memory. The host controller driver loads this register prior to
 * starting the schedule execution by the controller. The memory structure referenced
 * by this physical memory pointer assumes to be 4-Kbyte aligned. The contents
 * combine with the FRINDEX register to enable the controller to step through the
 * periodic frame list in sequence. The host and device mode functions share this
 * register. In host mode, it is the PERIODICLISTBASE register; in device mode,
 * it is the DEVICEADDR register. See section "Device Address Register
 * (DEVICEADDR)," for more information.
 */
typedef union _hw_usbhs_periodiclistbase
{
    uint32_t U;
    struct _hw_usbhs_periodiclistbase_bitfields
    {
        uint32_t RESERVED0 : 12;       //!< [11:0] Reserved
        uint32_t PERBASE : 20;         //!< [31:12] Base address
    } B;
} hw_usbhs_periodiclistbase_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_PERIODICLISTBASE register
 */
//@{
#define HW_USBHS_PERIODICLISTBASE_ADDR (REGS_USBHS_BASE + 0x154U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_PERIODICLISTBASE (*(__IO hw_usbhs_periodiclistbase_t *) HW_USBHS_PERIODICLISTBASE_ADDR)
#define HW_USBHS_PERIODICLISTBASE_RD() (HW_USBHS_PERIODICLISTBASE.U)
#define HW_USBHS_PERIODICLISTBASE_WR(v) (HW_USBHS_PERIODICLISTBASE.U = (v))
#define HW_USBHS_PERIODICLISTBASE_SET(v) (HW_USBHS_PERIODICLISTBASE_WR(HW_USBHS_PERIODICLISTBASE_RD() |  (v)))
#define HW_USBHS_PERIODICLISTBASE_CLR(v) (HW_USBHS_PERIODICLISTBASE_WR(HW_USBHS_PERIODICLISTBASE_RD() & ~(v)))
#define HW_USBHS_PERIODICLISTBASE_TOG(v) (HW_USBHS_PERIODICLISTBASE_WR(HW_USBHS_PERIODICLISTBASE_RD() ^  (v)))
#endif
//@}

