ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_PERIODICLISTBASE bitfields
 */

/*!
 * @name Register USBHS_PERIODICLISTBASE, field PERBASE[31:12] (RW)
 *
 * These bits correspond to memory address signal [31:12]. Used only in the host
 * mode.
 */
//@{
#define BP_USBHS_PERIODICLISTBASE_PERBASE (12U) //!< Bit position for USBHS_PERIODICLISTBASE_PERBASE.
#define BM_USBHS_PERIODICLISTBASE_PERBASE (0xFFFFF000U) //!< Bit mask for USBHS_PERIODICLISTBASE_PERBASE.
#define BS_USBHS_PERIODICLISTBASE_PERBASE (20U) //!< Bit field size in bits for USBHS_PERIODICLISTBASE_PERBASE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PERIODICLISTBASE_PERBASE field.
#define BR_USBHS_PERIODICLISTBASE_PERBASE (HW_USBHS_PERIODICLISTBASE.B.PERBASE)
#endif

//! @brief Format value for bitfield USBHS_PERIODICLISTBASE_PERBASE.
#define BF_USBHS_PERIODICLISTBASE_PERBASE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PERIODICLISTBASE_PERBASE), uint32_t) & BM_USBHS_PERIODICLISTBASE_PERBASE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PERBASE field to a new value.
#define BW_USBHS_PERIODICLISTBASE_PERBASE(v) (HW_USBHS_PERIODICLISTBASE_WR((HW_USBHS_PERIODICLISTBASE_RD() & ~BM_USBHS_PERIODICLISTBASE_PERBASE) | BF_USBHS_PERIODICLISTBASE_PERBASE(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_ASYNCLISTADDR - Current Asynchronous List Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * The ASYNCLISTADDR register contains the address of the next asynchronous
 * queue head to executed by the host. The host and device mode functions share this
 * register. In host mode, it is the ASYNCLISTADDR register; in device mode, it
 * is the EPLISTADDR register. See section "Endpoint List Address Register
 * (EPLISTADDR)," for more information.
 */
typedef union _hw_usbhs_asynclistaddr
{
    uint32_t U;
    struct _hw_usbhs_asynclistaddr_bitfields
    {
        uint32_t RESERVED0 : 5;        //!< [4:0] Reserved
        uint32_t ASYBASE : 27;         //!< [31:5] Link pointer low (LPL)
    } B;
} hw_usbhs_asynclistaddr_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_ASYNCLISTADDR register
 */
//@{
#define HW_USBHS_ASYNCLISTADDR_ADDR (REGS_USBHS_BASE + 0x158U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_ASYNCLISTADDR   (*(__IO hw_usbhs_asynclistaddr_t *) HW_USBHS_ASYNCLISTADDR_ADDR)
#define HW_USBHS_ASYNCLISTADDR_RD() (HW_USBHS_ASYNCLISTADDR.U)
#define HW_USBHS_ASYNCLISTADDR_WR(v) (HW_USBHS_ASYNCLISTADDR.U = (v))
#define HW_USBHS_ASYNCLISTADDR_SET(v) (HW_USBHS_ASYNCLISTADDR_WR(HW_USBHS_ASYNCLISTADDR_RD() |  (v)))
#define HW_USBHS_ASYNCLISTADDR_CLR(v) (HW_USBHS_ASYNCLISTADDR_WR(HW_USBHS_ASYNCLISTADDR_RD() & ~(v)))
#define HW_USBHS_ASYNCLISTADDR_TOG(v) (HW_USBHS_ASYNCLISTADDR_WR(HW_USBHS_ASYNCLISTADDR_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_ASYNCLISTADDR bitfields
 */

/*!
 * @name Register USBHS_ASYNCLISTADDR, field ASYBASE[31:5] (RW)
 *
 * These bits correspond to memory address signal [31:5]. This field may only
 * reference a queue head (QH). Used only in host mode.
 */
//@{
#define BP_USBHS_ASYNCLISTADDR_ASYBASE (5U) //!< Bit position for USBHS_ASYNCLISTADDR_ASYBASE.
#define BM_USBHS_ASYNCLISTADDR_ASYBASE (0xFFFFFFE0U) //!< Bit mask for USBHS_ASYNCLISTADDR_ASYBASE.
#define BS_USBHS_ASYNCLISTADDR_ASYBASE (27U) //!< Bit field size in bits for USBHS_ASYNCLISTADDR_ASYBASE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ASYNCLISTADDR_ASYBASE field.
#define BR_USBHS_ASYNCLISTADDR_ASYBASE (HW_USBHS_ASYNCLISTADDR.B.ASYBASE)
#endif

//! @brief Format value for bitfield USBHS_ASYNCLISTADDR_ASYBASE.
#define BF_USBHS_ASYNCLISTADDR_ASYBASE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ASYNCLISTADDR_ASYBASE), uint32_t) & BM_USBHS_ASYNCLISTADDR_ASYBASE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ASYBASE field to a new value.
#define BW_USBHS_ASYNCLISTADDR_ASYBASE(v) (HW_USBHS_ASYNCLISTADDR_WR((HW_USBHS_ASYNCLISTADDR_RD() & ~BM_USBHS_ASYNCLISTADDR_ASYBASE) | BF_USBHS_ASYNCLISTADDR_ASYBASE(v)))
#endif
//@}
//-------------------------------------------------------------------------------------------
// HW_USBHS_EPLISTADDR - Endpoint List Address Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPLISTADDR - Endpoint List Address Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. For device mode, this
 * register contains the address of the endpoint list top in system memory. The
 * memory structure referenced by this physical memory pointer assumes to be
 * 64-bytes. The queue head is actually a 48-byte structure, but must be aligned on
 * 64-byte boundary. However, the EPBASE field has a granularity of 2 Kbytes; in
 * practice, the queue head should be 2-Kbyte aligned. The host and device mode
 * functions share this register. In device mode, it is the EPLISTADDR register; in
 * host mode, it is the ASYNCLISTADDR register. See section "Current
 * Asynchronous List Address Register (ASYNCLISTADDR)," for more information.
 */
typedef union _hw_usbhs_eplistaddr
{
    uint32_t U;
    struct _hw_usbhs_eplistaddr_bitfields
    {
        uint32_t RESERVED0 : 11;       //!< [10:0] Reserved
        uint32_t EPBASE : 21;          //!< [31:11] Endpoint list address
    } B;
} hw_usbhs_eplistaddr_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPLISTADDR register
 */
//@{
#define HW_USBHS_EPLISTADDR_ADDR (REGS_USBHS_BASE + 0x158U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPLISTADDR      (*(__IO hw_usbhs_eplistaddr_t *) HW_USBHS_EPLISTADDR_ADDR)
#define HW_USBHS_EPLISTADDR_RD() (HW_USBHS_EPLISTADDR.U)
#define HW_USBHS_EPLISTADDR_WR(v) (HW_USBHS_EPLISTADDR.U = (v))
#define HW_USBHS_EPLISTADDR_SET(v) (HW_USBHS_EPLISTADDR_WR(HW_USBHS_EPLISTADDR_RD() |  (v)))
#define HW_USBHS_EPLISTADDR_CLR(v) (HW_USBHS_EPLISTADDR_WR(HW_USBHS_EPLISTADDR_RD() & ~(v)))
#define HW_USBHS_EPLISTADDR_TOG(v) (HW_USBHS_EPLISTADDR_WR(HW_USBHS_EPLISTADDR_RD() ^  (v)))
#endif
//@}

