ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_EPLISTADDR bitfields
 */

/*!
 * @name Register USBHS_EPLISTADDR, field EPBASE[31:11] (RW)
 *
 * Correspond to memory address signals [31:11] References a list of up to 32
 * queue heads (i.e. one queue head per endpoint and direction). Address of the top
 * of the endpoint list.
 */
//@{
#define BP_USBHS_EPLISTADDR_EPBASE (11U)   //!< Bit position for USBHS_EPLISTADDR_EPBASE.
#define BM_USBHS_EPLISTADDR_EPBASE (0xFFFFF800U) //!< Bit mask for USBHS_EPLISTADDR_EPBASE.
#define BS_USBHS_EPLISTADDR_EPBASE (21U)   //!< Bit field size in bits for USBHS_EPLISTADDR_EPBASE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPLISTADDR_EPBASE field.
#define BR_USBHS_EPLISTADDR_EPBASE (HW_USBHS_EPLISTADDR.B.EPBASE)
#endif

//! @brief Format value for bitfield USBHS_EPLISTADDR_EPBASE.
#define BF_USBHS_EPLISTADDR_EPBASE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPLISTADDR_EPBASE), uint32_t) & BM_USBHS_EPLISTADDR_EPBASE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the EPBASE field to a new value.
#define BW_USBHS_EPLISTADDR_EPBASE(v) (HW_USBHS_EPLISTADDR_WR((HW_USBHS_EPLISTADDR_RD() & ~BM_USBHS_EPLISTADDR_EPBASE) | BF_USBHS_EPLISTADDR_EPBASE(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_TTCTRL - Host TT Asynchronous Buffer Control
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_TTCTRL - Host TT Asynchronous Buffer Control (RO)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_usbhs_ttctrl
{
    uint32_t U;
    struct _hw_usbhs_ttctrl_bitfields
    {
        uint32_t RESERVED0 : 24;       //!< [23:0] Reserved
        uint32_t TTHA : 7;             //!< [30:24] TT Hub Address
        uint32_t Reerved : 1;          //!< [31] Reserved
    } B;
} hw_usbhs_ttctrl_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_TTCTRL register
 */
//@{
#define HW_USBHS_TTCTRL_ADDR     (REGS_USBHS_BASE + 0x15CU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_TTCTRL          (*(__I hw_usbhs_ttctrl_t *) HW_USBHS_TTCTRL_ADDR)
#define HW_USBHS_TTCTRL_RD()     (HW_USBHS_TTCTRL.U)
#endif
//@}

/*
 * Constants & macros for individual USBHS_TTCTRL bitfields
 */

/*!
 * @name Register USBHS_TTCTRL, field TTHA[30:24] (RO)
 *
 * This field is used to match against the Hub Address field in a QH or siTD to
 * determine if the packet is routed to the internal TT for directly attached
 * FS/LS devices. If the hub address in the QH or siTD does not match this address
 * then the packet is broadcast on the high speed ports destined for a downstream
 * HS hub with the address in the QH or siTD.
 */
//@{
#define BP_USBHS_TTCTRL_TTHA (24U)         //!< Bit position for USBHS_TTCTRL_TTHA.
#define BM_USBHS_TTCTRL_TTHA (0x7F000000U) //!< Bit mask for USBHS_TTCTRL_TTHA.
#define BS_USBHS_TTCTRL_TTHA (7U)          //!< Bit field size in bits for USBHS_TTCTRL_TTHA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_TTCTRL_TTHA field.
#define BR_USBHS_TTCTRL_TTHA (HW_USBHS_TTCTRL.B.TTHA)
#endif
//@}

/*!
 * @name Register USBHS_TTCTRL, field Reerved[31] (ROZ)
 *
 * Must ne cleared.
 */
//@{
#define BP_USBHS_TTCTRL_Reerved (31U)      //!< Bit position for USBHS_TTCTRL_Reerved.
#define BM_USBHS_TTCTRL_Reerved (0x80000000U) //!< Bit mask for USBHS_TTCTRL_Reerved.
#define BS_USBHS_TTCTRL_Reerved (1U)       //!< Bit field size in bits for USBHS_TTCTRL_Reerved.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_TTCTRL_Reerved field.
#define BR_USBHS_TTCTRL_Reerved (BITBAND_ACCESS32(HW_USBHS_TTCTRL_ADDR, BP_USBHS_TTCTRL_Reerved))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_BURSTSIZE - Master Interface Data Burst Size Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_BURSTSIZE - Master Interface Data Burst Size Register (RW)
 *
 * Reset value: 0x00008080U
 *
 * This register is not defined in the EHCI specification. BURSTSIZE dynamically
 * controls the burst size during data movement on the initiator (master)
 * interface.
 */
typedef union _hw_usbhs_burstsize
{
    uint32_t U;
    struct _hw_usbhs_burstsize_bitfields
    {
        uint32_t RXPBURST : 8;         //!< [7:0] Programable RX Burst length
        uint32_t TXPBURST : 8;         //!< [15:8] Programable TX Burst length
        uint32_t RESERVED0 : 16;       //!< [31:16] Reserved
    } B;
} hw_usbhs_burstsize_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_BURSTSIZE register
 */
//@{
#define HW_USBHS_BURSTSIZE_ADDR  (REGS_USBHS_BASE + 0x160U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_BURSTSIZE       (*(__IO hw_usbhs_burstsize_t *) HW_USBHS_BURSTSIZE_ADDR)
#define HW_USBHS_BURSTSIZE_RD()  (HW_USBHS_BURSTSIZE.U)
#define HW_USBHS_BURSTSIZE_WR(v) (HW_USBHS_BURSTSIZE.U = (v))
#define HW_USBHS_BURSTSIZE_SET(v) (HW_USBHS_BURSTSIZE_WR(HW_USBHS_BURSTSIZE_RD() |  (v)))
#define HW_USBHS_BURSTSIZE_CLR(v) (HW_USBHS_BURSTSIZE_WR(HW_USBHS_BURSTSIZE_RD() & ~(v)))
#define HW_USBHS_BURSTSIZE_TOG(v) (HW_USBHS_BURSTSIZE_WR(HW_USBHS_BURSTSIZE_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_BURSTSIZE bitfields
 */

/*!
 * @name Register USBHS_BURSTSIZE, field RXPBURST[7:0] (RW)
 *
 * This register represents the maximum length of a burst in 32-bit words while
 * moving data from the USB bus to system memory. Must not be set to greater than
 * 16. If the BURSTSIZE field of register SBUSCFG is non-zero, the RXPBURST
 * field returns the value of the INCRx length.
 */
//@{
#define BP_USBHS_BURSTSIZE_RXPBURST (0U)   //!< Bit position for USBHS_BURSTSIZE_RXPBURST.
#define BM_USBHS_BURSTSIZE_RXPBURST (0x000000FFU) //!< Bit mask for USBHS_BURSTSIZE_RXPBURST.
#define BS_USBHS_BURSTSIZE_RXPBURST (8U)   //!< Bit field size in bits for USBHS_BURSTSIZE_RXPBURST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_BURSTSIZE_RXPBURST field.
#define BR_USBHS_BURSTSIZE_RXPBURST (HW_USBHS_BURSTSIZE.B.RXPBURST)
#endif

