ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_BURSTSIZE_RXPBURST.
#define BF_USBHS_BURSTSIZE_RXPBURST(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_BURSTSIZE_RXPBURST), uint32_t) & BM_USBHS_BURSTSIZE_RXPBURST)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXPBURST field to a new value.
#define BW_USBHS_BURSTSIZE_RXPBURST(v) (HW_USBHS_BURSTSIZE_WR((HW_USBHS_BURSTSIZE_RD() & ~BM_USBHS_BURSTSIZE_RXPBURST) | BF_USBHS_BURSTSIZE_RXPBURST(v)))
#endif
//@}

/*!
 * @name Register USBHS_BURSTSIZE, field TXPBURST[15:8] (RW)
 *
 * Represents the maximum length of a burst in 32-bit words while moving data
 * from system memory to the USB bus. Must not be set to greater than 16. If the
 * BURSTSIZE field of register SBUSCFG is non-zero, the TXPBURST field returns the
 * value of the INCRx length.
 */
//@{
#define BP_USBHS_BURSTSIZE_TXPBURST (8U)   //!< Bit position for USBHS_BURSTSIZE_TXPBURST.
#define BM_USBHS_BURSTSIZE_TXPBURST (0x0000FF00U) //!< Bit mask for USBHS_BURSTSIZE_TXPBURST.
#define BS_USBHS_BURSTSIZE_TXPBURST (8U)   //!< Bit field size in bits for USBHS_BURSTSIZE_TXPBURST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_BURSTSIZE_TXPBURST field.
#define BR_USBHS_BURSTSIZE_TXPBURST (HW_USBHS_BURSTSIZE.B.TXPBURST)
#endif

//! @brief Format value for bitfield USBHS_BURSTSIZE_TXPBURST.
#define BF_USBHS_BURSTSIZE_TXPBURST(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_BURSTSIZE_TXPBURST), uint32_t) & BM_USBHS_BURSTSIZE_TXPBURST)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXPBURST field to a new value.
#define BW_USBHS_BURSTSIZE_TXPBURST(v) (HW_USBHS_BURSTSIZE_WR((HW_USBHS_BURSTSIZE_RD() & ~BM_USBHS_BURSTSIZE_TXPBURST) | BF_USBHS_BURSTSIZE_TXPBURST(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_TXFILLTUNING - Transmit FIFO Tuning Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. The TXFILLTUNING
 * register controls performance tuning associated with how the module posts data to
 * the TX latency FIFO before moving the data onto the USB bus. The specific
 * areas of performance include how much data to post into the FIFO and an estimate
 * for how long that operation takes in the target system. Definitions: T 0 =
 * Standard packet overhead T 1 = Time to send data payload T s = Total packet flight
 * time (send-only) packet (T s = T 0 + T 1 ) T ff Time to fetch packet into TX
 * FIFO up to specified level T p Total packet time (fetch and send) packet (T p
 * = T ff + T s ) Upon discovery of a transmit (OUT/SETUP) packet in the data
 * structures, the host controller checks to ensure T p remains before the end of
 * the (micro)frame. If so, it pre-fills the TX FIFO. If at anytime during the
 * pre-fill operation the time remaining the (micro)frame is less than T s , packet
 * attempt ceases and tries at a later time. Although this is not an error
 * condition and the module eventually recovers, a mark is made in the scheduler health
 * counter to mark the occurrence of a back-off event. When a back-off event is
 * detected, the partial packet fetched may need to be discarded from the latency
 * buffer to make room for periodic traffic beginning after the next SOF. Too
 * many back-off events can waste bandwidth and power on the system bus and should
 * be minimized (not necessarily eliminated). The TSCHHEALTH (T ff) parameter
 * described below can minimize back-offs.
 */
typedef union _hw_usbhs_txfilltuning
{
    uint32_t U;
    struct _hw_usbhs_txfilltuning_bitfields
    {
        uint32_t TXSCHOH : 7;          //!< [6:0] Scheduler Overhead
        uint32_t RESERVED0 : 1;        //!< [7] Reserved
        uint32_t TXSCHHEALTH : 5;      //!< [12:8] Scheduler Health counter
        uint32_t RESERVED1 : 3;        //!< [15:13] Reserved
        uint32_t TXFIFOTHRES : 6;      //!< [21:16] FIFO burst Threshold
        uint32_t RESERVED2 : 10;       //!< [31:22] Reserved
    } B;
} hw_usbhs_txfilltuning_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_TXFILLTUNING register
 */
//@{
#define HW_USBHS_TXFILLTUNING_ADDR (REGS_USBHS_BASE + 0x164U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_TXFILLTUNING    (*(__IO hw_usbhs_txfilltuning_t *) HW_USBHS_TXFILLTUNING_ADDR)
#define HW_USBHS_TXFILLTUNING_RD() (HW_USBHS_TXFILLTUNING.U)
#define HW_USBHS_TXFILLTUNING_WR(v) (HW_USBHS_TXFILLTUNING.U = (v))
#define HW_USBHS_TXFILLTUNING_SET(v) (HW_USBHS_TXFILLTUNING_WR(HW_USBHS_TXFILLTUNING_RD() |  (v)))
#define HW_USBHS_TXFILLTUNING_CLR(v) (HW_USBHS_TXFILLTUNING_WR(HW_USBHS_TXFILLTUNING_RD() & ~(v)))
#define HW_USBHS_TXFILLTUNING_TOG(v) (HW_USBHS_TXFILLTUNING_WR(HW_USBHS_TXFILLTUNING_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_TXFILLTUNING bitfields
 */

/*!
 * @name Register USBHS_TXFILLTUNING, field TXSCHOH[6:0] (RW)
 *
 * These bits add an additional fixed offset to the schedule time estimator
 * described as T ff . As an approximation, the value chosen for this register should
 * limit the number of back-off events captured in the TXSCHHEALTH field to less
 * than 10 per second in a highly utilized bus. Choosing a value too high for
 * this register is not desired as it can needlessly reduce USB utilization. The
 * time unit represented in this register is 1.267 ms when a device connects in
 * high-speed mode. The time unit represented in this register is 6.333 ms when a
 * device connects in low-/full-speed mode. For most applications, TXSCHOH can be
 * set to 4 or less. A good value to begin with is: (TXFIFOTHRES x BURSTSIZE x 4)
 * / (40 x TimeUnit) Always rounded to the next higher integer. TimeUnit is 1.267
 * or 6.333 as noted earlier in this description. For example, if TXFIFOTHRES is
 * 5 and BURSTSIZE is 8, set TXSCHOH to 5¥(8¥4)/(40¥1.267) equals 4 for a
 * high-speed link. If this value of TXSCHOH results in a TXSCHHEALTH count of 0 per
 * second, low the value by 1 if optimizing performance is desired. If
 * TXSCHHEALTH exceeds 10 per second, raise the value by 1. If streaming mode is disabled
 * via the USBMODE register, treat TXFIFOTHRES as the maximum value for purposes
 * of the TXSCHOH calculation.
 */
//@{
#define BP_USBHS_TXFILLTUNING_TXSCHOH (0U) //!< Bit position for USBHS_TXFILLTUNING_TXSCHOH.
#define BM_USBHS_TXFILLTUNING_TXSCHOH (0x0000007FU) //!< Bit mask for USBHS_TXFILLTUNING_TXSCHOH.
#define BS_USBHS_TXFILLTUNING_TXSCHOH (7U) //!< Bit field size in bits for USBHS_TXFILLTUNING_TXSCHOH.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_TXFILLTUNING_TXSCHOH field.
#define BR_USBHS_TXFILLTUNING_TXSCHOH (HW_USBHS_TXFILLTUNING.B.TXSCHOH)
#endif

//! @brief Format value for bitfield USBHS_TXFILLTUNING_TXSCHOH.
#define BF_USBHS_TXFILLTUNING_TXSCHOH(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_TXFILLTUNING_TXSCHOH), uint32_t) & BM_USBHS_TXFILLTUNING_TXSCHOH)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXSCHOH field to a new value.
#define BW_USBHS_TXFILLTUNING_TXSCHOH(v) (HW_USBHS_TXFILLTUNING_WR((HW_USBHS_TXFILLTUNING_RD() & ~BM_USBHS_TXFILLTUNING_TXSCHOH) | BF_USBHS_TXFILLTUNING_TXSCHOH(v)))
#endif
//@}

/*!
 * @name Register USBHS_TXFILLTUNING, field TXSCHHEALTH[12:8] (RW)
 *
 * These bits increment when the host controller fails to fill the TX latency
 * FIFO to the level programmed by TXFIFOTHRES before running out of time to send
 * the packet before the next SOF. This health counter measures the number of
 * times this occurs to provide feedback to selecting a proper TXSCHOH. Writing to
 * this register clears the counter and this counter stops counting after reaching
 * the maximum of 31.
 */
//@{
#define BP_USBHS_TXFILLTUNING_TXSCHHEALTH (8U) //!< Bit position for USBHS_TXFILLTUNING_TXSCHHEALTH.
#define BM_USBHS_TXFILLTUNING_TXSCHHEALTH (0x00001F00U) //!< Bit mask for USBHS_TXFILLTUNING_TXSCHHEALTH.
#define BS_USBHS_TXFILLTUNING_TXSCHHEALTH (5U) //!< Bit field size in bits for USBHS_TXFILLTUNING_TXSCHHEALTH.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_TXFILLTUNING_TXSCHHEALTH field.
#define BR_USBHS_TXFILLTUNING_TXSCHHEALTH (HW_USBHS_TXFILLTUNING.B.TXSCHHEALTH)
#endif

//! @brief Format value for bitfield USBHS_TXFILLTUNING_TXSCHHEALTH.
#define BF_USBHS_TXFILLTUNING_TXSCHHEALTH(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_TXFILLTUNING_TXSCHHEALTH), uint32_t) & BM_USBHS_TXFILLTUNING_TXSCHHEALTH)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXSCHHEALTH field to a new value.
#define BW_USBHS_TXFILLTUNING_TXSCHHEALTH(v) (HW_USBHS_TXFILLTUNING_WR((HW_USBHS_TXFILLTUNING_RD() & ~BM_USBHS_TXFILLTUNING_TXSCHHEALTH) | BF_USBHS_TXFILLTUNING_TXSCHHEALTH(v)))
#endif
//@}

/*!
 * @name Register USBHS_TXFILLTUNING, field TXFIFOTHRES[21:16] (RW)
 *
 * FIFO burst threshold. Controls the number of data bursts that are posted to
 * the TX latency FIFO in host mode before the packet begins on the bus. The
 * minimum value is 2 and this value should be as low as possible to maximize USB
 * performance. Systems with unpredictable latency and/or insufficient bandwidth can
 * use a higher value where the FIFO may underrun because the data transferred
 * from the latency FIFO to USB occurs before it can replenish from system memory.
 * This value is ignored if the USBMODE[SDIS] bit is set. When the USBMODE[SDIS]
 * bit is set, the host controller behaves as if TXFIFOTHRES is set to its
 * maximum value.
 */
//@{
#define BP_USBHS_TXFILLTUNING_TXFIFOTHRES (16U) //!< Bit position for USBHS_TXFILLTUNING_TXFIFOTHRES.
#define BM_USBHS_TXFILLTUNING_TXFIFOTHRES (0x003F0000U) //!< Bit mask for USBHS_TXFILLTUNING_TXFIFOTHRES.
#define BS_USBHS_TXFILLTUNING_TXFIFOTHRES (6U) //!< Bit field size in bits for USBHS_TXFILLTUNING_TXFIFOTHRES.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_TXFILLTUNING_TXFIFOTHRES field.
#define BR_USBHS_TXFILLTUNING_TXFIFOTHRES (HW_USBHS_TXFILLTUNING.B.TXFIFOTHRES)
#endif

//! @brief Format value for bitfield USBHS_TXFILLTUNING_TXFIFOTHRES.
#define BF_USBHS_TXFILLTUNING_TXFIFOTHRES(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_TXFILLTUNING_TXFIFOTHRES), uint32_t) & BM_USBHS_TXFILLTUNING_TXFIFOTHRES)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXFIFOTHRES field to a new value.
#define BW_USBHS_TXFILLTUNING_TXFIFOTHRES(v) (HW_USBHS_TXFILLTUNING_WR((HW_USBHS_TXFILLTUNING_RD() & ~BM_USBHS_TXFILLTUNING_TXFIFOTHRES) | BF_USBHS_TXFILLTUNING_TXFIFOTHRES(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_ULPI_VIEWPORT - ULPI Register Access
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_ULPI_VIEWPORT - ULPI Register Access (RW)
 *
 * Reset value: 0x00000000U
 *
 * The register provides indirect access to the ULPI PHY register set. Although
 * the controller modules perform access to the ULPI PHY register set, there may
 * be circumstances where software may need direct access. Be advised that writes
 * to the ULPI through the ULPI viewport can substantially harm standard USB
 * operations. Currently no usage model has been defined where software should need
 * to execute writes directly to the ULPI. Executing read operations though the
 * ULPI viewport should have no harmful side effects to standard USB operations.
 * Also, if the ULPI interface is not enabled, this register is always read
 * cleared. There are two operations that can be performed with the ULPI viewport,
 * wake-up and read/write operations. The wake-up operation is used to put the ULPI
 * interface into normal operation mode and re-enable the clock if necessary. A
 * wake-up operation is required before accessing the registers when the ULPI
 * interface is operating in low power mode, serial mode, or carkit mode. The ULPI
 * state can be determined by reading the sync state bit (ULPI_SS). If this bit is
 * set, then the ULPI interface is running in normal operating mode and can accept
 * read/write operations. If ULPI_SS is cleared, then read/write operations are
 * not executed. Undefined behavior results if a read or write operation is
 * performed when ULPI_SS is cleared. To execute a wake-up operation, write all
 * 32-bits of the ULPI VIEWPORT where ULPI_PORT is constructed appropriately and the
 * ULPI_WU bit is set and the ULPI_RUN bit is cleared. Poll the ULPI VIEWPORT until
 * ULPI_WU is cleared for the operation to complete. To execute a read or write
 * operation, write all 32-bits of the ULPI VIEWPORT where ULPI_DATWR, ULPI_ADDR,
 * ULPI_PORT, ULPI_RW are constructed appropriately and the ULPI_RUN bit is set.
 * Poll the ULPI VIEWPORT until ULPI_RUN is cleared for the operation to
 * complete. For read operations, ULPI_DATRD is valid after ULPI_RUN is cleared. The
 * polling method above can be replaced with interrupts using the ULPI interrupt
 * defined in the USBSTS and USBINTR registers. When a wake-up or read/write
 * operation completes, the ULPI interrupt is set.
 */
typedef union _hw_usbhs_ulpi_viewport
{
    uint32_t U;
    struct _hw_usbhs_ulpi_viewport_bitfields
    {
        uint32_t ULPI_DATWR : 8;       //!< [7:0] ULPI Data Write
        uint32_t ULPI_DATRD : 8;       //!< [15:8] ULPI Data Read
        uint32_t ULPI_ADDR : 8;        //!< [23:16] ULPI data Address
        uint32_t ULPI_PORT : 3;        //!< [26:24] ULPI Port number
        uint32_t ULPI_SS : 1;          //!< [27] ULPI Sync State
        uint32_t RESERVED0 : 1;        //!< [28] Reserved
        uint32_t ULPI_RW : 1;          //!< [29] ULPI Read/Write
        uint32_t ULPI_RUN : 1;         //!< [30] ULPI Run
        uint32_t ULPI_WU : 1;          //!< [31] ULPI Wake-Up
    } B;
} hw_usbhs_ulpi_viewport_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_ULPI_VIEWPORT register
 */
//@{
#define HW_USBHS_ULPI_VIEWPORT_ADDR (REGS_USBHS_BASE + 0x170U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_ULPI_VIEWPORT   (*(__IO hw_usbhs_ulpi_viewport_t *) HW_USBHS_ULPI_VIEWPORT_ADDR)
#define HW_USBHS_ULPI_VIEWPORT_RD() (HW_USBHS_ULPI_VIEWPORT.U)
#define HW_USBHS_ULPI_VIEWPORT_WR(v) (HW_USBHS_ULPI_VIEWPORT.U = (v))
#define HW_USBHS_ULPI_VIEWPORT_SET(v) (HW_USBHS_ULPI_VIEWPORT_WR(HW_USBHS_ULPI_VIEWPORT_RD() |  (v)))
#define HW_USBHS_ULPI_VIEWPORT_CLR(v) (HW_USBHS_ULPI_VIEWPORT_WR(HW_USBHS_ULPI_VIEWPORT_RD() & ~(v)))
#define HW_USBHS_ULPI_VIEWPORT_TOG(v) (HW_USBHS_ULPI_VIEWPORT_WR(HW_USBHS_ULPI_VIEWPORT_RD() ^  (v)))
#endif
//@}

