ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_ULPI_VIEWPORT bitfields
 */

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_DATWR[7:0] (RW)
 *
 * When a write operation is commanded, the data to be sent is written to this
 * field.
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_DATWR (0U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_DATWR.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_DATWR (0x000000FFU) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_DATWR.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_DATWR (8U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_DATWR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_DATWR field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_DATWR (HW_USBHS_ULPI_VIEWPORT.B.ULPI_DATWR)
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_DATWR.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_DATWR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_DATWR), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_DATWR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_DATWR field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_DATWR(v) (HW_USBHS_ULPI_VIEWPORT_WR((HW_USBHS_ULPI_VIEWPORT_RD() & ~BM_USBHS_ULPI_VIEWPORT_ULPI_DATWR) | BF_USBHS_ULPI_VIEWPORT_ULPI_DATWR(v)))
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_DATRD[15:8] (RO)
 *
 * After a read operation completes, the result is placed in this field.
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_DATRD (8U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_DATRD.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_DATRD (0x0000FF00U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_DATRD.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_DATRD (8U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_DATRD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_DATRD field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_DATRD (HW_USBHS_ULPI_VIEWPORT.B.ULPI_DATRD)
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_ADDR[23:16] (RW)
 *
 * When a read or write operation is commanded, the address of the operation is
 * written to this field.
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_ADDR (16U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_ADDR.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_ADDR (0x00FF0000U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_ADDR.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_ADDR (8U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_ADDR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_ADDR field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_ADDR (HW_USBHS_ULPI_VIEWPORT.B.ULPI_ADDR)
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_ADDR.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_ADDR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_ADDR), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_ADDR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_ADDR field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_ADDR(v) (HW_USBHS_ULPI_VIEWPORT_WR((HW_USBHS_ULPI_VIEWPORT_RD() & ~BM_USBHS_ULPI_VIEWPORT_ULPI_ADDR) | BF_USBHS_ULPI_VIEWPORT_ULPI_ADDR(v)))
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_PORT[26:24] (RW)
 *
 * For wake-up or read/write operations this value selects the port number to
 * which the ULPI PHY is attached. Valid values are 0 and 1.
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_PORT (24U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_PORT.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_PORT (0x07000000U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_PORT.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_PORT (3U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_PORT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_PORT field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_PORT (HW_USBHS_ULPI_VIEWPORT.B.ULPI_PORT)
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_PORT.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_PORT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_PORT), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_PORT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_PORT field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_PORT(v) (HW_USBHS_ULPI_VIEWPORT_WR((HW_USBHS_ULPI_VIEWPORT_RD() & ~BM_USBHS_ULPI_VIEWPORT_ULPI_PORT) | BF_USBHS_ULPI_VIEWPORT_ULPI_PORT(v)))
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_SS[27] (RW)
 *
 * Represents the state of the ULPI interface. Before reading this bit, the
 * ULPI_PORT field should be set accordingly if used with the multi-port host.
 * Otherwise, this field should always remain 0.
 *
 * Values:
 * - 0 - Any other state (that is, carkit, serial, low power)
 * - 1 - Normal sync state
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_SS (27U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_SS.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_SS (0x08000000U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_SS.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_SS (1U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_SS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_SS field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_SS (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_SS))
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_SS.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_SS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_SS), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_SS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_SS field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_SS(v) (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_SS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_RW[29] (RW)
 *
 * Selects between running a read or write operation to the ULPI.
 *
 * Values:
 * - 0 - Read
 * - 1 - Write
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_RW (29U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_RW.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_RW (0x20000000U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_RW.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_RW (1U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_RW.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_RW field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_RW (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_RW))
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_RW.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_RW(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_RW), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_RW)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_RW field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_RW(v) (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_RW) = (v))
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_RUN[30] (RW)
 *
 * Setting this bit begins a read/write operation. This bit automatically clears
 * after the read/write is complete. After this bit is set, it can not be
 * cleared by software. The driver must never execute a wake-up and a read/write
 * operation at the same time.
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_RUN (30U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_RUN.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_RUN (0x40000000U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_RUN.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_RUN (1U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_RUN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_RUN field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_RUN (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_RUN))
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_RUN.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_RUN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_RUN), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_RUN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_RUN field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_RUN(v) (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_RUN) = (v))
#endif
//@}

/*!
 * @name Register USBHS_ULPI_VIEWPORT, field ULPI_WU[31] (RW)
 *
 * Setting this bit begins the wake-up operation. This bit automatically clears
 * after the wake-up is complete. After this bit is set, it can not be cleared by
 * software. The driver must never execute a wake-up and a read/write operation
 * at the same time.
 */
//@{
#define BP_USBHS_ULPI_VIEWPORT_ULPI_WU (31U) //!< Bit position for USBHS_ULPI_VIEWPORT_ULPI_WU.
#define BM_USBHS_ULPI_VIEWPORT_ULPI_WU (0x80000000U) //!< Bit mask for USBHS_ULPI_VIEWPORT_ULPI_WU.
#define BS_USBHS_ULPI_VIEWPORT_ULPI_WU (1U) //!< Bit field size in bits for USBHS_ULPI_VIEWPORT_ULPI_WU.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ULPI_VIEWPORT_ULPI_WU field.
#define BR_USBHS_ULPI_VIEWPORT_ULPI_WU (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_WU))
#endif

//! @brief Format value for bitfield USBHS_ULPI_VIEWPORT_ULPI_WU.
#define BF_USBHS_ULPI_VIEWPORT_ULPI_WU(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ULPI_VIEWPORT_ULPI_WU), uint32_t) & BM_USBHS_ULPI_VIEWPORT_ULPI_WU)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ULPI_WU field to a new value.
#define BW_USBHS_ULPI_VIEWPORT_ULPI_WU(v) (BITBAND_ACCESS32(HW_USBHS_ULPI_VIEWPORT_ADDR, BP_USBHS_ULPI_VIEWPORT_ULPI_WU) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_ENDPTNAK - Endpoint NAK Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_ENDPTNAK - Endpoint NAK Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_usbhs_endptnak
{
    uint32_t U;
    struct _hw_usbhs_endptnak_bitfields
    {
        uint32_t EPRN : 4;             //!< [3:0] RX Endpoint NAK
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t EPTN : 4;             //!< [19:16] TX Endpoint NAK
        uint32_t RESERVED1 : 12;       //!< [31:20] Reserved
    } B;
} hw_usbhs_endptnak_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_ENDPTNAK register
 */
//@{
#define HW_USBHS_ENDPTNAK_ADDR   (REGS_USBHS_BASE + 0x178U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_ENDPTNAK        (*(__IO hw_usbhs_endptnak_t *) HW_USBHS_ENDPTNAK_ADDR)
#define HW_USBHS_ENDPTNAK_RD()   (HW_USBHS_ENDPTNAK.U)
#define HW_USBHS_ENDPTNAK_WR(v)  (HW_USBHS_ENDPTNAK.U = (v))
#define HW_USBHS_ENDPTNAK_SET(v) (HW_USBHS_ENDPTNAK_WR(HW_USBHS_ENDPTNAK_RD() |  (v)))
#define HW_USBHS_ENDPTNAK_CLR(v) (HW_USBHS_ENDPTNAK_WR(HW_USBHS_ENDPTNAK_RD() & ~(v)))
#define HW_USBHS_ENDPTNAK_TOG(v) (HW_USBHS_ENDPTNAK_WR(HW_USBHS_ENDPTNAK_RD() ^  (v)))
#endif
//@}

