ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_ENDPTNAK bitfields
 */

/*!
 * @name Register USBHS_ENDPTNAK, field EPRN[3:0] (W1C)
 *
 * Each RX endpoint has 1 bit in this field. The bit is set when the device
 * sends a NAK handshake on a received OUT or PING token for the corresponding
 * endpoint. EPRN[3]-Endpoint #3 EPRN[2]-Endpoint #2 EPRN[1]-Endpoint #1
 * EPRN[0]-Endpoint #0
 */
//@{
#define BP_USBHS_ENDPTNAK_EPRN (0U)        //!< Bit position for USBHS_ENDPTNAK_EPRN.
#define BM_USBHS_ENDPTNAK_EPRN (0x0000000FU) //!< Bit mask for USBHS_ENDPTNAK_EPRN.
#define BS_USBHS_ENDPTNAK_EPRN (4U)        //!< Bit field size in bits for USBHS_ENDPTNAK_EPRN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ENDPTNAK_EPRN field.
#define BR_USBHS_ENDPTNAK_EPRN (HW_USBHS_ENDPTNAK.B.EPRN)
#endif

//! @brief Format value for bitfield USBHS_ENDPTNAK_EPRN.
#define BF_USBHS_ENDPTNAK_EPRN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ENDPTNAK_EPRN), uint32_t) & BM_USBHS_ENDPTNAK_EPRN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the EPRN field to a new value.
#define BW_USBHS_ENDPTNAK_EPRN(v) (HW_USBHS_ENDPTNAK_WR((HW_USBHS_ENDPTNAK_RD() & ~BM_USBHS_ENDPTNAK_EPRN) | BF_USBHS_ENDPTNAK_EPRN(v)))
#endif
//@}

/*!
 * @name Register USBHS_ENDPTNAK, field EPTN[19:16] (W1C)
 *
 * Each TX endpoint has 1 bit in this field. The bit is set when the device
 * sends a NAK handshake on a received IN token for the corresponding endpoint.
 * EPTN[3]-Endpoint #3 EPTN[2]-Endpoint #2 EPTN[1]-Endpoint #1 EPTN[0]-Endpoint #0
 */
//@{
#define BP_USBHS_ENDPTNAK_EPTN (16U)       //!< Bit position for USBHS_ENDPTNAK_EPTN.
#define BM_USBHS_ENDPTNAK_EPTN (0x000F0000U) //!< Bit mask for USBHS_ENDPTNAK_EPTN.
#define BS_USBHS_ENDPTNAK_EPTN (4U)        //!< Bit field size in bits for USBHS_ENDPTNAK_EPTN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ENDPTNAK_EPTN field.
#define BR_USBHS_ENDPTNAK_EPTN (HW_USBHS_ENDPTNAK.B.EPTN)
#endif

//! @brief Format value for bitfield USBHS_ENDPTNAK_EPTN.
#define BF_USBHS_ENDPTNAK_EPTN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ENDPTNAK_EPTN), uint32_t) & BM_USBHS_ENDPTNAK_EPTN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the EPTN field to a new value.
#define BW_USBHS_ENDPTNAK_EPTN(v) (HW_USBHS_ENDPTNAK_WR((HW_USBHS_ENDPTNAK_RD() & ~BM_USBHS_ENDPTNAK_EPTN) | BF_USBHS_ENDPTNAK_EPTN(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_ENDPTNAKEN - Endpoint NAK Enable Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_ENDPTNAKEN - Endpoint NAK Enable Register (RW)
 *
 * Reset value: 0x00000000U
 */
typedef union _hw_usbhs_endptnaken
{
    uint32_t U;
    struct _hw_usbhs_endptnaken_bitfields
    {
        uint32_t EPRNE : 4;            //!< [3:0] RX Endpoint NAK
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t EPTNE : 4;            //!< [19:16] TX Endpoint NAK
        uint32_t RESERVED1 : 12;       //!< [31:20] Reserved
    } B;
} hw_usbhs_endptnaken_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_ENDPTNAKEN register
 */
//@{
#define HW_USBHS_ENDPTNAKEN_ADDR (REGS_USBHS_BASE + 0x17CU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_ENDPTNAKEN      (*(__IO hw_usbhs_endptnaken_t *) HW_USBHS_ENDPTNAKEN_ADDR)
#define HW_USBHS_ENDPTNAKEN_RD() (HW_USBHS_ENDPTNAKEN.U)
#define HW_USBHS_ENDPTNAKEN_WR(v) (HW_USBHS_ENDPTNAKEN.U = (v))
#define HW_USBHS_ENDPTNAKEN_SET(v) (HW_USBHS_ENDPTNAKEN_WR(HW_USBHS_ENDPTNAKEN_RD() |  (v)))
#define HW_USBHS_ENDPTNAKEN_CLR(v) (HW_USBHS_ENDPTNAKEN_WR(HW_USBHS_ENDPTNAKEN_RD() & ~(v)))
#define HW_USBHS_ENDPTNAKEN_TOG(v) (HW_USBHS_ENDPTNAKEN_WR(HW_USBHS_ENDPTNAKEN_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_ENDPTNAKEN bitfields
 */

/*!
 * @name Register USBHS_ENDPTNAKEN, field EPRNE[3:0] (W1C)
 *
 * Each bit is an enable bit for the corresponding RX Endpoint NAK bit. If this
 * bit is set and the corresponding RX Endpoint NAK bit is set, the NAK Interrupt
 * bit is set. EPRNE[3]-Endpoint #3 EPRNE[2]-Endpoint #2 EPRNE[1]-Endpoint #1
 * EPRNE[0]-Endpoint #0
 */
//@{
#define BP_USBHS_ENDPTNAKEN_EPRNE (0U)     //!< Bit position for USBHS_ENDPTNAKEN_EPRNE.
#define BM_USBHS_ENDPTNAKEN_EPRNE (0x0000000FU) //!< Bit mask for USBHS_ENDPTNAKEN_EPRNE.
#define BS_USBHS_ENDPTNAKEN_EPRNE (4U)     //!< Bit field size in bits for USBHS_ENDPTNAKEN_EPRNE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ENDPTNAKEN_EPRNE field.
#define BR_USBHS_ENDPTNAKEN_EPRNE (HW_USBHS_ENDPTNAKEN.B.EPRNE)
#endif

//! @brief Format value for bitfield USBHS_ENDPTNAKEN_EPRNE.
#define BF_USBHS_ENDPTNAKEN_EPRNE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ENDPTNAKEN_EPRNE), uint32_t) & BM_USBHS_ENDPTNAKEN_EPRNE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the EPRNE field to a new value.
#define BW_USBHS_ENDPTNAKEN_EPRNE(v) (HW_USBHS_ENDPTNAKEN_WR((HW_USBHS_ENDPTNAKEN_RD() & ~BM_USBHS_ENDPTNAKEN_EPRNE) | BF_USBHS_ENDPTNAKEN_EPRNE(v)))
#endif
//@}

/*!
 * @name Register USBHS_ENDPTNAKEN, field EPTNE[19:16] (W1C)
 *
 * Each bit is an enable bit for the corresponding TX Endpoint NAK bit. If this
 * bit is set and the corresponding TX Endpoint NAK bit is set, the NAK Interrupt
 * bit is set. EPTNE[3]-Endpoint #3 EPTNE[2]-Endpoint #2 EPTNE[1]-Endpoint #1
 * EPTNE[0]-Endpoint #0
 */
//@{
#define BP_USBHS_ENDPTNAKEN_EPTNE (16U)    //!< Bit position for USBHS_ENDPTNAKEN_EPTNE.
#define BM_USBHS_ENDPTNAKEN_EPTNE (0x000F0000U) //!< Bit mask for USBHS_ENDPTNAKEN_EPTNE.
#define BS_USBHS_ENDPTNAKEN_EPTNE (4U)     //!< Bit field size in bits for USBHS_ENDPTNAKEN_EPTNE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_ENDPTNAKEN_EPTNE field.
#define BR_USBHS_ENDPTNAKEN_EPTNE (HW_USBHS_ENDPTNAKEN.B.EPTNE)
#endif

//! @brief Format value for bitfield USBHS_ENDPTNAKEN_EPTNE.
#define BF_USBHS_ENDPTNAKEN_EPTNE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_ENDPTNAKEN_EPTNE), uint32_t) & BM_USBHS_ENDPTNAKEN_EPTNE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the EPTNE field to a new value.
#define BW_USBHS_ENDPTNAKEN_EPTNE(v) (HW_USBHS_ENDPTNAKEN_WR((HW_USBHS_ENDPTNAKEN_RD() & ~BM_USBHS_ENDPTNAKEN_EPTNE) | BF_USBHS_ENDPTNAKEN_EPTNE(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_CONFIGFLAG - Configure Flag Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_CONFIGFLAG - Configure Flag Register (RO)
 *
 * Reset value: 0x00000001U
 *
 * This EHCI register is not used in this implementation. A read from this
 * register returns a constant of a 0x0000_0001 to indicate that all port routings
 * default to this host controller.
 */
typedef union _hw_usbhs_configflag
{
    uint32_t U;
    struct _hw_usbhs_configflag_bitfields
    {
        uint32_t RESERVED0 : 32;       //!< [31:0] Reserved
    } B;
} hw_usbhs_configflag_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_CONFIGFLAG register
 */
//@{
#define HW_USBHS_CONFIGFLAG_ADDR (REGS_USBHS_BASE + 0x180U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_CONFIGFLAG      (*(__I hw_usbhs_configflag_t *) HW_USBHS_CONFIGFLAG_ADDR)
#define HW_USBHS_CONFIGFLAG_RD() (HW_USBHS_CONFIGFLAG.U)
#endif
//@}

