ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_CONFIGFLAG bitfields
 */

//-------------------------------------------------------------------------------------------
// HW_USBHS_PORTSC1 - Port Status and Control Registers
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_PORTSC1 - Port Status and Control Registers (RW)
 *
 * Reset value: 0x80000000U
 *
 * The USB module contains a single PORTSC register. This register only resets
 * when power is initially applied or in response to a controller reset. Initial
 * conditions of a port are: No device connected Port disabled If the port has
 * port power control, this state remains until software applies power to the port
 * by setting port power to one. For the USBHS module in device mode, the USBHS
 * controller does not support power control. Port control in device mode is used
 * only for status port reset, suspend, and current connect status. It is also
 * used to initiate test mode or force signaling, and allows software to place the
 * PHY into low-power suspend mode and disable the PHY clock.
 */
typedef union _hw_usbhs_portsc1
{
    uint32_t U;
    struct _hw_usbhs_portsc1_bitfields
    {
        uint32_t CCS : 1;              //!< [0] Current Connect Status
        uint32_t CSC : 1;              //!< [1] Connect Change Status
        uint32_t PE : 1;               //!< [2] Port Enabled/disabled
        uint32_t PEC : 1;              //!< [3] Port Enable/disable Change
        uint32_t OCA : 1;              //!< [4] Over-current active
        uint32_t OCC : 1;              //!< [5] Over-Current Change
        uint32_t FPR : 1;              //!< [6] Force Port Resume
        uint32_t SUSP : 1;             //!< [7] Suspend
        uint32_t PR : 1;               //!< [8] Port Reset
        uint32_t HSP : 1;              //!< [9] High Speed Port.
        uint32_t LS : 2;               //!< [11:10] Line Status
        uint32_t PP : 1;               //!< [12] Port Power
        uint32_t PO : 1;               //!< [13] Port Owner
        uint32_t PIC : 2;              //!< [15:14] Port Indicator Control
        uint32_t PTCb : 4;             //!< [19:16] Port Test Control
        uint32_t WKCN : 1;             //!< [20] Wake on Connect enable
        uint32_t WKDS : 1;             //!< [21] Wake on Disconnect enable
        uint32_t WKOC : 1;             //!< [22] Wake on Over-Current enable
        uint32_t PHCD : 1;             //!< [23] PHY low power suspend
        uint32_t PFSC : 1;             //!< [24] Port force Full-Speed Connect
        uint32_t RESERVED0 : 1;        //!< [25] Reserved
        uint32_t PSPD : 2;             //!< [27:26] Port Speed
        uint32_t RESERVED1 : 2;        //!< [29:28] Reserved
        uint32_t PTS : 2;              //!< [31:30] Port Transceiver Select
    } B;
} hw_usbhs_portsc1_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_PORTSC1 register
 */
//@{
#define HW_USBHS_PORTSC1_ADDR    (REGS_USBHS_BASE + 0x184U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_PORTSC1         (*(__IO hw_usbhs_portsc1_t *) HW_USBHS_PORTSC1_ADDR)
#define HW_USBHS_PORTSC1_RD()    (HW_USBHS_PORTSC1.U)
#define HW_USBHS_PORTSC1_WR(v)   (HW_USBHS_PORTSC1.U = (v))
#define HW_USBHS_PORTSC1_SET(v)  (HW_USBHS_PORTSC1_WR(HW_USBHS_PORTSC1_RD() |  (v)))
#define HW_USBHS_PORTSC1_CLR(v)  (HW_USBHS_PORTSC1_WR(HW_USBHS_PORTSC1_RD() & ~(v)))
#define HW_USBHS_PORTSC1_TOG(v)  (HW_USBHS_PORTSC1_WR(HW_USBHS_PORTSC1_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_PORTSC1 bitfields
 */

/*!
 * @name Register USBHS_PORTSC1, field CCS[0] (RO)
 *
 * Indicates that a device successfully attaches and operates in high speed or
 * full speed as indicated by the PSPD bit. If clear, the device did not attach
 * successfully or forcibly disconnects by the software clearing the USBCMD[RUN]
 * bit. It does not state the device disconnected or suspended. This bit is cleared
 * if the PP bit is cleared in host mode.
 *
 * Values:
 * - 0 - No device present (host mode) or attached (device mode)
 * - 1 - Device is present (host mode) or attached (device mode)
 */
//@{
#define BP_USBHS_PORTSC1_CCS (0U)          //!< Bit position for USBHS_PORTSC1_CCS.
#define BM_USBHS_PORTSC1_CCS (0x00000001U) //!< Bit mask for USBHS_PORTSC1_CCS.
#define BS_USBHS_PORTSC1_CCS (1U)          //!< Bit field size in bits for USBHS_PORTSC1_CCS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_CCS field.
#define BR_USBHS_PORTSC1_CCS (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_CCS))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field CSC[1] (W1C)
 *
 * Host mode: This bit indicates a change occurred in the port's current connect
 * status. The controller sets this bit for all changes to the port device
 * connect status, even if system software has not cleared an existing connect status
 * change. For example, the insertion status changes twice before system software
 * has cleared the changed condition; hub hardware is setting an already-set bit
 * (i.e., the bit remains set). Software clears this bit by writing a 1 to it.
 * This field is cleared if the PP bit is cleared. Device mode: In device mode,
 * this bit is undefined.
 *
 * Values:
 * - 0 - No change
 * - 1 - Connect status has changed
 */
//@{
#define BP_USBHS_PORTSC1_CSC (1U)          //!< Bit position for USBHS_PORTSC1_CSC.
#define BM_USBHS_PORTSC1_CSC (0x00000002U) //!< Bit mask for USBHS_PORTSC1_CSC.
#define BS_USBHS_PORTSC1_CSC (1U)          //!< Bit field size in bits for USBHS_PORTSC1_CSC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_CSC field.
#define BR_USBHS_PORTSC1_CSC (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_CSC))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_CSC.
#define BF_USBHS_PORTSC1_CSC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_CSC), uint32_t) & BM_USBHS_PORTSC1_CSC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the CSC field to a new value.
#define BW_USBHS_PORTSC1_CSC(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_CSC) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PE[2] (RW)
 *
 * Host mode: Ports can only be enabled by the controller as a part of the reset
 * and enable sequence. Software cannot enable a port by setting this bit. A
 * fault condition (disconnect event or other fault condition) or host software can
 * disable ports. The bit status does not change until the port state actually
 * changes. There may be a delay in disabling or enabling a port due to other host
 * and bus events. When the port is disabled, downstream propagation of data is
 * blocked except for reset. This field is cleared if the PP bit is cleared in
 * host mode. Device mode: The device port is always enabled. (This bit is set).
 */
//@{
#define BP_USBHS_PORTSC1_PE  (2U)          //!< Bit position for USBHS_PORTSC1_PE.
#define BM_USBHS_PORTSC1_PE  (0x00000004U) //!< Bit mask for USBHS_PORTSC1_PE.
#define BS_USBHS_PORTSC1_PE  (1U)          //!< Bit field size in bits for USBHS_PORTSC1_PE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PE field.
#define BR_USBHS_PORTSC1_PE  (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PE))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PE.
#define BF_USBHS_PORTSC1_PE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PE), uint32_t) & BM_USBHS_PORTSC1_PE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PE field to a new value.
#define BW_USBHS_PORTSC1_PE(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PEC[3] (W1C)
 *
 * For the root hub, this bit gets set only when a port is disabled due to
 * disconnect on the port or due to the appropriate conditions existing at the EOF2
 * point (See Chapter 11 of the USB Specification). Software clears this by writing
 * a 1 to it. In device mode, the device port is always enabled. (This bit is
 * zero). This bit is cleared if the PP bit is cleared.
 *
 * Values:
 * - 0 - No change
 * - 1 - Port disabled
 */
//@{
#define BP_USBHS_PORTSC1_PEC (3U)          //!< Bit position for USBHS_PORTSC1_PEC.
#define BM_USBHS_PORTSC1_PEC (0x00000008U) //!< Bit mask for USBHS_PORTSC1_PEC.
#define BS_USBHS_PORTSC1_PEC (1U)          //!< Bit field size in bits for USBHS_PORTSC1_PEC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PEC field.
#define BR_USBHS_PORTSC1_PEC (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PEC))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PEC.
#define BF_USBHS_PORTSC1_PEC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PEC), uint32_t) & BM_USBHS_PORTSC1_PEC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PEC field to a new value.
#define BW_USBHS_PORTSC1_PEC(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PEC) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field OCA[4] (RO)
 *
 * This bit automatically transitions from 1 to 0 when the over-current
 * condition is removed. For host/OTG implementations, the user can provide over-current
 * detection to the USBn_PWRFAULT signal for this condition. For device-only
 * implementations, this bit must always be cleared.
 *
 * Values:
 * - 0 - Port not in over-current condition
 * - 1 - Port currently in over-current condition
 */
//@{
#define BP_USBHS_PORTSC1_OCA (4U)          //!< Bit position for USBHS_PORTSC1_OCA.
#define BM_USBHS_PORTSC1_OCA (0x00000010U) //!< Bit mask for USBHS_PORTSC1_OCA.
#define BS_USBHS_PORTSC1_OCA (1U)          //!< Bit field size in bits for USBHS_PORTSC1_OCA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_OCA field.
#define BR_USBHS_PORTSC1_OCA (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_OCA))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field OCC[5] (W1C)
 *
 * Indicates a change to the OCA bit. Software clears this bit by writing a 1.
 * For host mode, the user can provide over-current detection to the USBn_PWRFAULT
 * signal for this condition. For device-only implementations, this bit must
 * always be cleared.
 *
 * Values:
 * - 0 - No over-current
 * - 1 - Over-current detect
 */
//@{
#define BP_USBHS_PORTSC1_OCC (5U)          //!< Bit position for USBHS_PORTSC1_OCC.
#define BM_USBHS_PORTSC1_OCC (0x00000020U) //!< Bit mask for USBHS_PORTSC1_OCC.
#define BS_USBHS_PORTSC1_OCC (1U)          //!< Bit field size in bits for USBHS_PORTSC1_OCC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_OCC field.
#define BR_USBHS_PORTSC1_OCC (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_OCC))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_OCC.
#define BF_USBHS_PORTSC1_OCC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_OCC), uint32_t) & BM_USBHS_PORTSC1_OCC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the OCC field to a new value.
#define BW_USBHS_PORTSC1_OCC(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_OCC) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field FPR[6] (RW)
 *
 * This bit is not-EHCI compatible. Host mode: Software sets this bit to drive
 * resume signaling. The controller sets this bit if a J-to-K transition is
 * detected while the port is in suspend state (PE = SUSP = 1), which in turn sets the
 * USBSTS[PCI] bit. This bit automatically clears after the resume sequence is
 * complete. This behavior is different from EHCI where the host controller driver
 * is required to clear this bit after the resume duration is timed in the
 * driver. When the controller owns the port, the resume sequence follows the defined
 * sequence documented in the USB Specification Revision 2.0. The resume signaling
 * (full-speed K) is driven on the port as long as this bit remains set. This
 * bit remains set until the port switches to the high-speed idle. Clearing this
 * bit has no affect because the port controller times the resume operation to
 * clear the bit the port control state switches to HS or FS idle. This bit is
 * cleared if the PP bit is cleared in host mode. Device mode: If remote wakeup is
 * enabled, after the device is in suspend for 5 ms or more, software can set this
 * bit to drive resume signaling before clearing. The device controller sets this
 * bit if a J-to-K transition is detected while port is in suspend state, which in
 * turn sets the USBSTS[PCI] bit. The bit is cleared when the device returns to
 * normal operation.
 *
 * Values:
 * - 0 - No resume (K-state) detected/driven on port
 * - 1 - Resume detected/driven on port
 */
//@{
#define BP_USBHS_PORTSC1_FPR (6U)          //!< Bit position for USBHS_PORTSC1_FPR.
#define BM_USBHS_PORTSC1_FPR (0x00000040U) //!< Bit mask for USBHS_PORTSC1_FPR.
#define BS_USBHS_PORTSC1_FPR (1U)          //!< Bit field size in bits for USBHS_PORTSC1_FPR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_FPR field.
#define BR_USBHS_PORTSC1_FPR (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_FPR))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_FPR.
#define BF_USBHS_PORTSC1_FPR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_FPR), uint32_t) & BM_USBHS_PORTSC1_FPR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FPR field to a new value.
#define BW_USBHS_PORTSC1_FPR(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_FPR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field SUSP[7] (RW)
 *
 * Host mode: The PE and SUSP bits define the port state as follows: PE SUSP
 * Port State 0 x Disable 1 0 Enable 1 1 Suspend When in suspend state, downstream
 * propagation of data is blocked on this port, except for port reset. The
 * blocking occurs at the end of the current transaction if a transaction was in
 * progress when this bit was set. In the suspend state, the port is sensitive to resume
 * detection. The bit status does not change until the port is suspended and
 * there may be a delay in suspending a port if there is a transaction currently in
 * progress on the USB. The module unconditionally clears this bit when software
 * clears the FPR bit. The host controller ignores clearing this bit. If host
 * software sets this bit when the port is not enabled (PE = 0), the results are
 * undefined. This bit is cleared if the PP bit is cleared in host mode. Device
 * mode: In device mode, this bit is a read-only status bit.
 *
 * Values:
 * - 0 - Port not in suspend state
 * - 1 - Port in suspend state
 */
//@{
#define BP_USBHS_PORTSC1_SUSP (7U)         //!< Bit position for USBHS_PORTSC1_SUSP.
#define BM_USBHS_PORTSC1_SUSP (0x00000080U) //!< Bit mask for USBHS_PORTSC1_SUSP.
#define BS_USBHS_PORTSC1_SUSP (1U)         //!< Bit field size in bits for USBHS_PORTSC1_SUSP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_SUSP field.
#define BR_USBHS_PORTSC1_SUSP (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_SUSP))
#endif

