ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_PORTSC1_SUSP.
#define BF_USBHS_PORTSC1_SUSP(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_SUSP), uint32_t) & BM_USBHS_PORTSC1_SUSP)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SUSP field to a new value.
#define BW_USBHS_PORTSC1_SUSP(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_SUSP) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PR[8] (RW)
 *
 * This field is cleared if the PP bit is cleared. Host mode: When software sets
 * this bit the bus-reset sequence as defined in the USB Specification Revision
 * 2.0 starts. This bit automatically clears after the reset sequence completes.
 * This behavior is different from EHCI where the host controller driver is
 * required to clear this bit after the reset duration is timed in the driver. Device
 * mode: This bit is a read-only status bit. Device reset from the USB bus is
 * also indicated in the USBSTS register.
 *
 * Values:
 * - 0 - Port is not in reset
 * - 1 - Port is in reset
 */
//@{
#define BP_USBHS_PORTSC1_PR  (8U)          //!< Bit position for USBHS_PORTSC1_PR.
#define BM_USBHS_PORTSC1_PR  (0x00000100U) //!< Bit mask for USBHS_PORTSC1_PR.
#define BS_USBHS_PORTSC1_PR  (1U)          //!< Bit field size in bits for USBHS_PORTSC1_PR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PR field.
#define BR_USBHS_PORTSC1_PR  (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PR))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PR.
#define BF_USBHS_PORTSC1_PR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PR), uint32_t) & BM_USBHS_PORTSC1_PR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PR field to a new value.
#define BW_USBHS_PORTSC1_PR(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field HSP[9] (RO)
 *
 * Indicates if the host/device connected is in high speed mode. This bit is
 * redundant with the PSPD bit field.
 *
 * Values:
 * - 0 - FS or LS
 * - 1 - HS
 */
//@{
#define BP_USBHS_PORTSC1_HSP (9U)          //!< Bit position for USBHS_PORTSC1_HSP.
#define BM_USBHS_PORTSC1_HSP (0x00000200U) //!< Bit mask for USBHS_PORTSC1_HSP.
#define BS_USBHS_PORTSC1_HSP (1U)          //!< Bit field size in bits for USBHS_PORTSC1_HSP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_HSP field.
#define BR_USBHS_PORTSC1_HSP (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_HSP))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field LS[11:10] (RO)
 *
 * Reflects current logical levels of the USB DP (bit 11) and DM (bit 10) signal
 * lines. In host mode, the line status by the host controller driver is not
 * necessary (unlike EHCI) because hardware manages the connection of FS and LS. In
 * device mode, LS by the device controller is not necessary.
 *
 * Values:
 * - 00 - SE0
 * - 01 - J-state
 * - 10 - K-state
 * - 11 - Undefined
 */
//@{
#define BP_USBHS_PORTSC1_LS  (10U)         //!< Bit position for USBHS_PORTSC1_LS.
#define BM_USBHS_PORTSC1_LS  (0x00000C00U) //!< Bit mask for USBHS_PORTSC1_LS.
#define BS_USBHS_PORTSC1_LS  (2U)          //!< Bit field size in bits for USBHS_PORTSC1_LS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_LS field.
#define BR_USBHS_PORTSC1_LS  (HW_USBHS_PORTSC1.B.LS)
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PP[12] (RW)
 *
 * Represents the current setting of the port power control switch (0 equals
 * off, 1 equals on). When power is not available on a port (PP = 0), it is
 * non-functional and does not report attaches, detaches, etc. When an over-current
 * condition is detected on a powered port, the host controller driver from a 1to a 0
 * (removing power from the port) transitions the PP bit in each affected port.
 */
//@{
#define BP_USBHS_PORTSC1_PP  (12U)         //!< Bit position for USBHS_PORTSC1_PP.
#define BM_USBHS_PORTSC1_PP  (0x00001000U) //!< Bit mask for USBHS_PORTSC1_PP.
#define BS_USBHS_PORTSC1_PP  (1U)          //!< Bit field size in bits for USBHS_PORTSC1_PP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PP field.
#define BR_USBHS_PORTSC1_PP  (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PP))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PP.
#define BF_USBHS_PORTSC1_PP(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PP), uint32_t) & BM_USBHS_PORTSC1_PP)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PP field to a new value.
#define BW_USBHS_PORTSC1_PP(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PP) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PO[13] (RW)
 *
 * Port owner handoff is not implemented in this device.
 */
//@{
#define BP_USBHS_PORTSC1_PO  (13U)         //!< Bit position for USBHS_PORTSC1_PO.
#define BM_USBHS_PORTSC1_PO  (0x00002000U) //!< Bit mask for USBHS_PORTSC1_PO.
#define BS_USBHS_PORTSC1_PO  (1U)          //!< Bit field size in bits for USBHS_PORTSC1_PO.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PO field.
#define BR_USBHS_PORTSC1_PO  (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PO))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PO.
#define BF_USBHS_PORTSC1_PO(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PO), uint32_t) & BM_USBHS_PORTSC1_PO)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PO field to a new value.
#define BW_USBHS_PORTSC1_PO(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PO) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PIC[15:14] (RW)
 *
 * Not supported on this module.
 */
//@{
#define BP_USBHS_PORTSC1_PIC (14U)         //!< Bit position for USBHS_PORTSC1_PIC.
#define BM_USBHS_PORTSC1_PIC (0x0000C000U) //!< Bit mask for USBHS_PORTSC1_PIC.
#define BS_USBHS_PORTSC1_PIC (2U)          //!< Bit field size in bits for USBHS_PORTSC1_PIC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PIC field.
#define BR_USBHS_PORTSC1_PIC (HW_USBHS_PORTSC1.B.PIC)
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PIC.
#define BF_USBHS_PORTSC1_PIC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PIC), uint32_t) & BM_USBHS_PORTSC1_PIC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PIC field to a new value.
#define BW_USBHS_PORTSC1_PIC(v) (HW_USBHS_PORTSC1_WR((HW_USBHS_PORTSC1_RD() & ~BM_USBHS_PORTSC1_PIC) | BF_USBHS_PORTSC1_PIC(v)))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PTC[19:16] (RW)
 *
 * Any value other than 0 indicates the port operates in test mode. Refer to
 * Chapter 7 of the USB Specification Revision 2.0 for details on each test mode.
 * The FORCE_ENABLE_FS and FORCE ENABLE_LS settings are extensions to the test mode
 * support in the EHCI specification. Writing the PTC field to any of the
 * FORCE_ENABLE values forces the port into the connected and enabled state at the
 * selected speed. Then clearing the PTC field allows the port state machines to
 * progress normally from that point.
 *
 * Values:
 * - 0000 - Not enabled
 * - 0001 - J_STATE
 * - 0010 - K_STATE
 * - 0011 - SEQ_NAK
 * - 0100 - Packet
 * - 0101 - FORCE_ENABLE_HS
 * - 0110 - FORCE_ENABLE_FS
 * - 0111 - FORCE_ENABLE_LS
 */
//@{
#define BP_USBHS_PORTSC1_PTC (16U)         //!< Bit position for USBHS_PORTSC1_PTC.
#define BM_USBHS_PORTSC1_PTC (0x000F0000U) //!< Bit mask for USBHS_PORTSC1_PTC.
#define BS_USBHS_PORTSC1_PTC (4U)          //!< Bit field size in bits for USBHS_PORTSC1_PTC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PTC field.
#define BR_USBHS_PORTSC1_PTC (HW_USBHS_PORTSC1.B.PTC)
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PTC.
#define BF_USBHS_PORTSC1_PTC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PTC), uint32_t) & BM_USBHS_PORTSC1_PTC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PTC field to a new value.
#define BW_USBHS_PORTSC1_PTC(v) (HW_USBHS_PORTSC1_WR((HW_USBHS_PORTSC1_RD() & ~BM_USBHS_PORTSC1_PTC) | BF_USBHS_PORTSC1_PTC(v)))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field WKCN[20] (RW)
 *
 * Enables the port to be sensitive to device connects as wake-up events. This
 * field is 0 if the PP bit is cleared or the module is in device mode. In host
 * mode, this can work with an external power control circuit.
 */
//@{
#define BP_USBHS_PORTSC1_WKCN (20U)        //!< Bit position for USBHS_PORTSC1_WKCN.
#define BM_USBHS_PORTSC1_WKCN (0x00100000U) //!< Bit mask for USBHS_PORTSC1_WKCN.
#define BS_USBHS_PORTSC1_WKCN (1U)         //!< Bit field size in bits for USBHS_PORTSC1_WKCN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_WKCN field.
#define BR_USBHS_PORTSC1_WKCN (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_WKCN))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_WKCN.
#define BF_USBHS_PORTSC1_WKCN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_WKCN), uint32_t) & BM_USBHS_PORTSC1_WKCN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WKCN field to a new value.
#define BW_USBHS_PORTSC1_WKCN(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_WKCN) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field WKDS[21] (RW)
 *
 * Enables the port to be sensitive to device disconnects as wake-up events.
 * This field is 0 if the PP bit is cleared or the module is in device mode. In host
 * mode, this bit can work with an external power control circuit.
 */
//@{
#define BP_USBHS_PORTSC1_WKDS (21U)        //!< Bit position for USBHS_PORTSC1_WKDS.
#define BM_USBHS_PORTSC1_WKDS (0x00200000U) //!< Bit mask for USBHS_PORTSC1_WKDS.
#define BS_USBHS_PORTSC1_WKDS (1U)         //!< Bit field size in bits for USBHS_PORTSC1_WKDS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_WKDS field.
#define BR_USBHS_PORTSC1_WKDS (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_WKDS))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_WKDS.
#define BF_USBHS_PORTSC1_WKDS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_WKDS), uint32_t) & BM_USBHS_PORTSC1_WKDS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WKDS field to a new value.
#define BW_USBHS_PORTSC1_WKDS(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_WKDS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field WKOC[22] (RW)
 *
 * Enables the port to be sensitive to over-current conditions as wake-up
 * events. This field is 0 if the PP bit is cleared. In host mode, this bit can work
 * with an external power control circuit.
 */
//@{
#define BP_USBHS_PORTSC1_WKOC (22U)        //!< Bit position for USBHS_PORTSC1_WKOC.
#define BM_USBHS_PORTSC1_WKOC (0x00400000U) //!< Bit mask for USBHS_PORTSC1_WKOC.
#define BS_USBHS_PORTSC1_WKOC (1U)         //!< Bit field size in bits for USBHS_PORTSC1_WKOC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_WKOC field.
#define BR_USBHS_PORTSC1_WKOC (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_WKOC))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_WKOC.
#define BF_USBHS_PORTSC1_WKOC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_WKOC), uint32_t) & BM_USBHS_PORTSC1_WKOC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WKOC field to a new value.
#define BW_USBHS_PORTSC1_WKOC(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_WKOC) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PHCD[23] (RW)
 *
 * This bit is not defined in the EHCI specification. Host mode: The PHY can be
 * placed into low-power suspend when downstream device is put into suspend mode
 * or when no downstream device connects. Software completely controls low-power
 * suspend. Device mode: For the USBHS module in device mode, the PHY can be put
 * into low power suspend when the device is not running (USBCMD[RS] = 0) or
 * suspend signaling is detected on the USB. The PHCD bit is cleared automatically
 * when the resume signaling is detected or when forcing port resumes. Reading this
 * bit indicates the status of the PHY.
 */
//@{
#define BP_USBHS_PORTSC1_PHCD (23U)        //!< Bit position for USBHS_PORTSC1_PHCD.
#define BM_USBHS_PORTSC1_PHCD (0x00800000U) //!< Bit mask for USBHS_PORTSC1_PHCD.
#define BS_USBHS_PORTSC1_PHCD (1U)         //!< Bit field size in bits for USBHS_PORTSC1_PHCD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PHCD field.
#define BR_USBHS_PORTSC1_PHCD (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PHCD))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PHCD.
#define BF_USBHS_PORTSC1_PHCD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PHCD), uint32_t) & BM_USBHS_PORTSC1_PHCD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PHCD field to a new value.
#define BW_USBHS_PORTSC1_PHCD(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PHCD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PFSC[24] (RW)
 *
 * Disables the chirp sequence that allows the port to identify itself as a HS
 * port. useful for testing FS configurations with a HS host, hub, or device. Not
 * defined in the EHCI specification. This bit is for debugging purposes.
 *
 * Values:
 * - 0 - Allow the port to identify itself as high speed
 * - 1 - Force the port to only connect at full speed
 */
//@{
#define BP_USBHS_PORTSC1_PFSC (24U)        //!< Bit position for USBHS_PORTSC1_PFSC.
#define BM_USBHS_PORTSC1_PFSC (0x01000000U) //!< Bit mask for USBHS_PORTSC1_PFSC.
#define BS_USBHS_PORTSC1_PFSC (1U)         //!< Bit field size in bits for USBHS_PORTSC1_PFSC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PFSC field.
#define BR_USBHS_PORTSC1_PFSC (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PFSC))
#endif

//! @brief Format value for bitfield USBHS_PORTSC1_PFSC.
#define BF_USBHS_PORTSC1_PFSC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PFSC), uint32_t) & BM_USBHS_PORTSC1_PFSC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PFSC field to a new value.
#define BW_USBHS_PORTSC1_PFSC(v) (BITBAND_ACCESS32(HW_USBHS_PORTSC1_ADDR, BP_USBHS_PORTSC1_PFSC) = (v))
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PSPD[27:26] (RO)
 *
 * This read-only register field indicates the speed the port operates. This bit
 * is not defined in the EHCI specification.
 *
 * Values:
 * - 00 - Full speed
 * - 01 - Low speed
 * - 10 - High speed
 * - 11 - Undefined
 */
//@{
#define BP_USBHS_PORTSC1_PSPD (26U)        //!< Bit position for USBHS_PORTSC1_PSPD.
#define BM_USBHS_PORTSC1_PSPD (0x0C000000U) //!< Bit mask for USBHS_PORTSC1_PSPD.
#define BS_USBHS_PORTSC1_PSPD (2U)         //!< Bit field size in bits for USBHS_PORTSC1_PSPD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PSPD field.
#define BR_USBHS_PORTSC1_PSPD (HW_USBHS_PORTSC1.B.PSPD)
#endif
//@}

/*!
 * @name Register USBHS_PORTSC1, field PTS[31:30] (RW)
 *
 * Controls which parallel transceiver interface is selected. 10 ULPI parallel
 * interface All other values are reserved. This field is not defined in the EHCI
 * specification.
 */
//@{
#define BP_USBHS_PORTSC1_PTS (30U)         //!< Bit position for USBHS_PORTSC1_PTS.
#define BM_USBHS_PORTSC1_PTS (0xC0000000U) //!< Bit mask for USBHS_PORTSC1_PTS.
#define BS_USBHS_PORTSC1_PTS (2U)          //!< Bit field size in bits for USBHS_PORTSC1_PTS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_PORTSC1_PTS field.
#define BR_USBHS_PORTSC1_PTS (HW_USBHS_PORTSC1.B.PTS)
#endif

