ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_PORTSC1_PTS.
#define BF_USBHS_PORTSC1_PTS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_PORTSC1_PTS), uint32_t) & BM_USBHS_PORTSC1_PTS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PTS field to a new value.
#define BW_USBHS_PORTSC1_PTS(v) (HW_USBHS_PORTSC1_WR((HW_USBHS_PORTSC1_RD() & ~BM_USBHS_PORTSC1_PTS) | BF_USBHS_PORTSC1_PTS(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_OTGSC - On-the-Go Status and Control Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_OTGSC - On-the-Go Status and Control Register (RW)
 *
 * Reset value: 0x00001020U
 *
 * This register is not defined in the EHCI specification. The host controller
 * implements one OTGSC register corresponding to port 0 of the host controller.
 * The OTGSC register has four sections: OTG interrupt enables (read/write) OTG
 * interrupt status (read/write to clear) OTG status inputs (read-only) OTG
 * controls (read/write) The status inputs de-bounce using a 1 ms time constant. Values
 * on the status inputs that do not persist for more than 1 ms do not cause an
 * update of the status inputs or an OTG interrupt.
 */
typedef union _hw_usbhs_otgsc
{
    uint32_t U;
    struct _hw_usbhs_otgsc_bitfields
    {
        uint32_t VD : 1;               //!< [0] VBUS Discharge
        uint32_t VC : 1;               //!< [1] VBUS Charge
        uint32_t HAAR : 1;             //!< [2] Hardware Assist Auto-Reset
        uint32_t OT : 1;               //!< [3] OTG Termination
        uint32_t DP : 1;               //!< [4] Data Pulsing
        uint32_t IDPU : 1;             //!< [5] ID Pull-Up
        uint32_t RESERVED0 : 1;        //!< [6] Reserved
        uint32_t HABA : 1;             //!< [7] Hardware Assist B-Disconnect to A-connect
        uint32_t ID : 1;               //!< [8] USB ID
        uint32_t AVV : 1;              //!< [9] A VBus Valid
        uint32_t ASV : 1;              //!< [10] A Session Valid
        uint32_t BSV : 1;              //!< [11] B Session Valid
        uint32_t BSE : 1;              //!< [12] B Session End
        uint32_t MST : 1;              //!< [13] 1 Milli-Second timer Toggle
        uint32_t DPS : 1;              //!< [14] Data bus Pulsing Status
        uint32_t RESERVED1 : 1;        //!< [15] Reserved
        uint32_t IDIS : 1;             //!< [16] USB ID Interrupt Status
        uint32_t AVVIS : 1;            //!< [17] A VBUS Valid Interrupt Status
        uint32_t ASVIS : 1;            //!< [18] A Session Valid Interrupt Status
        uint32_t BSVIS : 1;            //!< [19] B Session Valid Interrupt Status
        uint32_t BSEIS : 1;            //!< [20] B Session End Interrupt Status
        uint32_t MSS : 1;              //!< [21] 1 Milli-Second timer interrupt Status
        uint32_t DPIS : 1;             //!< [22] Data Pulse interrupt Status
        uint32_t RESERVED2 : 1;        //!< [23] Reserved
        uint32_t IDIE : 1;             //!< [24] USB ID Interrupt Enable
        uint32_t AVVIE : 1;            //!< [25] A VBUS Valid Interrupt Enable
        uint32_t ASVIE : 1;            //!< [26] A Session Valid Interrupt Enable
        uint32_t BSVIE : 1;            //!< [27] B Session Valid Interrupt Enable
        uint32_t BSEIE : 1;            //!< [28] B Session End Interrupt Enable
        uint32_t MSE : 1;              //!< [29] 1 Milli-Second timer interrupt Enable
        uint32_t DPIE : 1;             //!< [30] Data Pulse Interrupt Enable
        uint32_t RESERVED3 : 1;        //!< [31] Reserved
    } B;
} hw_usbhs_otgsc_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_OTGSC register
 */
//@{
#define HW_USBHS_OTGSC_ADDR      (REGS_USBHS_BASE + 0x1A4U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_OTGSC           (*(__IO hw_usbhs_otgsc_t *) HW_USBHS_OTGSC_ADDR)
#define HW_USBHS_OTGSC_RD()      (HW_USBHS_OTGSC.U)
#define HW_USBHS_OTGSC_WR(v)     (HW_USBHS_OTGSC.U = (v))
#define HW_USBHS_OTGSC_SET(v)    (HW_USBHS_OTGSC_WR(HW_USBHS_OTGSC_RD() |  (v)))
#define HW_USBHS_OTGSC_CLR(v)    (HW_USBHS_OTGSC_WR(HW_USBHS_OTGSC_RD() & ~(v)))
#define HW_USBHS_OTGSC_TOG(v)    (HW_USBHS_OTGSC_WR(HW_USBHS_OTGSC_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_OTGSC bitfields
 */

/*!
 * @name Register USBHS_OTGSC, field VD[0] (RW)
 *
 * Setting this bit causes VBUS to discharge through a resistor.
 */
//@{
#define BP_USBHS_OTGSC_VD    (0U)          //!< Bit position for USBHS_OTGSC_VD.
#define BM_USBHS_OTGSC_VD    (0x00000001U) //!< Bit mask for USBHS_OTGSC_VD.
#define BS_USBHS_OTGSC_VD    (1U)          //!< Bit field size in bits for USBHS_OTGSC_VD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_VD field.
#define BR_USBHS_OTGSC_VD    (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_VD))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_VD.
#define BF_USBHS_OTGSC_VD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_VD), uint32_t) & BM_USBHS_OTGSC_VD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the VD field to a new value.
#define BW_USBHS_OTGSC_VD(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_VD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field VC[1] (RW)
 *
 * Setting this bit causes the VBUS line to charge. This is used for VBus
 * pulsing during SRP.
 */
//@{
#define BP_USBHS_OTGSC_VC    (1U)          //!< Bit position for USBHS_OTGSC_VC.
#define BM_USBHS_OTGSC_VC    (0x00000002U) //!< Bit mask for USBHS_OTGSC_VC.
#define BS_USBHS_OTGSC_VC    (1U)          //!< Bit field size in bits for USBHS_OTGSC_VC.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_VC field.
#define BR_USBHS_OTGSC_VC    (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_VC))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_VC.
#define BF_USBHS_OTGSC_VC(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_VC), uint32_t) & BM_USBHS_OTGSC_VC)

#ifndef __LANGUAGE_ASM__
//! @brief Set the VC field to a new value.
#define BW_USBHS_OTGSC_VC(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_VC) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field HAAR[2] (RW)
 *
 * Values:
 * - 0 - Disabled.
 * - 1 - Enable automatic reset after connect on host port.
 */
//@{
#define BP_USBHS_OTGSC_HAAR  (2U)          //!< Bit position for USBHS_OTGSC_HAAR.
#define BM_USBHS_OTGSC_HAAR  (0x00000004U) //!< Bit mask for USBHS_OTGSC_HAAR.
#define BS_USBHS_OTGSC_HAAR  (1U)          //!< Bit field size in bits for USBHS_OTGSC_HAAR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_HAAR field.
#define BR_USBHS_OTGSC_HAAR  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_HAAR))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_HAAR.
#define BF_USBHS_OTGSC_HAAR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_HAAR), uint32_t) & BM_USBHS_OTGSC_HAAR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the HAAR field to a new value.
#define BW_USBHS_OTGSC_HAAR(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_HAAR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field OT[3] (RW)
 *
 * This bit must be set with the OTG module in device mode.
 *
 * Values:
 * - 0 - Disable pull-down on DM
 * - 1 - Enable pull-down on DM
 */
//@{
#define BP_USBHS_OTGSC_OT    (3U)          //!< Bit position for USBHS_OTGSC_OT.
#define BM_USBHS_OTGSC_OT    (0x00000008U) //!< Bit mask for USBHS_OTGSC_OT.
#define BS_USBHS_OTGSC_OT    (1U)          //!< Bit field size in bits for USBHS_OTGSC_OT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_OT field.
#define BR_USBHS_OTGSC_OT    (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_OT))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_OT.
#define BF_USBHS_OTGSC_OT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_OT), uint32_t) & BM_USBHS_OTGSC_OT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the OT field to a new value.
#define BW_USBHS_OTGSC_OT(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_OT) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field DP[4] (RW)
 *
 * Values:
 * - 0 - The pull-up on DP is not asserted
 * - 1 - The pull-up on DP is asserted for data pulsing during SRP
 */
//@{
#define BP_USBHS_OTGSC_DP    (4U)          //!< Bit position for USBHS_OTGSC_DP.
#define BM_USBHS_OTGSC_DP    (0x00000010U) //!< Bit mask for USBHS_OTGSC_DP.
#define BS_USBHS_OTGSC_DP    (1U)          //!< Bit field size in bits for USBHS_OTGSC_DP.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_DP field.
#define BR_USBHS_OTGSC_DP    (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DP))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_DP.
#define BF_USBHS_OTGSC_DP(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_DP), uint32_t) & BM_USBHS_OTGSC_DP)

#ifndef __LANGUAGE_ASM__
//! @brief Set the DP field to a new value.
#define BW_USBHS_OTGSC_DP(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DP) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field IDPU[5] (RW)
 *
 * Provides control over the ID pull-up resistor.
 *
 * Values:
 * - 0 - Disable pull-up. ID input not sampled.
 * - 1 - Enable pull-up
 */
//@{
#define BP_USBHS_OTGSC_IDPU  (5U)          //!< Bit position for USBHS_OTGSC_IDPU.
#define BM_USBHS_OTGSC_IDPU  (0x00000020U) //!< Bit mask for USBHS_OTGSC_IDPU.
#define BS_USBHS_OTGSC_IDPU  (1U)          //!< Bit field size in bits for USBHS_OTGSC_IDPU.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_IDPU field.
#define BR_USBHS_OTGSC_IDPU  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_IDPU))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_IDPU.
#define BF_USBHS_OTGSC_IDPU(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_IDPU), uint32_t) & BM_USBHS_OTGSC_IDPU)

#ifndef __LANGUAGE_ASM__
//! @brief Set the IDPU field to a new value.
#define BW_USBHS_OTGSC_IDPU(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_IDPU) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field HABA[7] (RW)
 *
 * Values:
 * - 0 - Disabled.
 * - 1 - Enable automatic B-disconnect to A-connect sequence.
 */
//@{
#define BP_USBHS_OTGSC_HABA  (7U)          //!< Bit position for USBHS_OTGSC_HABA.
#define BM_USBHS_OTGSC_HABA  (0x00000080U) //!< Bit mask for USBHS_OTGSC_HABA.
#define BS_USBHS_OTGSC_HABA  (1U)          //!< Bit field size in bits for USBHS_OTGSC_HABA.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_HABA field.
#define BR_USBHS_OTGSC_HABA  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_HABA))
#endif

