ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_OTGSC_HABA.
#define BF_USBHS_OTGSC_HABA(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_HABA), uint32_t) & BM_USBHS_OTGSC_HABA)

#ifndef __LANGUAGE_ASM__
//! @brief Set the HABA field to a new value.
#define BW_USBHS_OTGSC_HABA(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_HABA) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field ID[8] (RO)
 *
 * Values:
 * - 0 - A device
 * - 1 - B device
 */
//@{
#define BP_USBHS_OTGSC_ID    (8U)          //!< Bit position for USBHS_OTGSC_ID.
#define BM_USBHS_OTGSC_ID    (0x00000100U) //!< Bit mask for USBHS_OTGSC_ID.
#define BS_USBHS_OTGSC_ID    (1U)          //!< Bit field size in bits for USBHS_OTGSC_ID.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_ID field.
#define BR_USBHS_OTGSC_ID    (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_ID))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field AVV[9] (RO)
 *
 * Values:
 * - 0 - VBus is below A VBus valid threshold
 * - 1 - VBus is above A VBus valid threshold
 */
//@{
#define BP_USBHS_OTGSC_AVV   (9U)          //!< Bit position for USBHS_OTGSC_AVV.
#define BM_USBHS_OTGSC_AVV   (0x00000200U) //!< Bit mask for USBHS_OTGSC_AVV.
#define BS_USBHS_OTGSC_AVV   (1U)          //!< Bit field size in bits for USBHS_OTGSC_AVV.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_AVV field.
#define BR_USBHS_OTGSC_AVV   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_AVV))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field ASV[10] (RO)
 *
 * Values:
 * - 0 - VBus is below A session valid threshold
 * - 1 - VBus is above A session valid threshold
 */
//@{
#define BP_USBHS_OTGSC_ASV   (10U)         //!< Bit position for USBHS_OTGSC_ASV.
#define BM_USBHS_OTGSC_ASV   (0x00000400U) //!< Bit mask for USBHS_OTGSC_ASV.
#define BS_USBHS_OTGSC_ASV   (1U)          //!< Bit field size in bits for USBHS_OTGSC_ASV.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_ASV field.
#define BR_USBHS_OTGSC_ASV   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_ASV))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field BSV[11] (RO)
 *
 * Values:
 * - 0 - VBus is below B session valid threshold
 * - 1 - VBus is above B session valid threshold
 */
//@{
#define BP_USBHS_OTGSC_BSV   (11U)         //!< Bit position for USBHS_OTGSC_BSV.
#define BM_USBHS_OTGSC_BSV   (0x00000800U) //!< Bit mask for USBHS_OTGSC_BSV.
#define BS_USBHS_OTGSC_BSV   (1U)          //!< Bit field size in bits for USBHS_OTGSC_BSV.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_BSV field.
#define BR_USBHS_OTGSC_BSV   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSV))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field BSE[12] (RO)
 *
 * Values:
 * - 0 - VBus is above B session end threshold
 * - 1 - VBus is below B session end threshold
 */
//@{
#define BP_USBHS_OTGSC_BSE   (12U)         //!< Bit position for USBHS_OTGSC_BSE.
#define BM_USBHS_OTGSC_BSE   (0x00001000U) //!< Bit mask for USBHS_OTGSC_BSE.
#define BS_USBHS_OTGSC_BSE   (1U)          //!< Bit field size in bits for USBHS_OTGSC_BSE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_BSE field.
#define BR_USBHS_OTGSC_BSE   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSE))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field MST[13] (RO)
 *
 * This bit toggles once per millisecond.
 */
//@{
#define BP_USBHS_OTGSC_MST   (13U)         //!< Bit position for USBHS_OTGSC_MST.
#define BM_USBHS_OTGSC_MST   (0x00002000U) //!< Bit mask for USBHS_OTGSC_MST.
#define BS_USBHS_OTGSC_MST   (1U)          //!< Bit field size in bits for USBHS_OTGSC_MST.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_MST field.
#define BR_USBHS_OTGSC_MST   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_MST))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field DPS[14] (RO)
 *
 * Values:
 * - 0 - No pulsing on port
 * - 1 - Pulsing detected on port
 */
//@{
#define BP_USBHS_OTGSC_DPS   (14U)         //!< Bit position for USBHS_OTGSC_DPS.
#define BM_USBHS_OTGSC_DPS   (0x00004000U) //!< Bit mask for USBHS_OTGSC_DPS.
#define BS_USBHS_OTGSC_DPS   (1U)          //!< Bit field size in bits for USBHS_OTGSC_DPS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_DPS field.
#define BR_USBHS_OTGSC_DPS   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DPS))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field IDIS[16] (W1C)
 *
 * Indicates when a change on the ID input is detected. Software must write a 1
 * to clear this bit.
 */
//@{
#define BP_USBHS_OTGSC_IDIS  (16U)         //!< Bit position for USBHS_OTGSC_IDIS.
#define BM_USBHS_OTGSC_IDIS  (0x00010000U) //!< Bit mask for USBHS_OTGSC_IDIS.
#define BS_USBHS_OTGSC_IDIS  (1U)          //!< Bit field size in bits for USBHS_OTGSC_IDIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_IDIS field.
#define BR_USBHS_OTGSC_IDIS  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_IDIS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_IDIS.
#define BF_USBHS_OTGSC_IDIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_IDIS), uint32_t) & BM_USBHS_OTGSC_IDIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the IDIS field to a new value.
#define BW_USBHS_OTGSC_IDIS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_IDIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field AVVIS[17] (W1C)
 *
 * Indicates when VBUS rises above or falls below the VBUS valid threshold (4.4
 * VDC) on an A device. Software must write a 1 to clear this bit.
 */
//@{
#define BP_USBHS_OTGSC_AVVIS (17U)         //!< Bit position for USBHS_OTGSC_AVVIS.
#define BM_USBHS_OTGSC_AVVIS (0x00020000U) //!< Bit mask for USBHS_OTGSC_AVVIS.
#define BS_USBHS_OTGSC_AVVIS (1U)          //!< Bit field size in bits for USBHS_OTGSC_AVVIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_AVVIS field.
#define BR_USBHS_OTGSC_AVVIS (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_AVVIS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_AVVIS.
#define BF_USBHS_OTGSC_AVVIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_AVVIS), uint32_t) & BM_USBHS_OTGSC_AVVIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the AVVIS field to a new value.
#define BW_USBHS_OTGSC_AVVIS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_AVVIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field ASVIS[18] (W1C)
 *
 * Indicates when VBUS rises above or falls below the A session valid threshold
 * (0.8 VDC). Software must write a 1 to clear this bit.
 */
//@{
#define BP_USBHS_OTGSC_ASVIS (18U)         //!< Bit position for USBHS_OTGSC_ASVIS.
#define BM_USBHS_OTGSC_ASVIS (0x00040000U) //!< Bit mask for USBHS_OTGSC_ASVIS.
#define BS_USBHS_OTGSC_ASVIS (1U)          //!< Bit field size in bits for USBHS_OTGSC_ASVIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_ASVIS field.
#define BR_USBHS_OTGSC_ASVIS (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_ASVIS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_ASVIS.
#define BF_USBHS_OTGSC_ASVIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_ASVIS), uint32_t) & BM_USBHS_OTGSC_ASVIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ASVIS field to a new value.
#define BW_USBHS_OTGSC_ASVIS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_ASVIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field BSVIS[19] (W1C)
 *
 * Indicates when VBUS rises above or falls below the B session valid threshold
 * (0.8 VDC). Software must write a 1 to clear this bit.
 */
//@{
#define BP_USBHS_OTGSC_BSVIS (19U)         //!< Bit position for USBHS_OTGSC_BSVIS.
#define BM_USBHS_OTGSC_BSVIS (0x00080000U) //!< Bit mask for USBHS_OTGSC_BSVIS.
#define BS_USBHS_OTGSC_BSVIS (1U)          //!< Bit field size in bits for USBHS_OTGSC_BSVIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_BSVIS field.
#define BR_USBHS_OTGSC_BSVIS (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSVIS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_BSVIS.
#define BF_USBHS_OTGSC_BSVIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_BSVIS), uint32_t) & BM_USBHS_OTGSC_BSVIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the BSVIS field to a new value.
#define BW_USBHS_OTGSC_BSVIS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSVIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field BSEIS[20] (W1C)
 *
 * Indicates when VBUS falls below the B session end threshold. Software must
 * write a 1 to clear this bit.
 */
//@{
#define BP_USBHS_OTGSC_BSEIS (20U)         //!< Bit position for USBHS_OTGSC_BSEIS.
#define BM_USBHS_OTGSC_BSEIS (0x00100000U) //!< Bit mask for USBHS_OTGSC_BSEIS.
#define BS_USBHS_OTGSC_BSEIS (1U)          //!< Bit field size in bits for USBHS_OTGSC_BSEIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_BSEIS field.
#define BR_USBHS_OTGSC_BSEIS (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSEIS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_BSEIS.
#define BF_USBHS_OTGSC_BSEIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_BSEIS), uint32_t) & BM_USBHS_OTGSC_BSEIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the BSEIS field to a new value.
#define BW_USBHS_OTGSC_BSEIS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSEIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field MSS[21] (W1C)
 *
 * This bit is set once every millisecond. Software must write a 1 to clear this
 * bit.
 */
//@{
#define BP_USBHS_OTGSC_MSS   (21U)         //!< Bit position for USBHS_OTGSC_MSS.
#define BM_USBHS_OTGSC_MSS   (0x00200000U) //!< Bit mask for USBHS_OTGSC_MSS.
#define BS_USBHS_OTGSC_MSS   (1U)          //!< Bit field size in bits for USBHS_OTGSC_MSS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_MSS field.
#define BR_USBHS_OTGSC_MSS   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_MSS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_MSS.
#define BF_USBHS_OTGSC_MSS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_MSS), uint32_t) & BM_USBHS_OTGSC_MSS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the MSS field to a new value.
#define BW_USBHS_OTGSC_MSS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_MSS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field DPIS[22] (W1C)
 *
 * Indicates when data bus pulsing occurs on DP or DM. Data bus pulsing only
 * detected when USBMODE[CM] equals 11 and PORTSC0[PP] is cleared. Software must
 * write a 1 to clear this bit.
 */
//@{
#define BP_USBHS_OTGSC_DPIS  (22U)         //!< Bit position for USBHS_OTGSC_DPIS.
#define BM_USBHS_OTGSC_DPIS  (0x00400000U) //!< Bit mask for USBHS_OTGSC_DPIS.
#define BS_USBHS_OTGSC_DPIS  (1U)          //!< Bit field size in bits for USBHS_OTGSC_DPIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_DPIS field.
#define BR_USBHS_OTGSC_DPIS  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DPIS))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_DPIS.
#define BF_USBHS_OTGSC_DPIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_DPIS), uint32_t) & BM_USBHS_OTGSC_DPIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the DPIS field to a new value.
#define BW_USBHS_OTGSC_DPIS(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DPIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field IDIE[24] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_IDIE  (24U)         //!< Bit position for USBHS_OTGSC_IDIE.
#define BM_USBHS_OTGSC_IDIE  (0x01000000U) //!< Bit mask for USBHS_OTGSC_IDIE.
#define BS_USBHS_OTGSC_IDIE  (1U)          //!< Bit field size in bits for USBHS_OTGSC_IDIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_IDIE field.
#define BR_USBHS_OTGSC_IDIE  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_IDIE))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_IDIE.
#define BF_USBHS_OTGSC_IDIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_IDIE), uint32_t) & BM_USBHS_OTGSC_IDIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the IDIE field to a new value.
#define BW_USBHS_OTGSC_IDIE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_IDIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field AVVIE[25] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_AVVIE (25U)         //!< Bit position for USBHS_OTGSC_AVVIE.
#define BM_USBHS_OTGSC_AVVIE (0x02000000U) //!< Bit mask for USBHS_OTGSC_AVVIE.
#define BS_USBHS_OTGSC_AVVIE (1U)          //!< Bit field size in bits for USBHS_OTGSC_AVVIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_AVVIE field.
#define BR_USBHS_OTGSC_AVVIE (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_AVVIE))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_AVVIE.
#define BF_USBHS_OTGSC_AVVIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_AVVIE), uint32_t) & BM_USBHS_OTGSC_AVVIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the AVVIE field to a new value.
#define BW_USBHS_OTGSC_AVVIE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_AVVIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field ASVIE[26] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_ASVIE (26U)         //!< Bit position for USBHS_OTGSC_ASVIE.
#define BM_USBHS_OTGSC_ASVIE (0x04000000U) //!< Bit mask for USBHS_OTGSC_ASVIE.
#define BS_USBHS_OTGSC_ASVIE (1U)          //!< Bit field size in bits for USBHS_OTGSC_ASVIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_ASVIE field.
#define BR_USBHS_OTGSC_ASVIE (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_ASVIE))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_ASVIE.
#define BF_USBHS_OTGSC_ASVIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_ASVIE), uint32_t) & BM_USBHS_OTGSC_ASVIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ASVIE field to a new value.
#define BW_USBHS_OTGSC_ASVIE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_ASVIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field BSVIE[27] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_BSVIE (27U)         //!< Bit position for USBHS_OTGSC_BSVIE.
#define BM_USBHS_OTGSC_BSVIE (0x08000000U) //!< Bit mask for USBHS_OTGSC_BSVIE.
#define BS_USBHS_OTGSC_BSVIE (1U)          //!< Bit field size in bits for USBHS_OTGSC_BSVIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_BSVIE field.
#define BR_USBHS_OTGSC_BSVIE (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSVIE))
#endif

