ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_OTGSC_BSVIE.
#define BF_USBHS_OTGSC_BSVIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_BSVIE), uint32_t) & BM_USBHS_OTGSC_BSVIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the BSVIE field to a new value.
#define BW_USBHS_OTGSC_BSVIE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSVIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field BSEIE[28] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_BSEIE (28U)         //!< Bit position for USBHS_OTGSC_BSEIE.
#define BM_USBHS_OTGSC_BSEIE (0x10000000U) //!< Bit mask for USBHS_OTGSC_BSEIE.
#define BS_USBHS_OTGSC_BSEIE (1U)          //!< Bit field size in bits for USBHS_OTGSC_BSEIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_BSEIE field.
#define BR_USBHS_OTGSC_BSEIE (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSEIE))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_BSEIE.
#define BF_USBHS_OTGSC_BSEIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_BSEIE), uint32_t) & BM_USBHS_OTGSC_BSEIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the BSEIE field to a new value.
#define BW_USBHS_OTGSC_BSEIE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_BSEIE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field MSE[29] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_MSE   (29U)         //!< Bit position for USBHS_OTGSC_MSE.
#define BM_USBHS_OTGSC_MSE   (0x20000000U) //!< Bit mask for USBHS_OTGSC_MSE.
#define BS_USBHS_OTGSC_MSE   (1U)          //!< Bit field size in bits for USBHS_OTGSC_MSE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_MSE field.
#define BR_USBHS_OTGSC_MSE   (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_MSE))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_MSE.
#define BF_USBHS_OTGSC_MSE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_MSE), uint32_t) & BM_USBHS_OTGSC_MSE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the MSE field to a new value.
#define BW_USBHS_OTGSC_MSE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_MSE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_OTGSC, field DPIE[30] (RW)
 *
 * Values:
 * - 0 - Disable
 * - 1 - Enable
 */
//@{
#define BP_USBHS_OTGSC_DPIE  (30U)         //!< Bit position for USBHS_OTGSC_DPIE.
#define BM_USBHS_OTGSC_DPIE  (0x40000000U) //!< Bit mask for USBHS_OTGSC_DPIE.
#define BS_USBHS_OTGSC_DPIE  (1U)          //!< Bit field size in bits for USBHS_OTGSC_DPIE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_OTGSC_DPIE field.
#define BR_USBHS_OTGSC_DPIE  (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DPIE))
#endif

//! @brief Format value for bitfield USBHS_OTGSC_DPIE.
#define BF_USBHS_OTGSC_DPIE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_OTGSC_DPIE), uint32_t) & BM_USBHS_OTGSC_DPIE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the DPIE field to a new value.
#define BW_USBHS_OTGSC_DPIE(v) (BITBAND_ACCESS32(HW_USBHS_OTGSC_ADDR, BP_USBHS_OTGSC_DPIE) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_USBMODE - USB Mode Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_USBMODE - USB Mode Register (RW)
 *
 * Reset value: 0x00005000U
 *
 * This register is not defined in the EHCI specification. It controls the
 * operating mode of the module.
 */
typedef union _hw_usbhs_usbmode
{
    uint32_t U;
    struct _hw_usbhs_usbmode_bitfields
    {
        uint32_t CM : 2;               //!< [1:0] Controller Mode
        uint32_t ES : 1;               //!< [2] Endian Select
        uint32_t SLOM : 1;             //!< [3] Setup Lock-Out Mode
        uint32_t SDIS : 1;             //!< [4] Stream DISable
        uint32_t RESERVED0 : 7;        //!< [11:5] Reserved
        uint32_t TXHSD : 3;            //!< [14:12] Tx to Tx HS Delay
        uint32_t RESERVED1 : 17;       //!< [31:15] Reserved
    } B;
} hw_usbhs_usbmode_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_USBMODE register
 */
//@{
#define HW_USBHS_USBMODE_ADDR    (REGS_USBHS_BASE + 0x1A8U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_USBMODE         (*(__IO hw_usbhs_usbmode_t *) HW_USBHS_USBMODE_ADDR)
#define HW_USBHS_USBMODE_RD()    (HW_USBHS_USBMODE.U)
#define HW_USBHS_USBMODE_WR(v)   (HW_USBHS_USBMODE.U = (v))
#define HW_USBHS_USBMODE_SET(v)  (HW_USBHS_USBMODE_WR(HW_USBHS_USBMODE_RD() |  (v)))
#define HW_USBHS_USBMODE_CLR(v)  (HW_USBHS_USBMODE_WR(HW_USBHS_USBMODE_RD() & ~(v)))
#define HW_USBHS_USBMODE_TOG(v)  (HW_USBHS_USBMODE_WR(HW_USBHS_USBMODE_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_USBMODE bitfields
 */

/*!
 * @name Register USBHS_USBMODE, field CM[1:0] (RW)
 *
 * This register can be written only once after reset. If necessary to switch
 * modes, software must reset the controller by writing to the USBCMD[RST] bit
 * before reprogramming this register. The USBHS module must be initialized to the
 * desired operating mode after reset.
 *
 * Values:
 * - 00 - Idle (default for the USBHS module)
 * - 01 - Reserved
 * - 10 - Device controller
 * - 11 - Host controller
 */
//@{
#define BP_USBHS_USBMODE_CM  (0U)          //!< Bit position for USBHS_USBMODE_CM.
#define BM_USBHS_USBMODE_CM  (0x00000003U) //!< Bit mask for USBHS_USBMODE_CM.
#define BS_USBHS_USBMODE_CM  (2U)          //!< Bit field size in bits for USBHS_USBMODE_CM.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBMODE_CM field.
#define BR_USBHS_USBMODE_CM  (HW_USBHS_USBMODE.B.CM)
#endif

//! @brief Format value for bitfield USBHS_USBMODE_CM.
#define BF_USBHS_USBMODE_CM(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBMODE_CM), uint32_t) & BM_USBHS_USBMODE_CM)

#ifndef __LANGUAGE_ASM__
//! @brief Set the CM field to a new value.
#define BW_USBHS_USBMODE_CM(v) (HW_USBHS_USBMODE_WR((HW_USBHS_USBMODE_RD() & ~BM_USBHS_USBMODE_CM) | BF_USBHS_USBMODE_CM(v)))
#endif
//@}

/*!
 * @name Register USBHS_USBMODE, field ES[2] (RW)
 *
 * Controls the byte ordering of the transfer buffers to match the host
 * microprocessor bus architecture. The bit fields in the register interface and the DMA
 * data structures (including the setup buffer within the device QH) are
 * unaffected by the value of this bit, because they are based upon 32-bit words.
 *
 * Values:
 * - 0 - Little endian. First byte referenced in least significant byte of
 *     32-bit word.
 * - 1 - Big endian. First byte referenced in most significant byte of 32-bit
 *     word.
 */
//@{
#define BP_USBHS_USBMODE_ES  (2U)          //!< Bit position for USBHS_USBMODE_ES.
#define BM_USBHS_USBMODE_ES  (0x00000004U) //!< Bit mask for USBHS_USBMODE_ES.
#define BS_USBHS_USBMODE_ES  (1U)          //!< Bit field size in bits for USBHS_USBMODE_ES.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBMODE_ES field.
#define BR_USBHS_USBMODE_ES  (BITBAND_ACCESS32(HW_USBHS_USBMODE_ADDR, BP_USBHS_USBMODE_ES))
#endif

//! @brief Format value for bitfield USBHS_USBMODE_ES.
#define BF_USBHS_USBMODE_ES(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBMODE_ES), uint32_t) & BM_USBHS_USBMODE_ES)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ES field to a new value.
#define BW_USBHS_USBMODE_ES(v) (BITBAND_ACCESS32(HW_USBHS_USBMODE_ADDR, BP_USBHS_USBMODE_ES) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBMODE, field SLOM[3] (RW)
 *
 * For the module in device mode, this bit controls behavior of the setup lock
 * mechanism. See section "Control Endpoint Operation."
 */
//@{
#define BP_USBHS_USBMODE_SLOM (3U)         //!< Bit position for USBHS_USBMODE_SLOM.
#define BM_USBHS_USBMODE_SLOM (0x00000008U) //!< Bit mask for USBHS_USBMODE_SLOM.
#define BS_USBHS_USBMODE_SLOM (1U)         //!< Bit field size in bits for USBHS_USBMODE_SLOM.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBMODE_SLOM field.
#define BR_USBHS_USBMODE_SLOM (BITBAND_ACCESS32(HW_USBHS_USBMODE_ADDR, BP_USBHS_USBMODE_SLOM))
#endif

//! @brief Format value for bitfield USBHS_USBMODE_SLOM.
#define BF_USBHS_USBMODE_SLOM(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBMODE_SLOM), uint32_t) & BM_USBHS_USBMODE_SLOM)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SLOM field to a new value.
#define BW_USBHS_USBMODE_SLOM(v) (BITBAND_ACCESS32(HW_USBHS_USBMODE_ADDR, BP_USBHS_USBMODE_SLOM) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBMODE, field SDIS[4] (RW)
 *
 * Host mode: Setting this bit ensures that overruns/underruns of the latency
 * FIFO are eliminated for low bandwidth systems where the RX and TX buffers are
 * sufficient to contain the entire packet. Enabling stream disable also has the
 * effect of ensuring the TX latency fills to capacity before the packet launches
 * onto the USB. Time duration to pre-fill the FIFO becomes significant when
 * stream disable is active. See TXFILLTUNING to characterize the adjustments needed
 * for the scheduler when using this feature. Also, in systems with high system
 * bus utilization, setting this bit ensures no overruns or underruns during
 * operation at the expense of link utilization. SDIS can be left clear and the rules
 * under the description of the TXFILLTUNING register can limit underruns/overruns
 * for those who desire optimal link performance. Device mode: Setting this bit
 * disables double priming on RX and TX for low bandwidth systems. This mode
 * ensures that when the RX and TX buffers are sufficient to contain an entire packet
 * that the standard double buffering scheme is disabled to prevent
 * overruns/underruns in bandwidth limited systems. In high-speed mode, all packets received
 * are responded to with a NYET handshake when stream disable is active.
 *
 * Values:
 * - 0 - Inactive
 * - 1 - Active
 */
//@{
#define BP_USBHS_USBMODE_SDIS (4U)         //!< Bit position for USBHS_USBMODE_SDIS.
#define BM_USBHS_USBMODE_SDIS (0x00000010U) //!< Bit mask for USBHS_USBMODE_SDIS.
#define BS_USBHS_USBMODE_SDIS (1U)         //!< Bit field size in bits for USBHS_USBMODE_SDIS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBMODE_SDIS field.
#define BR_USBHS_USBMODE_SDIS (BITBAND_ACCESS32(HW_USBHS_USBMODE_ADDR, BP_USBHS_USBMODE_SDIS))
#endif

