ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_USBMODE_SDIS.
#define BF_USBHS_USBMODE_SDIS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBMODE_SDIS), uint32_t) & BM_USBHS_USBMODE_SDIS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the SDIS field to a new value.
#define BW_USBHS_USBMODE_SDIS(v) (BITBAND_ACCESS32(HW_USBHS_USBMODE_ADDR, BP_USBHS_USBMODE_SDIS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBMODE, field TXHSD[14:12] (RW)
 *
 * Controls the value of TX to TX HS Interpacket Delay by changing the internal
 * delay count. The value of the global TX to TX interpacket delay depends on
 * this internal counter and on the intrinsic PHY TX End Delay and TX Start Delay
 * values. The TX to TX interpacket gap must be within the interval [88,192] bit
 * times. 88 <= Controller internal delay - Tx End Delay + Tx Start Delay <= 192
 * (HS bit times) Below are the values of the internal controller counter in terms
 * of PHY clock cycles.
 *
 * Values:
 * - 000 - 10
 * - 001 - 11
 * - 010 - 12
 * - 011 - 13
 * - 100 - 14
 * - 101 - 15
 * - 110 - 16
 * - 111 - 17
 */
//@{
#define BP_USBHS_USBMODE_TXHSD (12U)       //!< Bit position for USBHS_USBMODE_TXHSD.
#define BM_USBHS_USBMODE_TXHSD (0x00007000U) //!< Bit mask for USBHS_USBMODE_TXHSD.
#define BS_USBHS_USBMODE_TXHSD (3U)        //!< Bit field size in bits for USBHS_USBMODE_TXHSD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBMODE_TXHSD field.
#define BR_USBHS_USBMODE_TXHSD (HW_USBHS_USBMODE.B.TXHSD)
#endif

//! @brief Format value for bitfield USBHS_USBMODE_TXHSD.
#define BF_USBHS_USBMODE_TXHSD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBMODE_TXHSD), uint32_t) & BM_USBHS_USBMODE_TXHSD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXHSD field to a new value.
#define BW_USBHS_USBMODE_TXHSD(v) (HW_USBHS_USBMODE_WR((HW_USBHS_USBMODE_RD() & ~BM_USBHS_USBMODE_TXHSD) | BF_USBHS_USBMODE_TXHSD(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPSETUPSR - Endpoint Setup Status Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPSETUPSR - Endpoint Setup Status Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register
 * contains the endpoint setup status and is used only in device mode.
 */
typedef union _hw_usbhs_epsetupsr
{
    uint32_t U;
    struct _hw_usbhs_epsetupsr_bitfields
    {
        uint32_t EPSETUPSTAT : 4;      //!< [3:0] Setup Endpoint Status
        uint32_t RESERVED0 : 28;       //!< [31:4] Reserved
    } B;
} hw_usbhs_epsetupsr_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPSETUPSR register
 */
//@{
#define HW_USBHS_EPSETUPSR_ADDR  (REGS_USBHS_BASE + 0x1ACU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPSETUPSR       (*(__IO hw_usbhs_epsetupsr_t *) HW_USBHS_EPSETUPSR_ADDR)
#define HW_USBHS_EPSETUPSR_RD()  (HW_USBHS_EPSETUPSR.U)
#define HW_USBHS_EPSETUPSR_WR(v) (HW_USBHS_EPSETUPSR.U = (v))
#define HW_USBHS_EPSETUPSR_SET(v) (HW_USBHS_EPSETUPSR_WR(HW_USBHS_EPSETUPSR_RD() |  (v)))
#define HW_USBHS_EPSETUPSR_CLR(v) (HW_USBHS_EPSETUPSR_WR(HW_USBHS_EPSETUPSR_RD() & ~(v)))
#define HW_USBHS_EPSETUPSR_TOG(v) (HW_USBHS_EPSETUPSR_WR(HW_USBHS_EPSETUPSR_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_EPSETUPSR bitfields
 */

/*!
 * @name Register USBHS_EPSETUPSR, field EPSETUPSTAT[3:0] (W1C)
 *
 * For every setup transaction received, a corresponding bit in this field is
 * set. This register is used only in device mode. Software must clear or
 * acknowledge the setup transfer by writing a 1 to a respective bit after it has read the
 * setup data from the queue head. The response to a setup packet, as in the
 * order of operations and total response time, is crucial to limit bus time outs
 * while the setup lockout mechanism engages.
 */
//@{
#define BP_USBHS_EPSETUPSR_EPSETUPSTAT (0U) //!< Bit position for USBHS_EPSETUPSR_EPSETUPSTAT.
#define BM_USBHS_EPSETUPSR_EPSETUPSTAT (0x0000000FU) //!< Bit mask for USBHS_EPSETUPSR_EPSETUPSTAT.
#define BS_USBHS_EPSETUPSR_EPSETUPSTAT (4U) //!< Bit field size in bits for USBHS_EPSETUPSR_EPSETUPSTAT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPSETUPSR_EPSETUPSTAT field.
#define BR_USBHS_EPSETUPSR_EPSETUPSTAT (HW_USBHS_EPSETUPSR.B.EPSETUPSTAT)
#endif

//! @brief Format value for bitfield USBHS_EPSETUPSR_EPSETUPSTAT.
#define BF_USBHS_EPSETUPSR_EPSETUPSTAT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPSETUPSR_EPSETUPSTAT), uint32_t) & BM_USBHS_EPSETUPSR_EPSETUPSTAT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the EPSETUPSTAT field to a new value.
#define BW_USBHS_EPSETUPSR_EPSETUPSTAT(v) (HW_USBHS_EPSETUPSR_WR((HW_USBHS_EPSETUPSR_RD() & ~BM_USBHS_EPSETUPSR_EPSETUPSTAT) | BF_USBHS_EPSETUPSR_EPSETUPSTAT(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPPRIME - Endpoint Initialization Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPPRIME - Endpoint Initialization Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register is used
 * to initialize endpoints and is used only in device mode.
 */
typedef union _hw_usbhs_epprime
{
    uint32_t U;
    struct _hw_usbhs_epprime_bitfields
    {
        uint32_t PERB : 4;             //!< [3:0] Prime Endpoint Receive Buffer
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t PETB : 4;             //!< [19:16] Prime Endpoint tTansmit Buffer
        uint32_t RESERVED1 : 12;       //!< [31:20] Reserved
    } B;
} hw_usbhs_epprime_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPPRIME register
 */
//@{
#define HW_USBHS_EPPRIME_ADDR    (REGS_USBHS_BASE + 0x1B0U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPPRIME         (*(__IO hw_usbhs_epprime_t *) HW_USBHS_EPPRIME_ADDR)
#define HW_USBHS_EPPRIME_RD()    (HW_USBHS_EPPRIME.U)
#define HW_USBHS_EPPRIME_WR(v)   (HW_USBHS_EPPRIME.U = (v))
#define HW_USBHS_EPPRIME_SET(v)  (HW_USBHS_EPPRIME_WR(HW_USBHS_EPPRIME_RD() |  (v)))
#define HW_USBHS_EPPRIME_CLR(v)  (HW_USBHS_EPPRIME_WR(HW_USBHS_EPPRIME_RD() & ~(v)))
#define HW_USBHS_EPPRIME_TOG(v)  (HW_USBHS_EPPRIME_WR(HW_USBHS_EPPRIME_RD() ^  (v)))
#endif
//@}

