ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_EPPRIME bitfields
 */

/*!
 * @name Register USBHS_EPPRIME, field PERB[3:0] (RW)
 *
 * For each endpoint, a corresponding bit requests that a buffer be prepared for
 * a receive operation to respond to a USB OUT transaction. Software must write
 * a 1 to the corresponding bit when posting a new transfer descriptor to an
 * endpoint. Hardware automatically uses this bit to begin parsing for a new transfer
 * descriptor from the queue head and prepare a receive buffer. Hardware clears
 * this bit when associated endpoint(s) is (are) successfully primed. These bits
 * are momentarily set by hardware during hardware re-priming operations when a
 * dTD retires, and the dQH updates.
 */
//@{
#define BP_USBHS_EPPRIME_PERB (0U)         //!< Bit position for USBHS_EPPRIME_PERB.
#define BM_USBHS_EPPRIME_PERB (0x0000000FU) //!< Bit mask for USBHS_EPPRIME_PERB.
#define BS_USBHS_EPPRIME_PERB (4U)         //!< Bit field size in bits for USBHS_EPPRIME_PERB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPPRIME_PERB field.
#define BR_USBHS_EPPRIME_PERB (HW_USBHS_EPPRIME.B.PERB)
#endif

//! @brief Format value for bitfield USBHS_EPPRIME_PERB.
#define BF_USBHS_EPPRIME_PERB(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPPRIME_PERB), uint32_t) & BM_USBHS_EPPRIME_PERB)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PERB field to a new value.
#define BW_USBHS_EPPRIME_PERB(v) (HW_USBHS_EPPRIME_WR((HW_USBHS_EPPRIME_RD() & ~BM_USBHS_EPPRIME_PERB) | BF_USBHS_EPPRIME_PERB(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPPRIME, field PETB[19:16] (RW)
 *
 * For each endpoint, a corresponding bit requests that a buffer be prepared for
 * a transmit operation to respond to a USB IN/INTERRUPT transaction. Software
 * must write a 1 to the corresponding bit when posting a new transfer descriptor
 * to an endpoint. Hardware automatically uses this bit to begin parsing for a
 * new transfer descriptor from the queue head and prepare a transmit buffer.
 * Hardware clears this bit when associated endpoint(s) is (are) successfully primed.
 * These bits are momentarily set by hardware during hardware re-priming
 * operations when a dTD retires, and the dQH updates.
 */
//@{
#define BP_USBHS_EPPRIME_PETB (16U)        //!< Bit position for USBHS_EPPRIME_PETB.
#define BM_USBHS_EPPRIME_PETB (0x000F0000U) //!< Bit mask for USBHS_EPPRIME_PETB.
#define BS_USBHS_EPPRIME_PETB (4U)         //!< Bit field size in bits for USBHS_EPPRIME_PETB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPPRIME_PETB field.
#define BR_USBHS_EPPRIME_PETB (HW_USBHS_EPPRIME.B.PETB)
#endif

//! @brief Format value for bitfield USBHS_EPPRIME_PETB.
#define BF_USBHS_EPPRIME_PETB(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPPRIME_PETB), uint32_t) & BM_USBHS_EPPRIME_PETB)

#ifndef __LANGUAGE_ASM__
//! @brief Set the PETB field to a new value.
#define BW_USBHS_EPPRIME_PETB(v) (HW_USBHS_EPPRIME_WR((HW_USBHS_EPPRIME_RD() & ~BM_USBHS_EPPRIME_PETB) | BF_USBHS_EPPRIME_PETB(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPFLUSH - Endpoint Flush Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPFLUSH - Endpoint Flush Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register used
 * only in device mode.
 */
typedef union _hw_usbhs_epflush
{
    uint32_t U;
    struct _hw_usbhs_epflush_bitfields
    {
        uint32_t FERB : 4;             //!< [3:0] Flush Endpoint Receive Buffer
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t FETB : 4;             //!< [19:16] Flush Endpoint Transmit Buffer
        uint32_t RESERVED1 : 12;       //!< [31:20] Reserved
    } B;
} hw_usbhs_epflush_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPFLUSH register
 */
//@{
#define HW_USBHS_EPFLUSH_ADDR    (REGS_USBHS_BASE + 0x1B4U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPFLUSH         (*(__IO hw_usbhs_epflush_t *) HW_USBHS_EPFLUSH_ADDR)
#define HW_USBHS_EPFLUSH_RD()    (HW_USBHS_EPFLUSH.U)
#define HW_USBHS_EPFLUSH_WR(v)   (HW_USBHS_EPFLUSH.U = (v))
#define HW_USBHS_EPFLUSH_SET(v)  (HW_USBHS_EPFLUSH_WR(HW_USBHS_EPFLUSH_RD() |  (v)))
#define HW_USBHS_EPFLUSH_CLR(v)  (HW_USBHS_EPFLUSH_WR(HW_USBHS_EPFLUSH_RD() & ~(v)))
#define HW_USBHS_EPFLUSH_TOG(v)  (HW_USBHS_EPFLUSH_WR(HW_USBHS_EPFLUSH_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_EPFLUSH bitfields
 */

/*!
 * @name Register USBHS_EPFLUSH, field FERB[3:0] (RW)
 *
 * Writing a 1 to a bit in this field causes the associated endpoint to clear
 * any primed buffers. If a packet is in progress for an associated endpoint, that
 * transfer continues until completion. Hardware clears this register after the
 * endpoint flush operation is successful. FERB[3] corresponds to endpoint 3.
 */
//@{
#define BP_USBHS_EPFLUSH_FERB (0U)         //!< Bit position for USBHS_EPFLUSH_FERB.
#define BM_USBHS_EPFLUSH_FERB (0x0000000FU) //!< Bit mask for USBHS_EPFLUSH_FERB.
#define BS_USBHS_EPFLUSH_FERB (4U)         //!< Bit field size in bits for USBHS_EPFLUSH_FERB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPFLUSH_FERB field.
#define BR_USBHS_EPFLUSH_FERB (HW_USBHS_EPFLUSH.B.FERB)
#endif

//! @brief Format value for bitfield USBHS_EPFLUSH_FERB.
#define BF_USBHS_EPFLUSH_FERB(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPFLUSH_FERB), uint32_t) & BM_USBHS_EPFLUSH_FERB)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FERB field to a new value.
#define BW_USBHS_EPFLUSH_FERB(v) (HW_USBHS_EPFLUSH_WR((HW_USBHS_EPFLUSH_RD() & ~BM_USBHS_EPFLUSH_FERB) | BF_USBHS_EPFLUSH_FERB(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPFLUSH, field FETB[19:16] (RW)
 *
 * Writing a 1 to a bit in this field causes the associated endpoint to clear
 * any primed buffers. If a packet is in progress for an associated endpoint, that
 * transfer continues until completion. Hardware clears this register after the
 * endpoint flush operation is successful.
 */
//@{
#define BP_USBHS_EPFLUSH_FETB (16U)        //!< Bit position for USBHS_EPFLUSH_FETB.
#define BM_USBHS_EPFLUSH_FETB (0x000F0000U) //!< Bit mask for USBHS_EPFLUSH_FETB.
#define BS_USBHS_EPFLUSH_FETB (4U)         //!< Bit field size in bits for USBHS_EPFLUSH_FETB.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPFLUSH_FETB field.
#define BR_USBHS_EPFLUSH_FETB (HW_USBHS_EPFLUSH.B.FETB)
#endif

//! @brief Format value for bitfield USBHS_EPFLUSH_FETB.
#define BF_USBHS_EPFLUSH_FETB(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPFLUSH_FETB), uint32_t) & BM_USBHS_EPFLUSH_FETB)

#ifndef __LANGUAGE_ASM__
//! @brief Set the FETB field to a new value.
#define BW_USBHS_EPFLUSH_FETB(v) (HW_USBHS_EPFLUSH_WR((HW_USBHS_EPFLUSH_RD() & ~BM_USBHS_EPFLUSH_FETB) | BF_USBHS_EPFLUSH_FETB(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPSR - Endpoint Status Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPSR - Endpoint Status Register (RO)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register is only
 * used in device mode.
 */
typedef union _hw_usbhs_epsr
{
    uint32_t U;
    struct _hw_usbhs_epsr_bitfields
    {
        uint32_t ERBR : 4;             //!< [3:0] Endpoint Receive Buffer Ready
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t ETBR : 4;             //!< [19:16] Endpoint Transmit Buffer Ready
        uint32_t RESERVED1 : 12;       //!< [31:20] Reserved
    } B;
} hw_usbhs_epsr_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPSR register
 */
//@{
#define HW_USBHS_EPSR_ADDR       (REGS_USBHS_BASE + 0x1B8U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPSR            (*(__I hw_usbhs_epsr_t *) HW_USBHS_EPSR_ADDR)
#define HW_USBHS_EPSR_RD()       (HW_USBHS_EPSR.U)
#endif
//@}

