ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_EPSR bitfields
 */

/*!
 * @name Register USBHS_EPSR, field ERBR[3:0] (RO)
 *
 * One bit for each endpoint indicates status of the respective endpoint buffer.
 * The hardware sets this bit in response to receiving a command from a
 * corresponding bit in the EPPRIME register. A constant delay exists between setting a
 * bit in the EPPRIME register and endpoint indicating ready. This delay time
 * varies based upon the current USB traffic and the number of bits set in the
 * EPPRIME register. USB reset, USB DMA system, or EPFLUSH register clears the buffer
 * ready. ERBR[3] (bit 19) corresponds to endpoint 3. Hardware momentarily clears
 * these bits during hardware endpoint re-priming operations when a dTD is
 * retired, and the dQH is updated.
 */
//@{
#define BP_USBHS_EPSR_ERBR   (0U)          //!< Bit position for USBHS_EPSR_ERBR.
#define BM_USBHS_EPSR_ERBR   (0x0000000FU) //!< Bit mask for USBHS_EPSR_ERBR.
#define BS_USBHS_EPSR_ERBR   (4U)          //!< Bit field size in bits for USBHS_EPSR_ERBR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPSR_ERBR field.
#define BR_USBHS_EPSR_ERBR   (HW_USBHS_EPSR.B.ERBR)
#endif
//@}

/*!
 * @name Register USBHS_EPSR, field ETBR[19:16] (RO)
 *
 * One bit for each endpoint indicates status of the respective endpoint buffer.
 * The hardware sets this bit in response to receiving a command from a
 * corresponding bit in the EPPRIME register. A constant delay exists between setting a
 * bit in the EPPRIME register and endpoint indicating ready. This delay time
 * varies based upon the current USB traffic and the number of bits set in the
 * EPPRIME register. USB reset, USB DMA system, or EPFLUSH register clears the buffer
 * ready. ETBR[3] (bit 19) corresponds to endpoint 3. Hardware momentarily clears
 * these bits during hardware endpoint re-priming operations when a dTD is
 * retired, and the dQH is updated.
 */
//@{
#define BP_USBHS_EPSR_ETBR   (16U)         //!< Bit position for USBHS_EPSR_ETBR.
#define BM_USBHS_EPSR_ETBR   (0x000F0000U) //!< Bit mask for USBHS_EPSR_ETBR.
#define BS_USBHS_EPSR_ETBR   (4U)          //!< Bit field size in bits for USBHS_EPSR_ETBR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPSR_ETBR field.
#define BR_USBHS_EPSR_ETBR   (HW_USBHS_EPSR.B.ETBR)
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPCOMPLETE - Endpoint Complete Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPCOMPLETE - Endpoint Complete Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification. This register is used
 * only in device mode.
 */
typedef union _hw_usbhs_epcomplete
{
    uint32_t U;
    struct _hw_usbhs_epcomplete_bitfields
    {
        uint32_t ERCE : 4;             //!< [3:0] Endpoint Receive Complete Event
        uint32_t RESERVED0 : 12;       //!< [15:4] Reserved
        uint32_t ETCE : 4;             //!< [19:16] Endpoint Transmit Complete Event
        uint32_t RESERVED1 : 12;       //!< [31:20] Reserved
    } B;
} hw_usbhs_epcomplete_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPCOMPLETE register
 */
//@{
#define HW_USBHS_EPCOMPLETE_ADDR (REGS_USBHS_BASE + 0x1BCU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPCOMPLETE      (*(__IO hw_usbhs_epcomplete_t *) HW_USBHS_EPCOMPLETE_ADDR)
#define HW_USBHS_EPCOMPLETE_RD() (HW_USBHS_EPCOMPLETE.U)
#define HW_USBHS_EPCOMPLETE_WR(v) (HW_USBHS_EPCOMPLETE.U = (v))
#define HW_USBHS_EPCOMPLETE_SET(v) (HW_USBHS_EPCOMPLETE_WR(HW_USBHS_EPCOMPLETE_RD() |  (v)))
#define HW_USBHS_EPCOMPLETE_CLR(v) (HW_USBHS_EPCOMPLETE_WR(HW_USBHS_EPCOMPLETE_RD() & ~(v)))
#define HW_USBHS_EPCOMPLETE_TOG(v) (HW_USBHS_EPCOMPLETE_WR(HW_USBHS_EPCOMPLETE_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_EPCOMPLETE bitfields
 */

/*!
 * @name Register USBHS_EPCOMPLETE, field ERCE[3:0] (W1C)
 *
 * Each bit indicates a received event (OUT/SETUP) occurs and software must read
 * the corresponding endpoint queue to determine the transfer status. If the
 * corresponding IOC bit is set in the transfer descriptor, this bit is set
 * simultaneously with the USBINT. Writing a 1 clears the corresponding bit in this
 * register. ERCE[3] corresponds to endpoint 3.
 */
//@{
#define BP_USBHS_EPCOMPLETE_ERCE (0U)      //!< Bit position for USBHS_EPCOMPLETE_ERCE.
#define BM_USBHS_EPCOMPLETE_ERCE (0x0000000FU) //!< Bit mask for USBHS_EPCOMPLETE_ERCE.
#define BS_USBHS_EPCOMPLETE_ERCE (4U)      //!< Bit field size in bits for USBHS_EPCOMPLETE_ERCE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCOMPLETE_ERCE field.
#define BR_USBHS_EPCOMPLETE_ERCE (HW_USBHS_EPCOMPLETE.B.ERCE)
#endif

//! @brief Format value for bitfield USBHS_EPCOMPLETE_ERCE.
#define BF_USBHS_EPCOMPLETE_ERCE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCOMPLETE_ERCE), uint32_t) & BM_USBHS_EPCOMPLETE_ERCE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ERCE field to a new value.
#define BW_USBHS_EPCOMPLETE_ERCE(v) (HW_USBHS_EPCOMPLETE_WR((HW_USBHS_EPCOMPLETE_RD() & ~BM_USBHS_EPCOMPLETE_ERCE) | BF_USBHS_EPCOMPLETE_ERCE(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCOMPLETE, field ETCE[19:16] (W1C)
 *
 * Each bit indicates a transmit event (IN/INTERRUPT) occurs and software must
 * read the corresponding endpoint queue to determine the endpoint status. If the
 * corresponding IOC bit is set in the transfer descriptor, this bit is set
 * simultaneously with the USBINT. Writing a 1 clears the corresponding bit in this
 * register. ETCE[3] (bit 19) corresponds to endpoint 3.
 */
//@{
#define BP_USBHS_EPCOMPLETE_ETCE (16U)     //!< Bit position for USBHS_EPCOMPLETE_ETCE.
#define BM_USBHS_EPCOMPLETE_ETCE (0x000F0000U) //!< Bit mask for USBHS_EPCOMPLETE_ETCE.
#define BS_USBHS_EPCOMPLETE_ETCE (4U)      //!< Bit field size in bits for USBHS_EPCOMPLETE_ETCE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCOMPLETE_ETCE field.
#define BR_USBHS_EPCOMPLETE_ETCE (HW_USBHS_EPCOMPLETE.B.ETCE)
#endif

//! @brief Format value for bitfield USBHS_EPCOMPLETE_ETCE.
#define BF_USBHS_EPCOMPLETE_ETCE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCOMPLETE_ETCE), uint32_t) & BM_USBHS_EPCOMPLETE_ETCE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the ETCE field to a new value.
#define BW_USBHS_EPCOMPLETE_ETCE(v) (HW_USBHS_EPCOMPLETE_WR((HW_USBHS_EPCOMPLETE_RD() & ~BM_USBHS_EPCOMPLETE_ETCE) | BF_USBHS_EPCOMPLETE_ETCE(v)))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPCR0 - Endpoint Control Register 0
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPCR0 - Endpoint Control Register 0 (RW)
 *
 * Reset value: 0x00800080U
 *
 * This register is not defined in the EHCI specification. Every device
 * implements endpoint 0 as a control endpoint.
 */
typedef union _hw_usbhs_epcr0
{
    uint32_t U;
    struct _hw_usbhs_epcr0_bitfields
    {
        uint32_t RXS : 1;              //!< [0] RX endpoint Stall
        uint32_t RESERVED0 : 1;        //!< [1] Reserved
        uint32_t RXT : 2;              //!< [3:2] RX endpoint Type
        uint32_t RESERVED1 : 3;        //!< [6:4] Reserved
        uint32_t RXE : 1;              //!< [7] RX endpoint Enable
        uint32_t RESERVED2 : 8;        //!< [15:8] Reserved
        uint32_t TXS : 1;              //!< [16] TX Endpoint Stall
        uint32_t RESERVED3 : 1;        //!< [17] Reserved
        uint32_t TXT : 2;              //!< [19:18] TX Endpoint Type
        uint32_t RESERVED4 : 3;        //!< [22:20] Reserved
        uint32_t TXE : 1;              //!< [23] TX Endpoint Enable
        uint32_t RESERVED5 : 8;        //!< [31:24] This register is not defined in
                                       //! the EHCI specification. Every device implements endpoint 0 as a
                                       //! control endpoint.
    } B;
} hw_usbhs_epcr0_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPCR0 register
 */
//@{
#define HW_USBHS_EPCR0_ADDR      (REGS_USBHS_BASE + 0x1C0U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPCR0           (*(__IO hw_usbhs_epcr0_t *) HW_USBHS_EPCR0_ADDR)
#define HW_USBHS_EPCR0_RD()      (HW_USBHS_EPCR0.U)
#define HW_USBHS_EPCR0_WR(v)     (HW_USBHS_EPCR0.U = (v))
#define HW_USBHS_EPCR0_SET(v)    (HW_USBHS_EPCR0_WR(HW_USBHS_EPCR0_RD() |  (v)))
#define HW_USBHS_EPCR0_CLR(v)    (HW_USBHS_EPCR0_WR(HW_USBHS_EPCR0_RD() & ~(v)))
#define HW_USBHS_EPCR0_TOG(v)    (HW_USBHS_EPCR0_WR(HW_USBHS_EPCR0_RD() ^  (v)))
#endif
//@}

