ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_EPCR0 bitfields
 */

/*!
 * @name Register USBHS_EPCR0, field RXS[0] (RW)
 *
 * Software can write a 1 to this bit to force the endpoint to return a STALL
 * handshake to the host. It continues returning STALL until software clears the
 * bit or it automatically clears upon receipt of a new SETUP request.
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR0_RXS   (0U)          //!< Bit position for USBHS_EPCR0_RXS.
#define BM_USBHS_EPCR0_RXS   (0x00000001U) //!< Bit mask for USBHS_EPCR0_RXS.
#define BS_USBHS_EPCR0_RXS   (1U)          //!< Bit field size in bits for USBHS_EPCR0_RXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR0_RXS field.
#define BR_USBHS_EPCR0_RXS   (BITBAND_ACCESS32(HW_USBHS_EPCR0_ADDR, BP_USBHS_EPCR0_RXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR0_RXS.
#define BF_USBHS_EPCR0_RXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR0_RXS), uint32_t) & BM_USBHS_EPCR0_RXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXS field to a new value.
#define BW_USBHS_EPCR0_RXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR0_ADDR, BP_USBHS_EPCR0_RXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR0, field RXT[3:2] (RO)
 *
 * Endpoint zero is always a control endpoint.
 *
 * Values:
 * - 00 - Control
 */
//@{
#define BP_USBHS_EPCR0_RXT   (2U)          //!< Bit position for USBHS_EPCR0_RXT.
#define BM_USBHS_EPCR0_RXT   (0x0000000CU) //!< Bit mask for USBHS_EPCR0_RXT.
#define BS_USBHS_EPCR0_RXT   (2U)          //!< Bit field size in bits for USBHS_EPCR0_RXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR0_RXT field.
#define BR_USBHS_EPCR0_RXT   (HW_USBHS_EPCR0.B.RXT)
#endif
//@}

/*!
 * @name Register USBHS_EPCR0, field RXE[7] (RO)
 *
 * Endpoint zero is always enabled.
 *
 * Values:
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR0_RXE   (7U)          //!< Bit position for USBHS_EPCR0_RXE.
#define BM_USBHS_EPCR0_RXE   (0x00000080U) //!< Bit mask for USBHS_EPCR0_RXE.
#define BS_USBHS_EPCR0_RXE   (1U)          //!< Bit field size in bits for USBHS_EPCR0_RXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR0_RXE field.
#define BR_USBHS_EPCR0_RXE   (BITBAND_ACCESS32(HW_USBHS_EPCR0_ADDR, BP_USBHS_EPCR0_RXE))
#endif
//@}

/*!
 * @name Register USBHS_EPCR0, field TXS[16] (RW)
 *
 * Software can write a 1 to this bit to force the endpoint to return a STALL
 * handshake to the host. It continues returning STALL until software clears the
 * bit or it automatically clears upon receipt of a new SETUP request.
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR0_TXS   (16U)         //!< Bit position for USBHS_EPCR0_TXS.
#define BM_USBHS_EPCR0_TXS   (0x00010000U) //!< Bit mask for USBHS_EPCR0_TXS.
#define BS_USBHS_EPCR0_TXS   (1U)          //!< Bit field size in bits for USBHS_EPCR0_TXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR0_TXS field.
#define BR_USBHS_EPCR0_TXS   (BITBAND_ACCESS32(HW_USBHS_EPCR0_ADDR, BP_USBHS_EPCR0_TXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR0_TXS.
#define BF_USBHS_EPCR0_TXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR0_TXS), uint32_t) & BM_USBHS_EPCR0_TXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXS field to a new value.
#define BW_USBHS_EPCR0_TXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR0_ADDR, BP_USBHS_EPCR0_TXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR0, field TXT[19:18] (RO)
 *
 * Endpoint zero is always a control endpoint.
 *
 * Values:
 * - 00 - Control
 */
//@{
#define BP_USBHS_EPCR0_TXT   (18U)         //!< Bit position for USBHS_EPCR0_TXT.
#define BM_USBHS_EPCR0_TXT   (0x000C0000U) //!< Bit mask for USBHS_EPCR0_TXT.
#define BS_USBHS_EPCR0_TXT   (2U)          //!< Bit field size in bits for USBHS_EPCR0_TXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR0_TXT field.
#define BR_USBHS_EPCR0_TXT   (HW_USBHS_EPCR0.B.TXT)
#endif
//@}

/*!
 * @name Register USBHS_EPCR0, field TXE[23] (RO)
 *
 * Endpoint zero is always enabled.
 *
 * Values:
 * - 1 - Enable
 */
//@{
#define BP_USBHS_EPCR0_TXE   (23U)         //!< Bit position for USBHS_EPCR0_TXE.
#define BM_USBHS_EPCR0_TXE   (0x00800000U) //!< Bit mask for USBHS_EPCR0_TXE.
#define BS_USBHS_EPCR0_TXE   (1U)          //!< Bit field size in bits for USBHS_EPCR0_TXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR0_TXE field.
#define BR_USBHS_EPCR0_TXE   (BITBAND_ACCESS32(HW_USBHS_EPCR0_ADDR, BP_USBHS_EPCR0_TXE))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_EPCR1 - Endpoint Control Register n
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPCR1 - Endpoint Control Register n (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers are not defined in the EHCI specification. There is an EPCRn
 * register for each endpoint in a device.
 */
typedef union _hw_usbhs_epcr1
{
    uint32_t U;
    struct _hw_usbhs_epcr1_bitfields
    {
        uint32_t RXS : 1;              //!< [0] RX endpoint Stall
        uint32_t RXD : 1;              //!< [1] RX endpoint Data sink
        uint32_t RXT : 2;              //!< [3:2] RX endpoint Type
        uint32_t RESERVED0 : 1;        //!< [4] Reserved
        uint32_t RXI : 1;              //!< [5] RX data toggle Inhibit
        uint32_t RXR : 1;              //!< [6] RX data toggle Reset
        uint32_t RXE : 1;              //!< [7] RX endpoint Enable
        uint32_t RESERVED1 : 8;        //!< [15:8] Reserved
        uint32_t TXS : 1;              //!< [16] TX endpoint Stall
        uint32_t TXD : 1;              //!< [17] TX endpoint Data source
        uint32_t TXT : 2;              //!< [19:18] TX endpoint Type
        uint32_t RESERVED2 : 1;        //!< [20] Reserved
        uint32_t TXI : 1;              //!< [21] TX data toggle Inhibit
        uint32_t TXR : 1;              //!< [22] TX data toggle Reset
        uint32_t TXE : 1;              //!< [23] TX endpoint Enable
        uint32_t RESERVED3 : 8;        //!< [31:24] Reserved
    } B;
} hw_usbhs_epcr1_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPCR1 register
 */
//@{
#define HW_USBHS_EPCR1_ADDR      (REGS_USBHS_BASE + 0x1C4U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPCR1           (*(__IO hw_usbhs_epcr1_t *) HW_USBHS_EPCR1_ADDR)
#define HW_USBHS_EPCR1_RD()      (HW_USBHS_EPCR1.U)
#define HW_USBHS_EPCR1_WR(v)     (HW_USBHS_EPCR1.U = (v))
#define HW_USBHS_EPCR1_SET(v)    (HW_USBHS_EPCR1_WR(HW_USBHS_EPCR1_RD() |  (v)))
#define HW_USBHS_EPCR1_CLR(v)    (HW_USBHS_EPCR1_WR(HW_USBHS_EPCR1_RD() & ~(v)))
#define HW_USBHS_EPCR1_TOG(v)    (HW_USBHS_EPCR1_WR(HW_USBHS_EPCR1_RD() ^  (v)))
#endif
//@}

