ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_EPCR1 bitfields
 */

/*!
 * @name Register USBHS_EPCR1, field RXS[0] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR1_RXS   (0U)          //!< Bit position for USBHS_EPCR1_RXS.
#define BM_USBHS_EPCR1_RXS   (0x00000001U) //!< Bit mask for USBHS_EPCR1_RXS.
#define BS_USBHS_EPCR1_RXS   (1U)          //!< Bit field size in bits for USBHS_EPCR1_RXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_RXS field.
#define BR_USBHS_EPCR1_RXS   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_RXS.
#define BF_USBHS_EPCR1_RXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_RXS), uint32_t) & BM_USBHS_EPCR1_RXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXS field to a new value.
#define BW_USBHS_EPCR1_RXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field RXD[1] (RW)
 */
//@{
#define BP_USBHS_EPCR1_RXD   (1U)          //!< Bit position for USBHS_EPCR1_RXD.
#define BM_USBHS_EPCR1_RXD   (0x00000002U) //!< Bit mask for USBHS_EPCR1_RXD.
#define BS_USBHS_EPCR1_RXD   (1U)          //!< Bit field size in bits for USBHS_EPCR1_RXD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_RXD field.
#define BR_USBHS_EPCR1_RXD   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXD))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_RXD.
#define BF_USBHS_EPCR1_RXD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_RXD), uint32_t) & BM_USBHS_EPCR1_RXD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXD field to a new value.
#define BW_USBHS_EPCR1_RXD(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field RXT[3:2] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
//@{
#define BP_USBHS_EPCR1_RXT   (2U)          //!< Bit position for USBHS_EPCR1_RXT.
#define BM_USBHS_EPCR1_RXT   (0x0000000CU) //!< Bit mask for USBHS_EPCR1_RXT.
#define BS_USBHS_EPCR1_RXT   (2U)          //!< Bit field size in bits for USBHS_EPCR1_RXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_RXT field.
#define BR_USBHS_EPCR1_RXT   (HW_USBHS_EPCR1.B.RXT)
#endif

//! @brief Format value for bitfield USBHS_EPCR1_RXT.
#define BF_USBHS_EPCR1_RXT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_RXT), uint32_t) & BM_USBHS_EPCR1_RXT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXT field to a new value.
#define BW_USBHS_EPCR1_RXT(v) (HW_USBHS_EPCR1_WR((HW_USBHS_EPCR1_RD() & ~BM_USBHS_EPCR1_RXT) | BF_USBHS_EPCR1_RXT(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field RXI[5] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
//@{
#define BP_USBHS_EPCR1_RXI   (5U)          //!< Bit position for USBHS_EPCR1_RXI.
#define BM_USBHS_EPCR1_RXI   (0x00000020U) //!< Bit mask for USBHS_EPCR1_RXI.
#define BS_USBHS_EPCR1_RXI   (1U)          //!< Bit field size in bits for USBHS_EPCR1_RXI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_RXI field.
#define BR_USBHS_EPCR1_RXI   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXI))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_RXI.
#define BF_USBHS_EPCR1_RXI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_RXI), uint32_t) & BM_USBHS_EPCR1_RXI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXI field to a new value.
#define BW_USBHS_EPCR1_RXI(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field RXR[6] (WO)
 */
//@{
#define BP_USBHS_EPCR1_RXR   (6U)          //!< Bit position for USBHS_EPCR1_RXR.
#define BM_USBHS_EPCR1_RXR   (0x00000040U) //!< Bit mask for USBHS_EPCR1_RXR.
#define BS_USBHS_EPCR1_RXR   (1U)          //!< Bit field size in bits for USBHS_EPCR1_RXR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_RXR field.
#define BR_USBHS_EPCR1_RXR   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXR))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_RXR.
#define BF_USBHS_EPCR1_RXR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_RXR), uint32_t) & BM_USBHS_EPCR1_RXR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXR field to a new value.
#define BW_USBHS_EPCR1_RXR(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field RXE[7] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR1_RXE   (7U)          //!< Bit position for USBHS_EPCR1_RXE.
#define BM_USBHS_EPCR1_RXE   (0x00000080U) //!< Bit mask for USBHS_EPCR1_RXE.
#define BS_USBHS_EPCR1_RXE   (1U)          //!< Bit field size in bits for USBHS_EPCR1_RXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_RXE field.
#define BR_USBHS_EPCR1_RXE   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXE))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_RXE.
#define BF_USBHS_EPCR1_RXE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_RXE), uint32_t) & BM_USBHS_EPCR1_RXE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXE field to a new value.
#define BW_USBHS_EPCR1_RXE(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_RXE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field TXS[16] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR1_TXS   (16U)         //!< Bit position for USBHS_EPCR1_TXS.
#define BM_USBHS_EPCR1_TXS   (0x00010000U) //!< Bit mask for USBHS_EPCR1_TXS.
#define BS_USBHS_EPCR1_TXS   (1U)          //!< Bit field size in bits for USBHS_EPCR1_TXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_TXS field.
#define BR_USBHS_EPCR1_TXS   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_TXS.
#define BF_USBHS_EPCR1_TXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_TXS), uint32_t) & BM_USBHS_EPCR1_TXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXS field to a new value.
#define BW_USBHS_EPCR1_TXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field TXD[17] (RW)
 */
//@{
#define BP_USBHS_EPCR1_TXD   (17U)         //!< Bit position for USBHS_EPCR1_TXD.
#define BM_USBHS_EPCR1_TXD   (0x00020000U) //!< Bit mask for USBHS_EPCR1_TXD.
#define BS_USBHS_EPCR1_TXD   (1U)          //!< Bit field size in bits for USBHS_EPCR1_TXD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_TXD field.
#define BR_USBHS_EPCR1_TXD   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXD))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_TXD.
#define BF_USBHS_EPCR1_TXD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_TXD), uint32_t) & BM_USBHS_EPCR1_TXD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXD field to a new value.
#define BW_USBHS_EPCR1_TXD(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field TXT[19:18] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
//@{
#define BP_USBHS_EPCR1_TXT   (18U)         //!< Bit position for USBHS_EPCR1_TXT.
#define BM_USBHS_EPCR1_TXT   (0x000C0000U) //!< Bit mask for USBHS_EPCR1_TXT.
#define BS_USBHS_EPCR1_TXT   (2U)          //!< Bit field size in bits for USBHS_EPCR1_TXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_TXT field.
#define BR_USBHS_EPCR1_TXT   (HW_USBHS_EPCR1.B.TXT)
#endif

