ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_EPCR1_TXT.
#define BF_USBHS_EPCR1_TXT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_TXT), uint32_t) & BM_USBHS_EPCR1_TXT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXT field to a new value.
#define BW_USBHS_EPCR1_TXT(v) (HW_USBHS_EPCR1_WR((HW_USBHS_EPCR1_RD() & ~BM_USBHS_EPCR1_TXT) | BF_USBHS_EPCR1_TXT(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field TXI[21] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
//@{
#define BP_USBHS_EPCR1_TXI   (21U)         //!< Bit position for USBHS_EPCR1_TXI.
#define BM_USBHS_EPCR1_TXI   (0x00200000U) //!< Bit mask for USBHS_EPCR1_TXI.
#define BS_USBHS_EPCR1_TXI   (1U)          //!< Bit field size in bits for USBHS_EPCR1_TXI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_TXI field.
#define BR_USBHS_EPCR1_TXI   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXI))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_TXI.
#define BF_USBHS_EPCR1_TXI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_TXI), uint32_t) & BM_USBHS_EPCR1_TXI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXI field to a new value.
#define BW_USBHS_EPCR1_TXI(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field TXR[22] (WO)
 */
//@{
#define BP_USBHS_EPCR1_TXR   (22U)         //!< Bit position for USBHS_EPCR1_TXR.
#define BM_USBHS_EPCR1_TXR   (0x00400000U) //!< Bit mask for USBHS_EPCR1_TXR.
#define BS_USBHS_EPCR1_TXR   (1U)          //!< Bit field size in bits for USBHS_EPCR1_TXR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_TXR field.
#define BR_USBHS_EPCR1_TXR   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXR))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_TXR.
#define BF_USBHS_EPCR1_TXR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_TXR), uint32_t) & BM_USBHS_EPCR1_TXR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXR field to a new value.
#define BW_USBHS_EPCR1_TXR(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR1, field TXE[23] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR1_TXE   (23U)         //!< Bit position for USBHS_EPCR1_TXE.
#define BM_USBHS_EPCR1_TXE   (0x00800000U) //!< Bit mask for USBHS_EPCR1_TXE.
#define BS_USBHS_EPCR1_TXE   (1U)          //!< Bit field size in bits for USBHS_EPCR1_TXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR1_TXE field.
#define BR_USBHS_EPCR1_TXE   (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXE))
#endif

//! @brief Format value for bitfield USBHS_EPCR1_TXE.
#define BF_USBHS_EPCR1_TXE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR1_TXE), uint32_t) & BM_USBHS_EPCR1_TXE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXE field to a new value.
#define BW_USBHS_EPCR1_TXE(v) (BITBAND_ACCESS32(HW_USBHS_EPCR1_ADDR, BP_USBHS_EPCR1_TXE) = (v))
#endif
//@}
//-------------------------------------------------------------------------------------------
// HW_USBHS_EPCR2 - Endpoint Control Register n
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPCR2 - Endpoint Control Register n (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers are not defined in the EHCI specification. There is an EPCRn
 * register for each endpoint in a device.
 */
typedef union _hw_usbhs_epcr2
{
    uint32_t U;
    struct _hw_usbhs_epcr2_bitfields
    {
        uint32_t RXS : 1;              //!< [0] RX endpoint Stall
        uint32_t RXD : 1;              //!< [1] RX endpoint Data sink
        uint32_t RXT : 2;              //!< [3:2] RX endpoint Type
        uint32_t RESERVED0 : 1;        //!< [4] Reserved
        uint32_t RXI : 1;              //!< [5] RX data toggle Inhibit
        uint32_t RXR : 1;              //!< [6] RX data toggle Reset
        uint32_t RXE : 1;              //!< [7] RX endpoint Enable
        uint32_t RESERVED1 : 8;        //!< [15:8] Reserved
        uint32_t TXS : 1;              //!< [16] TX endpoint Stall
        uint32_t TXD : 1;              //!< [17] TX endpoint Data source
        uint32_t TXT : 2;              //!< [19:18] TX endpoint Type
        uint32_t RESERVED2 : 1;        //!< [20] Reserved
        uint32_t TXI : 1;              //!< [21] TX data toggle Inhibit
        uint32_t TXR : 1;              //!< [22] TX data toggle Reset
        uint32_t TXE : 1;              //!< [23] TX endpoint Enable
        uint32_t RESERVED3 : 8;        //!< [31:24] Reserved
    } B;
} hw_usbhs_epcr2_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPCR2 register
 */
//@{
#define HW_USBHS_EPCR2_ADDR      (REGS_USBHS_BASE + 0x1C8U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPCR2           (*(__IO hw_usbhs_epcr2_t *) HW_USBHS_EPCR2_ADDR)
#define HW_USBHS_EPCR2_RD()      (HW_USBHS_EPCR2.U)
#define HW_USBHS_EPCR2_WR(v)     (HW_USBHS_EPCR2.U = (v))
#define HW_USBHS_EPCR2_SET(v)    (HW_USBHS_EPCR2_WR(HW_USBHS_EPCR2_RD() |  (v)))
#define HW_USBHS_EPCR2_CLR(v)    (HW_USBHS_EPCR2_WR(HW_USBHS_EPCR2_RD() & ~(v)))
#define HW_USBHS_EPCR2_TOG(v)    (HW_USBHS_EPCR2_WR(HW_USBHS_EPCR2_RD() ^  (v)))
#endif
//@}

/*
 * Constants & macros for individual USBHS_EPCR2 bitfields
 */

/*!
 * @name Register USBHS_EPCR2, field RXS[0] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR2_RXS   (0U)          //!< Bit position for USBHS_EPCR2_RXS.
#define BM_USBHS_EPCR2_RXS   (0x00000001U) //!< Bit mask for USBHS_EPCR2_RXS.
#define BS_USBHS_EPCR2_RXS   (1U)          //!< Bit field size in bits for USBHS_EPCR2_RXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_RXS field.
#define BR_USBHS_EPCR2_RXS   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_RXS.
#define BF_USBHS_EPCR2_RXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_RXS), uint32_t) & BM_USBHS_EPCR2_RXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXS field to a new value.
#define BW_USBHS_EPCR2_RXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field RXD[1] (RW)
 */
//@{
#define BP_USBHS_EPCR2_RXD   (1U)          //!< Bit position for USBHS_EPCR2_RXD.
#define BM_USBHS_EPCR2_RXD   (0x00000002U) //!< Bit mask for USBHS_EPCR2_RXD.
#define BS_USBHS_EPCR2_RXD   (1U)          //!< Bit field size in bits for USBHS_EPCR2_RXD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_RXD field.
#define BR_USBHS_EPCR2_RXD   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXD))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_RXD.
#define BF_USBHS_EPCR2_RXD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_RXD), uint32_t) & BM_USBHS_EPCR2_RXD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXD field to a new value.
#define BW_USBHS_EPCR2_RXD(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field RXT[3:2] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
//@{
#define BP_USBHS_EPCR2_RXT   (2U)          //!< Bit position for USBHS_EPCR2_RXT.
#define BM_USBHS_EPCR2_RXT   (0x0000000CU) //!< Bit mask for USBHS_EPCR2_RXT.
#define BS_USBHS_EPCR2_RXT   (2U)          //!< Bit field size in bits for USBHS_EPCR2_RXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_RXT field.
#define BR_USBHS_EPCR2_RXT   (HW_USBHS_EPCR2.B.RXT)
#endif

//! @brief Format value for bitfield USBHS_EPCR2_RXT.
#define BF_USBHS_EPCR2_RXT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_RXT), uint32_t) & BM_USBHS_EPCR2_RXT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXT field to a new value.
#define BW_USBHS_EPCR2_RXT(v) (HW_USBHS_EPCR2_WR((HW_USBHS_EPCR2_RD() & ~BM_USBHS_EPCR2_RXT) | BF_USBHS_EPCR2_RXT(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field RXI[5] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
//@{
#define BP_USBHS_EPCR2_RXI   (5U)          //!< Bit position for USBHS_EPCR2_RXI.
#define BM_USBHS_EPCR2_RXI   (0x00000020U) //!< Bit mask for USBHS_EPCR2_RXI.
#define BS_USBHS_EPCR2_RXI   (1U)          //!< Bit field size in bits for USBHS_EPCR2_RXI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_RXI field.
#define BR_USBHS_EPCR2_RXI   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXI))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_RXI.
#define BF_USBHS_EPCR2_RXI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_RXI), uint32_t) & BM_USBHS_EPCR2_RXI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXI field to a new value.
#define BW_USBHS_EPCR2_RXI(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field RXR[6] (WO)
 */
//@{
#define BP_USBHS_EPCR2_RXR   (6U)          //!< Bit position for USBHS_EPCR2_RXR.
#define BM_USBHS_EPCR2_RXR   (0x00000040U) //!< Bit mask for USBHS_EPCR2_RXR.
#define BS_USBHS_EPCR2_RXR   (1U)          //!< Bit field size in bits for USBHS_EPCR2_RXR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_RXR field.
#define BR_USBHS_EPCR2_RXR   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXR))
#endif

