ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_EPCR2_RXR.
#define BF_USBHS_EPCR2_RXR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_RXR), uint32_t) & BM_USBHS_EPCR2_RXR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXR field to a new value.
#define BW_USBHS_EPCR2_RXR(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field RXE[7] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR2_RXE   (7U)          //!< Bit position for USBHS_EPCR2_RXE.
#define BM_USBHS_EPCR2_RXE   (0x00000080U) //!< Bit mask for USBHS_EPCR2_RXE.
#define BS_USBHS_EPCR2_RXE   (1U)          //!< Bit field size in bits for USBHS_EPCR2_RXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_RXE field.
#define BR_USBHS_EPCR2_RXE   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXE))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_RXE.
#define BF_USBHS_EPCR2_RXE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_RXE), uint32_t) & BM_USBHS_EPCR2_RXE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXE field to a new value.
#define BW_USBHS_EPCR2_RXE(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_RXE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field TXS[16] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR2_TXS   (16U)         //!< Bit position for USBHS_EPCR2_TXS.
#define BM_USBHS_EPCR2_TXS   (0x00010000U) //!< Bit mask for USBHS_EPCR2_TXS.
#define BS_USBHS_EPCR2_TXS   (1U)          //!< Bit field size in bits for USBHS_EPCR2_TXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_TXS field.
#define BR_USBHS_EPCR2_TXS   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_TXS.
#define BF_USBHS_EPCR2_TXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_TXS), uint32_t) & BM_USBHS_EPCR2_TXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXS field to a new value.
#define BW_USBHS_EPCR2_TXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field TXD[17] (RW)
 */
//@{
#define BP_USBHS_EPCR2_TXD   (17U)         //!< Bit position for USBHS_EPCR2_TXD.
#define BM_USBHS_EPCR2_TXD   (0x00020000U) //!< Bit mask for USBHS_EPCR2_TXD.
#define BS_USBHS_EPCR2_TXD   (1U)          //!< Bit field size in bits for USBHS_EPCR2_TXD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_TXD field.
#define BR_USBHS_EPCR2_TXD   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXD))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_TXD.
#define BF_USBHS_EPCR2_TXD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_TXD), uint32_t) & BM_USBHS_EPCR2_TXD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXD field to a new value.
#define BW_USBHS_EPCR2_TXD(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field TXT[19:18] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
//@{
#define BP_USBHS_EPCR2_TXT   (18U)         //!< Bit position for USBHS_EPCR2_TXT.
#define BM_USBHS_EPCR2_TXT   (0x000C0000U) //!< Bit mask for USBHS_EPCR2_TXT.
#define BS_USBHS_EPCR2_TXT   (2U)          //!< Bit field size in bits for USBHS_EPCR2_TXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_TXT field.
#define BR_USBHS_EPCR2_TXT   (HW_USBHS_EPCR2.B.TXT)
#endif

//! @brief Format value for bitfield USBHS_EPCR2_TXT.
#define BF_USBHS_EPCR2_TXT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_TXT), uint32_t) & BM_USBHS_EPCR2_TXT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXT field to a new value.
#define BW_USBHS_EPCR2_TXT(v) (HW_USBHS_EPCR2_WR((HW_USBHS_EPCR2_RD() & ~BM_USBHS_EPCR2_TXT) | BF_USBHS_EPCR2_TXT(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field TXI[21] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
//@{
#define BP_USBHS_EPCR2_TXI   (21U)         //!< Bit position for USBHS_EPCR2_TXI.
#define BM_USBHS_EPCR2_TXI   (0x00200000U) //!< Bit mask for USBHS_EPCR2_TXI.
#define BS_USBHS_EPCR2_TXI   (1U)          //!< Bit field size in bits for USBHS_EPCR2_TXI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_TXI field.
#define BR_USBHS_EPCR2_TXI   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXI))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_TXI.
#define BF_USBHS_EPCR2_TXI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_TXI), uint32_t) & BM_USBHS_EPCR2_TXI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXI field to a new value.
#define BW_USBHS_EPCR2_TXI(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field TXR[22] (WO)
 */
//@{
#define BP_USBHS_EPCR2_TXR   (22U)         //!< Bit position for USBHS_EPCR2_TXR.
#define BM_USBHS_EPCR2_TXR   (0x00400000U) //!< Bit mask for USBHS_EPCR2_TXR.
#define BS_USBHS_EPCR2_TXR   (1U)          //!< Bit field size in bits for USBHS_EPCR2_TXR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_TXR field.
#define BR_USBHS_EPCR2_TXR   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXR))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_TXR.
#define BF_USBHS_EPCR2_TXR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_TXR), uint32_t) & BM_USBHS_EPCR2_TXR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXR field to a new value.
#define BW_USBHS_EPCR2_TXR(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR2, field TXE[23] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR2_TXE   (23U)         //!< Bit position for USBHS_EPCR2_TXE.
#define BM_USBHS_EPCR2_TXE   (0x00800000U) //!< Bit mask for USBHS_EPCR2_TXE.
#define BS_USBHS_EPCR2_TXE   (1U)          //!< Bit field size in bits for USBHS_EPCR2_TXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR2_TXE field.
#define BR_USBHS_EPCR2_TXE   (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXE))
#endif

//! @brief Format value for bitfield USBHS_EPCR2_TXE.
#define BF_USBHS_EPCR2_TXE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR2_TXE), uint32_t) & BM_USBHS_EPCR2_TXE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXE field to a new value.
#define BW_USBHS_EPCR2_TXE(v) (BITBAND_ACCESS32(HW_USBHS_EPCR2_ADDR, BP_USBHS_EPCR2_TXE) = (v))
#endif
//@}
//-------------------------------------------------------------------------------------------
// HW_USBHS_EPCR3 - Endpoint Control Register n
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_EPCR3 - Endpoint Control Register n (RW)
 *
 * Reset value: 0x00000000U
 *
 * These registers are not defined in the EHCI specification. There is an EPCRn
 * register for each endpoint in a device.
 */
typedef union _hw_usbhs_epcr3
{
    uint32_t U;
    struct _hw_usbhs_epcr3_bitfields
    {
        uint32_t RXS : 1;              //!< [0] RX endpoint Stall
        uint32_t RXD : 1;              //!< [1] RX endpoint Data sink
        uint32_t RXT : 2;              //!< [3:2] RX endpoint Type
        uint32_t RESERVED0 : 1;        //!< [4] Reserved
        uint32_t RXI : 1;              //!< [5] RX data toggle Inhibit
        uint32_t RXR : 1;              //!< [6] RX data toggle Reset
        uint32_t RXE : 1;              //!< [7] RX endpoint Enable
        uint32_t RESERVED1 : 8;        //!< [15:8] Reserved
        uint32_t TXS : 1;              //!< [16] TX endpoint Stall
        uint32_t TXD : 1;              //!< [17] TX endpoint Data source
        uint32_t TXT : 2;              //!< [19:18] TX endpoint Type
        uint32_t RESERVED2 : 1;        //!< [20] Reserved
        uint32_t TXI : 1;              //!< [21] TX data toggle Inhibit
        uint32_t TXR : 1;              //!< [22] TX data toggle Reset
        uint32_t TXE : 1;              //!< [23] TX endpoint Enable
        uint32_t RESERVED3 : 8;        //!< [31:24] Reserved
    } B;
} hw_usbhs_epcr3_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_EPCR3 register
 */
//@{
#define HW_USBHS_EPCR3_ADDR      (REGS_USBHS_BASE + 0x1CCU)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_EPCR3           (*(__IO hw_usbhs_epcr3_t *) HW_USBHS_EPCR3_ADDR)
#define HW_USBHS_EPCR3_RD()      (HW_USBHS_EPCR3.U)
#define HW_USBHS_EPCR3_WR(v)     (HW_USBHS_EPCR3.U = (v))
#define HW_USBHS_EPCR3_SET(v)    (HW_USBHS_EPCR3_WR(HW_USBHS_EPCR3_RD() |  (v)))
#define HW_USBHS_EPCR3_CLR(v)    (HW_USBHS_EPCR3_WR(HW_USBHS_EPCR3_RD() & ~(v)))
#define HW_USBHS_EPCR3_TOG(v)    (HW_USBHS_EPCR3_WR(HW_USBHS_EPCR3_RD() ^  (v)))
#endif
//@}

