ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_EPCR3 bitfields
 */

/*!
 * @name Register USBHS_EPCR3, field RXS[0] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR3_RXS   (0U)          //!< Bit position for USBHS_EPCR3_RXS.
#define BM_USBHS_EPCR3_RXS   (0x00000001U) //!< Bit mask for USBHS_EPCR3_RXS.
#define BS_USBHS_EPCR3_RXS   (1U)          //!< Bit field size in bits for USBHS_EPCR3_RXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_RXS field.
#define BR_USBHS_EPCR3_RXS   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXS))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_RXS.
#define BF_USBHS_EPCR3_RXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_RXS), uint32_t) & BM_USBHS_EPCR3_RXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXS field to a new value.
#define BW_USBHS_EPCR3_RXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field RXD[1] (RW)
 */
//@{
#define BP_USBHS_EPCR3_RXD   (1U)          //!< Bit position for USBHS_EPCR3_RXD.
#define BM_USBHS_EPCR3_RXD   (0x00000002U) //!< Bit mask for USBHS_EPCR3_RXD.
#define BS_USBHS_EPCR3_RXD   (1U)          //!< Bit field size in bits for USBHS_EPCR3_RXD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_RXD field.
#define BR_USBHS_EPCR3_RXD   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXD))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_RXD.
#define BF_USBHS_EPCR3_RXD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_RXD), uint32_t) & BM_USBHS_EPCR3_RXD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXD field to a new value.
#define BW_USBHS_EPCR3_RXD(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field RXT[3:2] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
//@{
#define BP_USBHS_EPCR3_RXT   (2U)          //!< Bit position for USBHS_EPCR3_RXT.
#define BM_USBHS_EPCR3_RXT   (0x0000000CU) //!< Bit mask for USBHS_EPCR3_RXT.
#define BS_USBHS_EPCR3_RXT   (2U)          //!< Bit field size in bits for USBHS_EPCR3_RXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_RXT field.
#define BR_USBHS_EPCR3_RXT   (HW_USBHS_EPCR3.B.RXT)
#endif

//! @brief Format value for bitfield USBHS_EPCR3_RXT.
#define BF_USBHS_EPCR3_RXT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_RXT), uint32_t) & BM_USBHS_EPCR3_RXT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXT field to a new value.
#define BW_USBHS_EPCR3_RXT(v) (HW_USBHS_EPCR3_WR((HW_USBHS_EPCR3_RD() & ~BM_USBHS_EPCR3_RXT) | BF_USBHS_EPCR3_RXT(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field RXI[5] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
//@{
#define BP_USBHS_EPCR3_RXI   (5U)          //!< Bit position for USBHS_EPCR3_RXI.
#define BM_USBHS_EPCR3_RXI   (0x00000020U) //!< Bit mask for USBHS_EPCR3_RXI.
#define BS_USBHS_EPCR3_RXI   (1U)          //!< Bit field size in bits for USBHS_EPCR3_RXI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_RXI field.
#define BR_USBHS_EPCR3_RXI   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXI))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_RXI.
#define BF_USBHS_EPCR3_RXI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_RXI), uint32_t) & BM_USBHS_EPCR3_RXI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXI field to a new value.
#define BW_USBHS_EPCR3_RXI(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field RXR[6] (WO)
 */
//@{
#define BP_USBHS_EPCR3_RXR   (6U)          //!< Bit position for USBHS_EPCR3_RXR.
#define BM_USBHS_EPCR3_RXR   (0x00000040U) //!< Bit mask for USBHS_EPCR3_RXR.
#define BS_USBHS_EPCR3_RXR   (1U)          //!< Bit field size in bits for USBHS_EPCR3_RXR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_RXR field.
#define BR_USBHS_EPCR3_RXR   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXR))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_RXR.
#define BF_USBHS_EPCR3_RXR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_RXR), uint32_t) & BM_USBHS_EPCR3_RXR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXR field to a new value.
#define BW_USBHS_EPCR3_RXR(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field RXE[7] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR3_RXE   (7U)          //!< Bit position for USBHS_EPCR3_RXE.
#define BM_USBHS_EPCR3_RXE   (0x00000080U) //!< Bit mask for USBHS_EPCR3_RXE.
#define BS_USBHS_EPCR3_RXE   (1U)          //!< Bit field size in bits for USBHS_EPCR3_RXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_RXE field.
#define BR_USBHS_EPCR3_RXE   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXE))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_RXE.
#define BF_USBHS_EPCR3_RXE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_RXE), uint32_t) & BM_USBHS_EPCR3_RXE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the RXE field to a new value.
#define BW_USBHS_EPCR3_RXE(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_RXE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field TXS[16] (RW)
 *
 * Values:
 * - 0 - Endpoint OK
 * - 1 - Endpoint stalled
 */
//@{
#define BP_USBHS_EPCR3_TXS   (16U)         //!< Bit position for USBHS_EPCR3_TXS.
#define BM_USBHS_EPCR3_TXS   (0x00010000U) //!< Bit mask for USBHS_EPCR3_TXS.
#define BS_USBHS_EPCR3_TXS   (1U)          //!< Bit field size in bits for USBHS_EPCR3_TXS.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_TXS field.
#define BR_USBHS_EPCR3_TXS   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXS))
#endif

