ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
//! @brief Format value for bitfield USBHS_EPCR3_TXS.
#define BF_USBHS_EPCR3_TXS(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_TXS), uint32_t) & BM_USBHS_EPCR3_TXS)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXS field to a new value.
#define BW_USBHS_EPCR3_TXS(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXS) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field TXD[17] (RW)
 */
//@{
#define BP_USBHS_EPCR3_TXD   (17U)         //!< Bit position for USBHS_EPCR3_TXD.
#define BM_USBHS_EPCR3_TXD   (0x00020000U) //!< Bit mask for USBHS_EPCR3_TXD.
#define BS_USBHS_EPCR3_TXD   (1U)          //!< Bit field size in bits for USBHS_EPCR3_TXD.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_TXD field.
#define BR_USBHS_EPCR3_TXD   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXD))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_TXD.
#define BF_USBHS_EPCR3_TXD(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_TXD), uint32_t) & BM_USBHS_EPCR3_TXD)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXD field to a new value.
#define BW_USBHS_EPCR3_TXD(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXD) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field TXT[19:18] (RW)
 *
 * Values:
 * - 00 - Control
 * - 01 - Isochronous
 * - 10 - Bulk
 * - 11 - Interrupt
 */
//@{
#define BP_USBHS_EPCR3_TXT   (18U)         //!< Bit position for USBHS_EPCR3_TXT.
#define BM_USBHS_EPCR3_TXT   (0x000C0000U) //!< Bit mask for USBHS_EPCR3_TXT.
#define BS_USBHS_EPCR3_TXT   (2U)          //!< Bit field size in bits for USBHS_EPCR3_TXT.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_TXT field.
#define BR_USBHS_EPCR3_TXT   (HW_USBHS_EPCR3.B.TXT)
#endif

//! @brief Format value for bitfield USBHS_EPCR3_TXT.
#define BF_USBHS_EPCR3_TXT(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_TXT), uint32_t) & BM_USBHS_EPCR3_TXT)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXT field to a new value.
#define BW_USBHS_EPCR3_TXT(v) (HW_USBHS_EPCR3_WR((HW_USBHS_EPCR3_RD() & ~BM_USBHS_EPCR3_TXT) | BF_USBHS_EPCR3_TXT(v)))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field TXI[21] (RW)
 *
 * Values:
 * - 0 - PID sequencing enabled
 * - 1 - PID sequencing disabled
 */
//@{
#define BP_USBHS_EPCR3_TXI   (21U)         //!< Bit position for USBHS_EPCR3_TXI.
#define BM_USBHS_EPCR3_TXI   (0x00200000U) //!< Bit mask for USBHS_EPCR3_TXI.
#define BS_USBHS_EPCR3_TXI   (1U)          //!< Bit field size in bits for USBHS_EPCR3_TXI.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_TXI field.
#define BR_USBHS_EPCR3_TXI   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXI))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_TXI.
#define BF_USBHS_EPCR3_TXI(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_TXI), uint32_t) & BM_USBHS_EPCR3_TXI)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXI field to a new value.
#define BW_USBHS_EPCR3_TXI(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXI) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field TXR[22] (WO)
 */
//@{
#define BP_USBHS_EPCR3_TXR   (22U)         //!< Bit position for USBHS_EPCR3_TXR.
#define BM_USBHS_EPCR3_TXR   (0x00400000U) //!< Bit mask for USBHS_EPCR3_TXR.
#define BS_USBHS_EPCR3_TXR   (1U)          //!< Bit field size in bits for USBHS_EPCR3_TXR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_TXR field.
#define BR_USBHS_EPCR3_TXR   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXR))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_TXR.
#define BF_USBHS_EPCR3_TXR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_TXR), uint32_t) & BM_USBHS_EPCR3_TXR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXR field to a new value.
#define BW_USBHS_EPCR3_TXR(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXR) = (v))
#endif
//@}

/*!
 * @name Register USBHS_EPCR3, field TXE[23] (RW)
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_EPCR3_TXE   (23U)         //!< Bit position for USBHS_EPCR3_TXE.
#define BM_USBHS_EPCR3_TXE   (0x00800000U) //!< Bit mask for USBHS_EPCR3_TXE.
#define BS_USBHS_EPCR3_TXE   (1U)          //!< Bit field size in bits for USBHS_EPCR3_TXE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_EPCR3_TXE field.
#define BR_USBHS_EPCR3_TXE   (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXE))
#endif

//! @brief Format value for bitfield USBHS_EPCR3_TXE.
#define BF_USBHS_EPCR3_TXE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_EPCR3_TXE), uint32_t) & BM_USBHS_EPCR3_TXE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the TXE field to a new value.
#define BW_USBHS_EPCR3_TXE(v) (BITBAND_ACCESS32(HW_USBHS_EPCR3_ADDR, BP_USBHS_EPCR3_TXE) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// HW_USBHS_USBGENCTRL - USB General Control Register
//-------------------------------------------------------------------------------------------

#ifndef __LANGUAGE_ASM__
/*!
 * @brief HW_USBHS_USBGENCTRL - USB General Control Register (RW)
 *
 * Reset value: 0x00000000U
 *
 * This register is not defined in the EHCI specification.
 */
typedef union _hw_usbhs_usbgenctrl
{
    uint32_t U;
    struct _hw_usbhs_usbgenctrl_bitfields
    {
        uint32_t WU_IE : 1;            //!< [0] Wakeup Interrupt Enable
        uint32_t WU_ULPI_EN : 1;       //!< [1] Wakeup on ULPI Interrupt Event
        uint32_t RESERVED0 : 3;        //!< [4:2] Reserved
        uint32_t WU_INT_CLR : 1;       //!< [5] Wakeup Interrupt Clear
        uint32_t RESERVED1 : 26;       //!< [31:6] Reserved
    } B;
} hw_usbhs_usbgenctrl_t;
#endif

/*!
 * @name Constants and macros for entire USBHS_USBGENCTRL register
 */
//@{
#define HW_USBHS_USBGENCTRL_ADDR (REGS_USBHS_BASE + 0x200U)

#ifndef __LANGUAGE_ASM__
#define HW_USBHS_USBGENCTRL      (*(__IO hw_usbhs_usbgenctrl_t *) HW_USBHS_USBGENCTRL_ADDR)
#define HW_USBHS_USBGENCTRL_RD() (HW_USBHS_USBGENCTRL.U)
#define HW_USBHS_USBGENCTRL_WR(v) (HW_USBHS_USBGENCTRL.U = (v))
#define HW_USBHS_USBGENCTRL_SET(v) (HW_USBHS_USBGENCTRL_WR(HW_USBHS_USBGENCTRL_RD() |  (v)))
#define HW_USBHS_USBGENCTRL_CLR(v) (HW_USBHS_USBGENCTRL_WR(HW_USBHS_USBGENCTRL_RD() & ~(v)))
#define HW_USBHS_USBGENCTRL_TOG(v) (HW_USBHS_USBGENCTRL_WR(HW_USBHS_USBGENCTRL_RD() ^  (v)))
#endif
//@}

