ARMmbed/DAPLink/interface/flash_algo_mdk/MKXXX/include/device/MK70F12/MK70F12_usbhs.h
/*
 * Constants & macros for individual USBHS_USBGENCTRL bitfields
 */

/*!
 * @name Register USBHS_USBGENCTRL, field WU_IE[0] (RW)
 *
 * This bit is used to enable the low power wakeup interrupt.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBGENCTRL_WU_IE (0U)     //!< Bit position for USBHS_USBGENCTRL_WU_IE.
#define BM_USBHS_USBGENCTRL_WU_IE (0x00000001U) //!< Bit mask for USBHS_USBGENCTRL_WU_IE.
#define BS_USBHS_USBGENCTRL_WU_IE (1U)     //!< Bit field size in bits for USBHS_USBGENCTRL_WU_IE.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBGENCTRL_WU_IE field.
#define BR_USBHS_USBGENCTRL_WU_IE (BITBAND_ACCESS32(HW_USBHS_USBGENCTRL_ADDR, BP_USBHS_USBGENCTRL_WU_IE))
#endif

//! @brief Format value for bitfield USBHS_USBGENCTRL_WU_IE.
#define BF_USBHS_USBGENCTRL_WU_IE(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBGENCTRL_WU_IE), uint32_t) & BM_USBHS_USBGENCTRL_WU_IE)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WU_IE field to a new value.
#define BW_USBHS_USBGENCTRL_WU_IE(v) (BITBAND_ACCESS32(HW_USBHS_USBGENCTRL_ADDR, BP_USBHS_USBGENCTRL_WU_IE) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBGENCTRL, field WU_ULPI_EN[1] (RW)
 *
 * This bit is used to enable the wake up from the ULPI I/F.
 *
 * Values:
 * - 0 - Disabled
 * - 1 - Enabled
 */
//@{
#define BP_USBHS_USBGENCTRL_WU_ULPI_EN (1U) //!< Bit position for USBHS_USBGENCTRL_WU_ULPI_EN.
#define BM_USBHS_USBGENCTRL_WU_ULPI_EN (0x00000002U) //!< Bit mask for USBHS_USBGENCTRL_WU_ULPI_EN.
#define BS_USBHS_USBGENCTRL_WU_ULPI_EN (1U) //!< Bit field size in bits for USBHS_USBGENCTRL_WU_ULPI_EN.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBGENCTRL_WU_ULPI_EN field.
#define BR_USBHS_USBGENCTRL_WU_ULPI_EN (BITBAND_ACCESS32(HW_USBHS_USBGENCTRL_ADDR, BP_USBHS_USBGENCTRL_WU_ULPI_EN))
#endif

//! @brief Format value for bitfield USBHS_USBGENCTRL_WU_ULPI_EN.
#define BF_USBHS_USBGENCTRL_WU_ULPI_EN(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBGENCTRL_WU_ULPI_EN), uint32_t) & BM_USBHS_USBGENCTRL_WU_ULPI_EN)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WU_ULPI_EN field to a new value.
#define BW_USBHS_USBGENCTRL_WU_ULPI_EN(v) (BITBAND_ACCESS32(HW_USBHS_USBGENCTRL_ADDR, BP_USBHS_USBGENCTRL_WU_ULPI_EN) = (v))
#endif
//@}

/*!
 * @name Register USBHS_USBGENCTRL, field WU_INT_CLR[5] (RW)
 *
 * Values:
 * - 0 - Default, no action.
 * - 1 - Clear the wake-up interrupt.
 */
//@{
#define BP_USBHS_USBGENCTRL_WU_INT_CLR (5U) //!< Bit position for USBHS_USBGENCTRL_WU_INT_CLR.
#define BM_USBHS_USBGENCTRL_WU_INT_CLR (0x00000020U) //!< Bit mask for USBHS_USBGENCTRL_WU_INT_CLR.
#define BS_USBHS_USBGENCTRL_WU_INT_CLR (1U) //!< Bit field size in bits for USBHS_USBGENCTRL_WU_INT_CLR.

#ifndef __LANGUAGE_ASM__
//! @brief Read current value of the USBHS_USBGENCTRL_WU_INT_CLR field.
#define BR_USBHS_USBGENCTRL_WU_INT_CLR (BITBAND_ACCESS32(HW_USBHS_USBGENCTRL_ADDR, BP_USBHS_USBGENCTRL_WU_INT_CLR))
#endif

//! @brief Format value for bitfield USBHS_USBGENCTRL_WU_INT_CLR.
#define BF_USBHS_USBGENCTRL_WU_INT_CLR(v) (__REG_VALUE_TYPE((__REG_VALUE_TYPE((v), uint32_t) << BP_USBHS_USBGENCTRL_WU_INT_CLR), uint32_t) & BM_USBHS_USBGENCTRL_WU_INT_CLR)

#ifndef __LANGUAGE_ASM__
//! @brief Set the WU_INT_CLR field to a new value.
#define BW_USBHS_USBGENCTRL_WU_INT_CLR(v) (BITBAND_ACCESS32(HW_USBHS_USBGENCTRL_ADDR, BP_USBHS_USBGENCTRL_WU_INT_CLR) = (v))
#endif
//@}

//-------------------------------------------------------------------------------------------
// hw_usbhs_t - module struct
//-------------------------------------------------------------------------------------------
/*!
 * @brief All USBHS module registers.
 */
#ifndef __LANGUAGE_ASM__
#pragma pack(1)
typedef struct _hw_usbhs
{
    __I hw_usbhs_id_t ID;                  //!< [0x0] Identification Register
    __I hw_usbhs_hwgeneral_t HWGENERAL;    //!< [0x4] General Hardware Parameters Register
    __I hw_usbhs_hwhost_t HWHOST;          //!< [0x8] Host Hardware Parameters Register
    __I hw_usbhs_hwdevice_t HWDEVICE;      //!< [0xC] Device Hardware Parameters Register
    __I hw_usbhs_hwtxbuf_t HWTXBUF;        //!< [0x10] Transmit Buffer Hardware Parameters Register
    __I hw_usbhs_hwrxbuf_t HWRXBUF;        //!< [0x14] Receive Buffer Hardware Parameters Register
    uint8_t _reserved0[104];
    __IO hw_usbhs_gptimer0ld_t GPTIMER0LD; //!< [0x80] General Purpose Timer n Load Register
    __IO hw_usbhs_gptimer0ctl_t GPTIMER0CTL; //!< [0x84] General Purpose Timer n Control Register
    __IO hw_usbhs_gptimer1ld_t GPTIMER1LD; //!< [0x88] General Purpose Timer n Load Register
    __IO hw_usbhs_gptimer1ctl_t GPTIMER1CTL; //!< [0x8C] General Purpose Timer n Control Register
    __IO hw_usbhs_usb_sbuscfg_t USB_SBUSCFG; //!< [0x90] System Bus Interface Configuration Register
    uint8_t _reserved1[108];
    __I hw_usbhs_hciversion_t HCIVERSION;  //!< [0x100] Host Controller Interface Version and Capability Registers Length Register
    __I hw_usbhs_hcsparams_t HCSPARAMS;    //!< [0x104] Host Controller Structural Parameters Register
    __I hw_usbhs_hccparams_t HCCPARAMS;    //!< [0x108] Host Controller Capability Parameters Register
    uint8_t _reserved2[22];
    __I hw_usbhs_dciversion_t DCIVERSION;  //!< [0x122] Device Controller Interface Version
    __I hw_usbhs_dccparams_t DCCPARAMS;    //!< [0x124] Device Controller Capability Parameters
    uint8_t _reserved3[24];
    __IO hw_usbhs_usbcmd_t USBCMD;         //!< [0x140] USB Command Register
    __IO hw_usbhs_usbsts_t USBSTS;         //!< [0x144] USB Status Register
    __IO hw_usbhs_usbintr_t USBINTR;       //!< [0x148] USB Interrupt Enable Register
    __IO hw_usbhs_frindex_t FRINDEX;       //!< [0x14C] Frame Index Register
    uint8_t _reserved4[4];
    union {
        __IO hw_usbhs_deviceaddr_t DEVICEADDR; //!< [0x154] Device Address Register
        __IO hw_usbhs_periodiclistbase_t PERIODICLISTBASE; //!< [0x154] Periodic Frame List Base Address Register
    };
    union {
        __IO hw_usbhs_asynclistaddr_t ASYNCLISTADDR; //!< [0x158] Current Asynchronous List Address Register
        __IO hw_usbhs_eplistaddr_t EPLISTADDR; //!< [0x158] Endpoint List Address Register
    };
    __I hw_usbhs_ttctrl_t TTCTRL;          //!< [0x15C] Host TT Asynchronous Buffer Control
    __IO hw_usbhs_burstsize_t BURSTSIZE;   //!< [0x160] Master Interface Data Burst Size Register
    __IO hw_usbhs_txfilltuning_t TXFILLTUNING; //!< [0x164] Transmit FIFO Tuning Control Register
    uint8_t _reserved5[8];
    __IO hw_usbhs_ulpi_viewport_t ULPI_VIEWPORT; //!< [0x170] ULPI Register Access
    uint8_t _reserved6[4];
    __IO hw_usbhs_endptnak_t ENDPTNAK;     //!< [0x178] Endpoint NAK Register
    __IO hw_usbhs_endptnaken_t ENDPTNAKEN; //!< [0x17C] Endpoint NAK Enable Register
    __I hw_usbhs_configflag_t CONFIGFLAG;  //!< [0x180] Configure Flag Register
    __IO hw_usbhs_portsc1_t PORTSC1;       //!< [0x184] Port Status and Control Registers
    uint8_t _reserved7[28];
    __IO hw_usbhs_otgsc_t OTGSC;           //!< [0x1A4] On-the-Go Status and Control Register
    __IO hw_usbhs_usbmode_t USBMODE;       //!< [0x1A8] USB Mode Register
    __IO hw_usbhs_epsetupsr_t EPSETUPSR;   //!< [0x1AC] Endpoint Setup Status Register
    __IO hw_usbhs_epprime_t EPPRIME;       //!< [0x1B0] Endpoint Initialization Register
    __IO hw_usbhs_epflush_t EPFLUSH;       //!< [0x1B4] Endpoint Flush Register
    __I hw_usbhs_epsr_t EPSR;              //!< [0x1B8] Endpoint Status Register
    __IO hw_usbhs_epcomplete_t EPCOMPLETE; //!< [0x1BC] Endpoint Complete Register
    __IO hw_usbhs_epcr0_t EPCR0;           //!< [0x1C0] Endpoint Control Register 0
    __IO hw_usbhs_epcr1_t EPCR1;           //!< [0x1C4] Endpoint Control Register n
    __IO hw_usbhs_epcr2_t EPCR2;           //!< [0x1C8] Endpoint Control Register n
    __IO hw_usbhs_epcr3_t EPCR3;           //!< [0x1CC] Endpoint Control Register n
    uint8_t _reserved8[48];
    __IO hw_usbhs_usbgenctrl_t USBGENCTRL; //!< [0x200] USB General Control Register
} hw_usbhs_t;
#pragma pack()

//! @brief Macro to access all USBHS registers.
//! @return Reference (not a pointer) to the registers struct. To get a pointer to the struct,
//!     use the '&' operator, like <code>&HW_USBHS</code>.
#define HW_USBHS       (*(hw_usbhs_t *) REGS_USBHS_BASE)
#endif

#endif // __HW_USBHS_REGISTERS_H__
// v22/130726/0.9
// EOF
